{
  "title": "맘꽃가든 스마트팜 구축사례",
  "description": "2020년부터 2025년까지 맘꽃가든의 스마트팜 구축, 설치, 시연 등 관련 사례들",
  "total_cases": 343,
  "data_source": "mfgarden_blog_data/contents_20250313_214139.json",
  "cases": [
    {
      "id": "223789667277",
      "title": "2025.03.07 : KT인터넷 설치",
      "date": "2025. 3. 9. 16:18",
      "content": "이제 시설하우스에 인터넷 설치가 필수가 되다보니, KT와 협업이 자연스럽게 이루어지고 있다. 다행히 KT 제주지역본부 법인팀에서 많이 도와주셔서 인터넷 설치가 어려운 농가에도 설치 부담없이 인터넷 설치가 될 수 있는 방향으로 지도해 주신다. 이번 키위 6개 농가 데이터 수집하는 사업에도 농가 부담없이 인터넷 설치가 될 것 같다..\n이제 제주도 스마트팜 설치하면 CCTV랑 인터넷 설치가 먼저라는 것이 다 아는 상식이 되어 간다.\nIoT기술이 농업 현장에 확산되는 것은 로봇이 생산현장에 확산되는 것 만큼 큰 흐름이 되어간다.\n멀리서 인터넷선 끌어온다고 고생하시는 KT 직원분들 감사합니다.",
      "content_length": 330
    },
    {
      "id": "223749385443",
      "title": "2025.02.04 : 아라플랫폼 현장 실증 기업 선정",
      "date": "2025. 2. 6. 7:30",
      "content": "농촌진흥청 산하 시설원예연구소에서 개발 실증중인 차세대 스마트 온실 플랫폼 \"아라\"를 현장 실증하기 위한 연구과제에 제주도 대표로서 맘꽃가든이 선정되었다. 농업인에게 편리하고 \"저비용\", \"저개발\", \"신시장 개척\" 위한 국가 연구 활동에 참여할 기회가 생긴 것에 감사하며, 착실히 현장 실증하고 그 결과를 농업인들에게 돌려줄 수 있도록 했으면 한다.\n추운 날씨에 맘이 움츠려 들지만 나에게 주어진 일들을 생각하면 몸이 움직여 진다.. 아자아자!! 추위야 물러가라.",
      "content_length": 260
    },
    {
      "id": "223778625680",
      "title": "2025.02.27 : 농협중앙회 방문",
      "date": "2025. 2. 28. 21:39",
      "content": "데이터 기반 스마트농업 기술 확산 위한 농협경제지주 스마트팜 관계 부서 요청으로 농협 중앙회 방문!!!\n서울에서 15년정도 직장 생활을 했지만 서울오면 촌놈처럼 높은 빌딩 먼저 쳐다보게 된다.\n전국의 멋진 스마트팜 업체들이랑 명함도 주고 받고, 농협경제지주 산지보급팀 관계자분들의 든든한 지원격려도 받으니, 제주도 대표 스마트팜 업체로 성장해 가는 길이 외롭지는 않다.\n이제 봄이 다가온다. 농부들은 자연스럽게 몸과 마음을 가다 듬으면서 하늘이 부르는 따뜻한 기운을 맞이한다.\n농민처럼 행동하는 스마트팜 업체 대표라 나도 슬슬 농가 하나라도 더 챙기고 몸도 부지런히 움직이련다.",
      "content_length": 323
    },
    {
      "id": "223768094494",
      "title": "2025.02.20 : 맘꽃가든 실증농장 방문",
      "date": "2025. 2. 21. 7:37",
      "content": "추운 날씨에도 정신없이 한주가 흘러가고 있다.. 이번 한주 동안에 3개 기관에서 맘꽃가든 실증 농장을 방문해 주셨다..\n기관에서 오면 되도록이면 견학 체험을 진행할려고 하는데, 사무실 확장, 신규 개발자 채용, 제주남원농협 설치 준비까지 하려고 하니,,, 정말 시간내기가 힘들다.\n1) 2/17 (월요일) 동원과학기술대학, 한국폴리텍대학 신사업 스마트팜 분야 교수님 단체 방문 :\n- 교수님 중에 대학 선배님도 계시고, 스마트팜 업체가 이렇게 농업인과 협업하면서 기술 개발하는 건 처음 본다고 추후에 학생들이랑 재방문 하겠다고 하심..\n== 이 분들은 제어알고리즘이나 센서 데이터 취득에 관심이 많으심.. ^^;\n2) 2/19 (수요일) 해남농민회 단체 견학, 박제수 회장님을 비롯한 농업인들이 오셔서 여러가지 재배 기술에 대해서 물어보시고 가심.. 나중에 회장님만 혼자서 방문하겠다고 하심..\n== 이 분들은 작물이랑 입식재배기술에 대해서 관심이 많으심...\n3) 2/20 (목요일) 제일 중요하신 분들이 방문하셨다. 농촌진흥청 시설원예연구소 김기영 소장님, 이재한 연구실장님, 이희주연구관님, 방지웅 박사님 일행이 방문해서 차세대 온실 플랫폼 현장 실증 방안에 대해서 의견을 나눴다.. 제주농업기술원의 김현수 연구사도 참석해서 다양한 농업 현장의 스마트팜 기술 적용 방안에 대해서 토론을 했다..\n== 이분들은 스마트팜 분야의 국내 최고 전문가 분들이라 작물별 생육모델 기반의 재배 기술 적용 방안을 요청하셔서 실무진들은 맘이 무거웠다. ^^;\n그래도 이용안 김녕리 전이장님도 재배 전문가로서 도와주시고 계시고, 제주농업기술원도 현재 농업 기술 발전 방향을 같이 고민해 주고 계셔서 든든한 지원군들이 많이 있으니, 추운 날씨에도 꿋꿋하게 하루하루 최선을 다하고자 한다.",
      "content_length": 880
    },
    {
      "id": "223715221594",
      "title": "2025.01.04 : 구역별 평탄화 작업",
      "date": "2025. 1. 5. 13:24",
      "content": "새해 잘 보내고 다시 슬슬 2025년 농사 준비합니다. 이제 밭 갈면서 농사 준비하는 시대는 끝났습니다. 신규농장에 고설베드 설치하기 위해서 배수로 작업마치고 구역별 평탄화 작업 진행합니다.\n베드 길이는 18m에 높이는 65cm정도로 쪼그리지 않고 깻잎, 상추, 쑥갓 재배할 예정입니다.\n450평 기준으로 35,000주 정도 재배 가능한데, 오늘도 주말이니 스마트팜 설치 농가들 사후 관리차 방문하면 김녕, 서귀포 남원 이렇게 한바퀴 돌면서 보낼 것 같습니다.\n어수선한 시국에 법과 상식이 멀어지는 것 같아서 힘이 빠져도 해야할 일들이 많으니,,, 오늘도 제할일은 묵묵히 실천하겠습니다.\n구역별 평탄화 작업\n재생\n3\n좋아요\n0\n00:04\n\n구역별 평탄화 작업",
      "content_length": 368
    },
    {
      "id": "223733664553",
      "title": "2025.01.21 : 제품 전시/협업",
      "date": "2025. 1. 22. 5:58",
      "content": "2025년 1월부터 제주도 스마트팜 기술을 알리고 발전시키기 위해 점점 더 많은 분들을 만나게 되고 제품 전시 행사로 눈코 뜰새없이 하루 하루를 보내고 있습니다.\n제주남원농협, 제주ICT협동조합과 협업체계도 구축하고, 제주대LINC사업단 행사에 저희 제품도 소개하는 시간도 가지게 되었습니다.\n농협 현장에서 농민들이 직접 검증해 보고, 함께 개선해 가는 것이 스마트팜 보급의 가장 기본임을 항상 가슴에 새기면 나무가 자라듯이 자연스럽게 성장해 가겠습니다.",
      "content_length": 254
    },
    {
      "id": "223600944540",
      "title": "2024.09.28 : 청소년 노지 상추 재배 체험 구역 정비",
      "date": "2024. 9. 29. 21:03",
      "content": "10월에 유독 체험 및 견학 일정이 많이 생겨서 농장 입구 및 주차장 정비에 들어가다..\n청소년 노지 상추 재배 체험 구역도 만들어야 되고 쉴 수가 없네..\n그래도 농업일 하면서 가장 재미난 일이 미니 포크레인 작업이다. 하루가 그냥 간다.\n그래도 항상 상하차 시에는 긴장감 백배!!!!!\n오늘도 무사히 내려서 작업 완료다. 내일까지 작업해서 잘 반납해야 할 듯..\n노지 체험장 정비\n재생\n8\n좋아요\n0\n00:20\n\n노지 체험장 정비",
      "content_length": 242
    },
    {
      "id": "223596749614",
      "title": "2024.09.24 : 기후온난화 인한 고온 피해 확산",
      "date": "2024. 9. 26. 6:13",
      "content": "맘꽃가든 8월달 온도 데이터를 확인해 보니, 하루종일 25도 이하로 내려간 날이 하루도 없다. 역대 최장 70일 이상 열대야가 지속된 것이 데이터로 확인된다.\n일중 온도는 매일 35도에서 38도를 오가고 있었다.\n심지어 다른 감귤 농장 온도 센서를 확인해 보니 43도까지 올라간 기록도 남아있다..\n이런 고온에도 잘 버텨준 감귤들이 정말 대견해 보인다.\n그런데 기후온난화가 심화될수록 시설과수 농사를 10년 이상 지속 가능한 영농 계획으로 유지하는게 쉽지 않다.\n오늘 방문했던 농장주는 이미 추석전에 열과를 제거했는데 추가로 발생하지 않기를 바라고 계신다..\n이제 정말 가을이 와야한다. 낮기온이 좀 더 서늘해 지고 더 이상 태풍도 발생하지 않고 무사히 지나갈 수 있었으면 좋겠다.\n2진수로 단순하게 디지털화된 세상에 아직 자연은 자신을 좀 더 아껴주고 보살펴 달라고 하는 것 같다.\n편리하면서도 작물이 잘 자랄 수 있는 지속가능한 농업 기술은 어디에 있을지??",
      "content_length": 482
    },
    {
      "id": "223594450528",
      "title": "2024.09.23 : 농촌진흥청 축산과학원 관계자 스마트팜 특강",
      "date": "2024. 9. 24. 11:57",
      "content": "농촌진흥청 국립축산과학원 김창한 박사님의 요청으로 제주도 스마트팜 특강을 하는 기회를 가졌다.\n축산 분야에서 나에게 강의 요청이 들어와서 의아해 했는데, 상추키우는 나로서는 양돈도 중요한 사업 파트너이기에 편하게 현재 맘꽃가든이 가진 기술 및 개발현황에 대해 설명드릴 수 있었다.\n축산쪽도 축사관리 측면에서 센서와 구동기를 관리라는 동일한 시스템 구조를 가진 부분이 많아서 인지 즐겁게 얘기하고 의견을 나눌 수 있었다.\n특히 각 지역별 농업기술원 및 농업기술센터 담당자 분들도 계셔서 다양한 기술정보를 교류할 수 있었다..\n스마트팜 시작한 지 이제 4년차.. 농촌진흥청 전문가 분들 모시고 사례 발표할 기회도 생기고...\n내년에 또 이런 기회가 생긴다면 2세대 스마트팜 기능을 시연할 수 있도록 하고자 한다..\n오늘 하루도 알차게!!!!!",
      "content_length": 413
    },
    {
      "id": "223592936272",
      "title": "2024.09.20 : 순환팬 2채널 제어 박스 설치",
      "date": "2024. 9. 23. 9:01",
      "content": "작물재배 들어가면서 5개동에 순환팬 2채널 제어위한 제어함 설치.. 바닥에 공구깔아 놓고, 하드웨어 조립, 소프트웨어 업로드하면 끝!!!",
      "content_length": 76
    },
    {
      "id": "223581262793",
      "title": "2024.09.11 : ICT융합품질 인증 심사",
      "date": "2024. 9. 12. 8:33",
      "content": "이틀동안 ICT융합품질인증 시험 검사를 무사히 마쳤다.. 120페이지에 달하는 시험 항목을 시연하고 항목별로 동영상 촬영 및 결과 이미지 캡쳐등을 통해 해당 시스템 정상 작동여부를 확인하는 작업을 거쳤다.\n모든게 처음하는 일이라 일부 수정 보완 사항이 있었지만, 시험관이 시험 항목 개수 대비 순차적으로 잘 준비하신 것 같다고 평가해 줬다. 최종 결과 평가는 아직 남아 있다.\n매 순간 시험 불가 판정이 나올까봐 노심초사했는데, 이번 시험 준비를 잘 해준 강팀장이 너무 고맙다. 내가 인복이 많은 것 같다.. ^^;\n이제 테스트 항목별로 수정 보완 작업해서 자료 보내고 다시 검토 확정되면,,,, 9월 말 최종 심사 위원회에 자료 전달이 가능할 듯 하다.\n이렇게 또 슬라워 시스템은 업그레이드 된다..\n시험관이 시험 항목별로 페이지 한장씩 넘길 때 마다 긴장감이 몰려온다..\n이틀동안 진행된 시험 과정이 무탈하게 진행되었다. 국가 품질 인증이 어렵다는 걸 다시 배운다.\n잘 준비해준 직원들에게 너무 감사하다.. 이번 추석은 가벼운 맘으로 보낼 수 있을 것 같다.\nICT융합품질 심사\n재생\n8\n좋아요\n0\n00:11\n\nICT융합품질 심사",
      "content_length": 578
    },
    {
      "id": "223578721005",
      "title": "2024.09.10 : ICT융합품질 인증 테스트 준비",
      "date": "2024. 9. 10. 8:46",
      "content": "ICT융합품질인증 시험날이 밝았다... 시험을 앞두고 여러번 시운전 테스트 진행중!!!! 시험관이 직접 현장 시험하겠다고 한다. 다행히 장비들고 시험기관가서 재세팅해야 하는 불편은 없어졌다.\n오늘부터 이틀동안 긴장된 일정을 보낼 것 같다.. 맘꽃가든이 만든 장비가 공공기관 납품위한 성능 시험을 받는다니 기쁘다!!!\n노력한 만큼 좋은 결과가 나오기를...\nICT융합품질 테스트\n재생\n7\n좋아요\n0\n00:05\n\nICT융합품질 테스트",
      "content_length": 240
    },
    {
      "id": "223541873055",
      "title": "2024.08.08 : 🐔 스마트팜 친구",
      "date": "2024. 8. 9. 11:24",
      "content": "어느샌가 현장에 갈 때 마다 닭이 나를 반겨주는 친구가 되어간다. 농장 내 잡초 제거 및 병충해 방제를 위해서 닭을 키우는 농가가 많은데, 암닭이 주인인줄 알고 나에게 다가온다. 외롭지 않은 작업 현장이다.",
      "content_length": 115
    },
    {
      "id": "223539254640",
      "title": "2024.08.06 : 데이터기반 스마트농업확산사업 사용자 설명회",
      "date": "2024. 8. 7. 8:56",
      "content": "농림축산식품부 지원 사업으로 진행중인 데이터기반 스마트농업확산사업 농가 대상으로 스마트팜 시스템 설명회를 개최했다. 한남리 이장님을 비롯한 제주지역 30개 농가 관계자들이 바쁜 농사일정에도 참가해서 클라우드 기반 스마트팜 시스템 사용법 및 개선 사항등을 설명하는 시간을 가졌다.\n아침부터 시연용 장비 챙겨서 남원읍까지 가서 장비 시연 세팅을 하는데, 에어컨도 안켜지고, 인터넷도 안되어서 오늘 설명회가 잘 되려나 했는데 많은 분들의 도움으로 잘 마칠 수 있었다..\n날씨가 너무 더워서 찾아오시는 분들이 있으려나 했는데, 뒷자리까지 다 채워지고 설명회 도중에도 땀흘린 그대로의 모습으로 조심스럽게 찾아오시는 농장주도 계셨다..\n현재의 모습이 100% 완벽할 수 없어도 맘꽃가든의 기술 성장을 기다리는 농업인들이 있다는 것에 감사한다.\n제주농업의 변화와 미래를 위해 오늘도 하루하루를 잘 채워나가리라!!!",
      "content_length": 448
    },
    {
      "id": "223536257754",
      "title": "2024.08.04 : 농업의 변화를 시도하는 사람들",
      "date": "2024. 8. 4. 19:56",
      "content": "즐거운 전화 한 통화!!! 주말이 없는 서귀포 농가 방문 위해 중산간 넘어서 태흥리 방문 중에 전부터 알고 있던 시설하우스 설치 업체 사장님이 연락주셨다.. 내년 스마트팜 사업에 같이 협업했으면 하신다고!!!\n절실한 맘으로 개발해 온 나의 제품을 같이 하자고 연락주시는 시설하우스 관계자분들도 생기고 있다. 더운 날 서귀포 출장 가는 기분이 가벼워진다.\n서귀포 농가 방문해서 스마트팜 설정하고 데이터 분석 방안도 알려드리고.. 확실히 청년 농업인들은 변화를 두려워하지 않는다. 오히려 절실하게 농업이 변화될 수 있도록 도움줘서 감사하다고 한다..\n내 주변에 변화를 시도하는 사람들이 모이고 있다!!!",
      "content_length": 335
    },
    {
      "id": "223567091350",
      "title": "2024.08.29 : 차세대 스마트팜 플랫폼 워크샵 참가",
      "date": "2024. 8. 31. 8:23",
      "content": "농촌진흥청 시설원예연구소에서 추진하고 있는 차세대 스마트팜 플랫폼 아라온실 상용화 드림팀 워크샵에 참여했다. 농업인들에게 보급형 스마트팜 시범 설치 사업 등을 위한 다양한 정보를 받았고, ICT 기반의 진정한 스마트팜 기술이 표준화 되고 보급되지 않을까 ?? 기대해 본다. 해당 사업을 주관하는 방지웅 박사의 노력이 느껴진다.\n이제 \"슬라워\"가 KC마크를 인증을 받은 스마트팜이 될 수 있도록 하나씩 개선 작업을 추진하고자 한다....",
      "content_length": 243
    },
    {
      "id": "223565436754",
      "title": "2024.08.28 : 김제스마트팜혁신밸리, 아름농장 with 제주ICT협동조합",
      "date": "2024. 8. 29. 19:25",
      "content": "차세대 스마트팜 플랫폼 참여기업 대상 워크샵 참석차 대전에 출장 왔다가 김제스마트팜혁신밸리와 아름농장 견학을 다녀옴.. 6,000평 규모의 무빙거터방식의 상추 재배 농장주분과 나눈 진실한 대화는 나에게 많은 가르침을 주셨다. 남이 가지 않은 길을 가는 것은 정말 어려운 일이다. 주변에 이래라 저래라 말만 하는 사람도 많지만, 이렇게 묵묵히 실천해 가면서 자신의 노하우를 아낌없이 공유해 주시고 시련을 극복해 가는 분들이 있기에 하루하루 또 다시 최선을 다한다.",
      "content_length": 258
    },
    {
      "id": "223560786495",
      "title": "2024.08.36 : 차광막 개폐기 설치",
      "date": "2024. 8. 26. 8:10",
      "content": "초여름에 설치했어야 할 차광막 개폐기를 이제서야 설치하고 테스트 실시!!! 시설만감류 농가에 스마트 관수 설치한다고 7,8월 정말 열심히 다녔다. 그러다 보니 맘꽃가든 농장 운영이 많이 소홀해 졌다. 그렇다고 농장이 사라지는 것이 아니니, 또 다시 하나씩 세팅해 가면 될듯..\n그리고 무엇보다도 여름에 열심히 일해서 체중도 5kg 빠지고 이제 다시 몸과 마음을 잘 정비해서 수확의 계절.. 가을을 대비하자..\n차광막 개폐기\n재생\n29\n좋아요\n0\n00:26\n\n차광막 개폐기",
      "content_length": 263
    },
    {
      "id": "223552634066",
      "title": "2024.08.17 : 안정적인 관수 시스템 운영",
      "date": "2024. 8. 19. 8:32",
      "content": "관수 시스템 설치하면서 항상 맘이 쓰이는 곳이 양수기 펌프이다. 열악한 시설 하우스 환경에서 양수기 설치를 농민이 직접하거나, 주위의 기술자에게 부탁하는 경우가 많은데, 관련 배수 파이프를 설치하다보면 안정적인 관수 시스템 운영을 위한 설치가 되지 못하는 경우가 많다.\n이러한 환경에서 양수기 작동과 구역별 밸브가 원할하게 운영되는게 스마트 관수 시스템 핵심 역량이다.\n비싼 가압식 인버터 펌프 쓰면 좋겠지만, 5마력 이상의 고출력 제품은 아직 농민들이 쓰기에는 가격 부담이 너무 크다. 그래서\n기존 모터와 연결된 양수기 기반으로 잘 작동하게 만들려니 전기, 안전, 배수, 설치 위치 등... 변수가 너무 많다...\n오늘도 스마트팜 설치 농가에 와서 운영 현황을 확인하는데 잘 작동되는 소리를 들으니 기분이 좋다.\n양수기 펌프야 무사히 잘 작동되기를 바란다!!!!\n양수기 작동\n재생\n15\n좋아요\n0\n00:11\n\n양수기 작동",
      "content_length": 460
    },
    {
      "id": "223549492255",
      "title": "2024.08.14 : TEROS 토양센서 설치",
      "date": "2024. 8. 16. 8:10",
      "content": "이번에는 토양센서 설치로 땀범벅... 시험포장에 6개의 TEROS 센서 배선 작업 및 데이터 수집기를 설치하다.. 토양센서 기반으로 자동관수하기 위한 연구들이 꾸준하게 진행되고 있다. 이번에 설치한 제품은 외부 안테나형으로 기존보다 1.5배 정도 먼 거리에서도 WIFI 접속 및 데이터 수집이 가능한 제품으로 설치했다.\n그리고, 작업자들이 밟아도 문제가 없도록 CD관에 센서선을 삽입하고 부직포를 다시 덮어주었다.\n이번에도 토양 데이터가 잘 측정되기를 바래본다. 현장 전문 사장은 오늘도 백공이 된 것을 후회한다. ^^;",
      "content_length": 291
    },
    {
      "id": "223544949073",
      "title": "2024.08.10 : 센서 교체 작업",
      "date": "2024. 8. 12. 10:44",
      "content": "센서 데이터 수신 불량 시 카카오톡 점검 알람 발송 기능을 만들었는데, 주말에 센서 불량이 발생하니깐 회사 대표가 하우스 기둥에 매달려 센서 교체 작업을 진행했다. 더운 여름날 하우스 최상부 온도는 45도!!!!!\n40mm 파이프 위에 올라서서 4가닥 전선 연결 작업을 하고 나니깐 옷이 다 젖었다.. ㅎㅎ 그래도 고생했다는 농장주 말 한마디에 기분 좋게 떠난다.",
      "content_length": 203
    },
    {
      "id": "223533027679",
      "title": "2024.07.31 : 농업인 설치팀/스마트팜 개발자 기술 간담회 개최",
      "date": "2024. 8. 1. 15:34",
      "content": "제주ICT협동조합 설치팀과 맘꽃가든 스마트팜 개발자 간담회 실시...\n농민이 원하는 스마트팜을 만들기 위해 맘꽃가든 개발자가 직접 설치팀을 만나서 현장 설치의 어려움, 관수 제어, 데이터 모니터링의 개선 요구 사항을 청취하였다. 또한 소프트웨어 개발자로서 해당 서비스 제공의 어려움 및 알고리즘 구성의 난이도도 전달하였다.\n~~ 이 간담회가 얼마나 의미있는 자리가 될지는 기존 사용자의 만족도에 달려 있으리라..\n어느덧 올해 4월부터 진행했던 맘꽃가든 데이터 기반 스마트팜 설치 농가가 50호에 가까워 지고 있다. 폭염에도 비닐하우스 파이프에 매달려 전기, 통신, 관수 설비 작업을 진행해 준 제주ICT협동조합 설치팀에게 감사의 맘을 전한다.\n그리고 간담회 이후 다양한 요구사항을 어떻게 반영할 지 고민하는 맘꽃가든 개발팀을 응원한다.\n나는 이제 그들이 함께 제주도 스마트팜을 혁신적으로 바꿀 환경을 만들어 줘야된다... 폭염에도 포기는 없다!!!",
      "content_length": 474
    },
    {
      "id": "223531366764",
      "title": "2024.07.31 : KT CCTV 설치기사 만행(전원선 뽑기)",
      "date": "2024. 7. 31. 8:48",
      "content": "KT CCTV 설치 기사의 만행... 스마트팜 설치를 위해서는 인터넷 망 구성이 필수다. 오늘 오전에 신규로 설치한 농가에서 양수기 구동을 예약해 놓고 작업중인데, 종료가 되지 않고 점검 알람이 온다고 연락이 왔다. 그래서 전화상으로 수동으로 종료하는 법을 알려드렸다. 현장 작업 마치고 사무실 복귀하는 길에 해당 농가에 가보니 KT CCTV 설치 기사가 기존 와이파이 모뎀 전원선을 빼놓고 CCTV 어뎁터 전원선을 꽂아둔 것이다. 양수기 예약 작동 중에 전원선 바꾸고 작업 완료했다고 간 버린 것이다. 심지어 어뎁터는 외부에 노출시킨 채로....\nTV 설치 기사가 와서 기존 냉장고 전원선을 빼서 그 자리에 TV전원을 꼽고 물 떨어지는 밖에다 둔 것과 같다!!!!!\n최근에도 고온 시기에 하우스 개폐기가 고장나는 바람에 평생 키워 온 나무를 죽이는 사고가 발생했다. 전기 화재도 발생한 것 같은데, 이런 사고가 발생하면 농가는 전 재산을 날리게 된다.\n스마트팜 사용은 곧 전기와 통신을 함께 사용하는 것인데, 노후화된 시설하우스에서는 이런 문제가 발생할 가능성이 높기에 항상 전기, 통신 설치 및 안전에 대해서 농민들에게 말씀드리는데,,,\n어처구니 없게도 KT CCTV 설치 기사가 이렇게 무책임하게 기존 전원선을 뽑아버리고 자기 선을 꼽다니, 만에 하나 개폐기 제어에 연결된 채로 요즈음 날씨에 작동을 안했다면 어찌되었을지???\n생각만해도 아찔하다.. 다들 맘 편하게 사용할 수 있는 스마트팜은 갈길이 멀다..",
      "content_length": 735
    },
    {
      "id": "223530279835",
      "title": "2024.07.30 : 새벽 5시 관수 서비스 시작 알람",
      "date": "2024. 7. 30. 10:45",
      "content": "새벽5시에 울리는 반가운 카톡소리.. 슬라워 설치 농장이 늘어나면서 반가운 관수 서비스 시작 알람이 들리고 있다. 관수 주기 데이터 확보 및 운영 모니터링 때문에 시범사용 기간 동안 공동 관리자로 등록해 놓고 있는데 아침마다 이렇게 알람을 받으면서 스마트팜 기술이 이제 농민에게 도움이 될 수 있다는 확신이 생긴다. 특히 날씨가 더워지고 본격적인 비대기 관수가 시작되면서 해당 서비스 사용 횟수도 늘어나고 있어서 데이터 분석을 잘하면 감귤 재배 주기별 자동 관수 스케쥴 세팅 기술 구축이 가능할 듯!!!!",
      "content_length": 282
    },
    {
      "id": "223524816096",
      "title": "2024.07.24 : 현장 농업인 교육 및 요구사항 반영 과정",
      "date": "2024. 7. 25. 10:14",
      "content": "현장에서 직접 농업인을 만나고 개별 감귤 농장에 맞는 관수 시스템을 구축해 가는 과정이 이제 자리를 잡아가고 있다. 더운 날씨에도 자식같은 농산물을 생산하기 위해 노력하는 농민들을 만나서 관수 스케줄러를 어떻게 사용하고 재배력 데이터를 확인하는 방법을 전달하면서 시스템 개발자가 고객의 요구사항을 반영하는 과정이 얼마나 중요함을 느낀다.\n맘꽃가든 스마트팜은 이제 매년 새로운 버전 출시에 포함될 고객의 요구사항이 넘쳐난다!!!",
      "content_length": 238
    },
    {
      "id": "223498943493",
      "title": "2024년 6월 31일 : 맘꽃가든 후계자 육성 첫발 내딛다...",
      "date": "2024. 7. 2. 17:53",
      "content": "세대간 지속 가능한 농업 모델 구축을 목표로 밑바닥부터 다져온 스마트팜 기술 개발 과정을 최종적으로 완성하기 위해 후계자 육성이 진행되고 있다. 나의 길을 따라가겠다고 올초에 한국농수산대학교 원예시스템학과에 입학한 조카가 방학기간 동안 맘꽃가든에서 연수를 시작한다. 운전도 가르치고, 센서 설치하는 법, 전선 연결하는 법도 함께 얘기하고 있다. 딸바보 동생은 자기 딸이 형님의 길로 간다고 하니 맘이 더 애틋한 듯하다. 이제 맘꽃가든도 청년농업인 육성에 한걸음 더 나아가고 있다.\n후계자 운전 연수\n재생\n41\n좋아요\n0\n00:18\n\n후계자 운전 연수",
      "content_length": 307
    },
    {
      "id": "223517442343",
      "title": "2024.07.17 : ICT융합품질 인증 시험 장비 구축",
      "date": "2024. 7. 18. 20:17",
      "content": "제품 신뢰성 확보 및 조달청 우수제품 지정 신청 위해서 ICT 융합품질 인증 시험용 장비를 구축하다. 오전에 장비 세팅이랑 자료 준비하고, 오후에는 농가 방문해서 프로그램 설치 및 업그레이드 하면서 하루를 보낸다. 이제 국가에서 품질 인증 받은 제품으로 한발자국 또 전진한다.",
      "content_length": 154
    },
    {
      "id": "223511976073",
      "title": "2024.07.11 : 상반기 관수 시설 개선 및 스마트팜 설치",
      "date": "2024. 7. 14. 9:11",
      "content": "7월 장마가 시작되어도 관수 시설 개선 및 스마트팜 설치는 계속 되고 있다. 어려운 조건에도 최선을 다하는 설치팀에 감사를 드린다. 오늘 하루 바람 불고 비오는 날씨에 조용히 2024년 상반기를 되돌아 본다..",
      "content_length": 117
    },
    {
      "id": "223469504598",
      "title": "2024.06.04 : 본격적인 청년 농업인 스마트팜 설치 작업",
      "date": "2024. 6. 5. 7:37",
      "content": "청년 농업인으로 이루어진 제주 ICT 협동조합 스마트팜 설치팀... 농가들 환경이 달라서 설치하는 과정에서 많은 좌충우돌이 생기겠지만 우리는 즐기면서 한걸음씩 성장해 갈 것이다. 그들도 나도 평생 농업인으로 있어야 하니깐!!!",
      "content_length": 126
    },
    {
      "id": "223468360915",
      "title": "2024.06.02 : 국립산림과학원 관계자/인도네시아 국립 스리위자야 농과 대학 교수님 방문",
      "date": "2024. 6. 4. 8:59",
      "content": "국립산림과학원 연구자 및 인도네시아 국립 스리위자야 농과대학 교수님들이 맘꽃가든 재배 시설 방문을 해주셨다. 슬라워 시스템 시연 및 입식 베드 시스템을 영어로 설명하는 즐거운 시간이었다. 이제 일도 즐겁고 사람 만나는 것도 즐겁다. 내가 꿈꾸는 세상은 쉽게 오지 않아도 나는 Keeeeep Gooooing!!!",
      "content_length": 173
    },
    {
      "id": "223495019196",
      "title": "2024년 6월 28일 : 스마트팜 현장 설치 전용 앱 개발 완료",
      "date": "2024. 6. 29. 6:30",
      "content": "개별 농가마다 다른 설치 환경 때문에 스마트팜 제품 설정하는데 어려움이 많았는데, 이번에 현장 설치 요원 또는 농민이 바로 현장에서 수정 / 업데이트 할 수 있는 모바일 앱을 개발 완료하였다.\n현장에서 바로 WIFI 연결 설정 및 장치 연결 내용을 업데이트할 수 있다. 이제 점점 더 현장에 맞는 스마트팜 시스템으로 거듭나고 있다.",
      "content_length": 185
    },
    {
      "id": "223486844807",
      "title": "2024.06.21 : 농정원 스마트농업기획실 청수리 설치 현장 방문",
      "date": "2024. 6. 21. 15:44",
      "content": "한경면 청수리 꼬맹이농장 사모님, 대정면 신도리 하우스 설치 사장님이랑 감귤 재배 위한 데이터 기반 스마트 농업 기술 개발 방향에 대해서 현장 토론을 진행하다. 그리고 이어진 농정원 스마트농업기획실 관계자들과 현장 견학 및 토론이 이어졌다.. 특히 토양센서 설치에 대해서 다양한 질문과 답변이 이었다. 이렇게 현장에서 만나는 사람이 많아질수록 제주 스마트팜이 성숙되어지지 않을까???",
      "content_length": 214
    },
    {
      "id": "223478507594",
      "title": "2024. 06. 12 : 제주농업기술원 시험 포장 토양수분장력 센서 재설치",
      "date": "2024. 6. 13. 19:26",
      "content": "제주농업기술원 시험포장에 설치된 토양수분장력 센서 측정값이 불안정해서 센서를 재설치하다. 기존 20cm 내외 깊이로 심었는데, 토양의 수분 흡수율이 높은지 계속 과습 상태에 있어서, 재설치하였다.\n작은 자갈을 걸러내기 위한 채망을 사용해서 흙을 걸러내는 작업을 진행하다.\nTEROS21 토양수분장력센서 설치\n재생\n17\n좋아요\n0\n00:43\n\n접기/펴기\nTEROS 21 토양수분장력센서 설치",
      "content_length": 217
    },
    {
      "id": "223474420531",
      "title": "2024.06.09 : 관수 제어 시스템 및 환경 센서 현장 설치",
      "date": "2024. 6. 10. 10:44",
      "content": "현장에서 답을 찾아야 한다.. 노트북 들고 설치 농가 가서 데이터 확인하고 농민에게 작동 방법 설명하는 과정을 끊임없이 반복하고 있다. 제주도 농업 현실에 맞는 스마트팜을 만들고자 하는 믿음에 흔들림 없이 쭉~~~~~~~~",
      "content_length": 124
    },
    {
      "id": "223461556658",
      "title": "2024.05.24 : 농림축산식품부, 한국농업기술진흥원, 한국농기계협동조합 관계자 현장 방문",
      "date": "2024. 5. 28. 21:22",
      "content": "스마트팜 관련 3개 공공 기관 \"농림축산식품부, 한국농업기술진흥원, 한국농기계협동조합\" 관계자 분들이 맘꽃가든에서 관수시설 설치한 서귀포 한남리 천혜향 농가 현장 방문을 하였다. 오길원 ICT 협동조합장도 참석해서 만감류 생육 모델 개발 필요성을 함께 공유하는 자리를 가졌다. 대한민국 기후변화 최전선 제주도에서 하루하루 변화되는 농업 환경을 어떻게 하면 모두에게 이로울 수 있는 시스템으로 구축하는 방안을 찾아낼수 있을까???",
      "content_length": 239
    },
    {
      "id": "223459000101",
      "title": "2024.05.25 : 양수기 원격 제어 안전 경고판 제작",
      "date": "2024. 5. 26. 18:15",
      "content": "농업 현장에서 양수기를 원격제어 하면서 안전 사고 발생 위험이 있어서 이에 대한 안전경고판 제작!! 전기 시설이 많아지면서 전기 구동기 사고 등이 발생할 수 있는데 안전한 농업 현장이 되기 위해 항상 주의를 구한다.\n교반기 작동\n재생\n13\n좋아요\n0\n00:09\n\n교반기 작동",
      "content_length": 153
    },
    {
      "id": "223454493828",
      "title": "2024.05.21 : 관수 시설 재정비",
      "date": "2024. 5. 22. 9:51",
      "content": "기존 관수 수동 밸브에 전자밸브, 유량계를 설치하기 위해서 맞춤형 관수 라인 제작.... 공간이 좁아서 기존 부품 다 풀어서 일일이 맞춤 제작으로 조립 진행 중.. 역쉬 경험 많은 농업인 설치팀이 제작해야 제대로 된 스마트팜이 나온다.",
      "content_length": 131
    },
    {
      "id": "223451199536",
      "title": "2024.05.19 : 50개 농가 스마트팜 세트 제작",
      "date": "2024. 5. 19. 8:36",
      "content": "이제 구동기 제어함, 환경측정 센서함 50세트를 제작해서 농가에 설치해야 한다. 제작과정도 규격화 되어가고 있고, 본격적인 스마트팜 제조업체로 전환해야 할듯... 주말도 없다..",
      "content_length": 99
    },
    {
      "id": "223408910438",
      "title": "2024.04.08 : 슬라워 2.0 스마트팜 농장 설치",
      "date": "2024. 4. 8. 8:21",
      "content": "제주시 봉개동에 위치한 농장에서 슬라워 2.0 기반의 스마트팜 및 CCTV 설치 주문을 받아서 제주ICT 협동조합 조합원들과 함께 스마트팜을 설치하였다. 해당 농장은 4,000평 규모의 노지 농장이라 관수 위주의 서비스를 제공할 예정인데, CCTV를 노지 중간에 설치해서 모니터링 하기를 원하셔서 별도의 IP주 설치 작업을 진행하였다.\n제주도에서는 바람이 많이 불어서 IP를 그냥 세울수가 없다. 하부에 별도의 구조물을 만들고 Wire를 이용해서 단단히 고정하는 작업을 진행해야 하기 때문에 설치 과정이 대단히 복잡하다.\n이러한 작업끝에 CCTV 설치를 완료하였다. 상당히 먼거리에 UTP 케이블을 설치하는 작업도 진행하였는데, 외부에 케이블 노출시 문제가 될 수 있기에 보호관에 UTP 케이블을 끼우는 작업도 진행했다.\n메인 밸브 기준으로 관수관 4개 채널로 나눠서 제어하고자 한곳에 모으는 배관 작업도 실시하였다. 다들 경험많은 베테랑이라 설치에 큰 어려움은 없었다.\n기존의 메인 전원함에서 별도의 제어함을 분리하고 새로운 제어함을 꾸미는 작업을 실시하였다.\n추가 배선 작업 및 스위치 작업들을 진행할 예정이다. 이틀 정도에 끝내려고 했는데, 현장 상황은 항상 변수가 있고 세세한 부분까지 다시 설정해야 하기에 작업 상의 과정은 좀 더 지연될 것 같다. 그래도 하나씩 마무리되어 가는 과정이 중요할 것이다.",
      "content_length": 677
    },
    {
      "id": "223428059250",
      "title": "2024.04.26 : 1농가 + 1농가 설치 작업 진행 중",
      "date": "2024. 4. 26. 15:40",
      "content": "2024년부터 스마트팜 설치 농가가 늘어나면서 1농가 + 1농가, 이렇게 설치 농가가 늘어가고 있다. 이번에 설치할 스마트팜 자재를 일괄로 차에 실어서 가려고 사무실 카트에 다 실어놓았다.\n결국 현장에 도착해서는 센서함이랑 제어함,, 케이블 들이 어지롭게 놓여져 있다. 시설하우스 규모가 크다보니깐, CCTV 카메라 설치 범위가 상당히 멀어지게 된다. 옥외용 PoE케이블 설치가 가장 힘든일이 되고 있다.\n기존 배수 라인에 유량계와 전자밸브를 설치하였다. 베테랑 농업인들이 설치하는 것이라 기존 관수라인에 최소한의 변경으로 설치가 진행되는 것 같다.\n제주ICT협동조합 조합원들이 직접 제어함과 센서함을 설치하고 있다. 이러한 과정을 통해 농업인들이 직접 설치 운영할 수 있는 스마트팜 시스템 개발이 점점 더 현실화 될 것 이다.",
      "content_length": 407
    },
    {
      "id": "223377838232",
      "title": "2024.03.08 : 제주농업기술원 스마트팜 2차 시연회",
      "date": "2024. 3. 9. 8:20",
      "content": "봄 기운이 완연하게 다가오면서 본격적인 스마트팜 시스템 운영을 준비하고 있다. 작년에 제주농업기술원과 공동 개발했던 스마트팜 시스템의 본격적인 운영을 위해서 제주농업기술원 관계자 분을 모시고 2차 시연회를 실시했다. 이번에 개발한 시스템은 2020년 부터 기술 개발을 했던 연구사분들의 의견과 연구 노하우를 최대한 반영한 시스템이라 문제점 지적보다는 기대감이 높았던 시연회였다.\n다중 사용자, 다중 농장, 다중 센서, 다중 구동기 관리가 원할하게 이루어지고, 동시계열 데이터 모니터링, 사용자 알람 등의 모니터링 기능을 대폭 강화하였다.\n특히 시설 과수에 적합한 다중 스케쥴링 기능을 개발 적용하였기에 농업기술원 시험포장을 대상으로 본격적인 관수 서비스가 운영될 수 있을 것 같다.\n작물에 최적화된 스마트팜 시스템을 개발하는 것은 쉽지 않은 길이다. 여기에 계신 모든 분들이 대한민국 스마트팜의 현실과 나아가야 할 방향, 기대치를 이제 공감하고 있다. 그렇기에 이제 기획하고 연구하고, 개발하고 다시 연구하는 작업을 계속하고자 한다. 3년 간의 연구, 개발하면서 나름 한발자국 또 나아간 것 같다.\n많은 분들의 도움과 노력이 있었음을 느끼며, 감사드리고자 한다.",
      "content_length": 594
    },
    {
      "id": "223374060702",
      "title": "2024.03.05 : 경기농협 조합장 단체 방문",
      "date": "2024. 3. 5. 18:21",
      "content": "농협중앙회 제주지부의 소개로 경기농협 조합장분들이 맘꽃가든을 방문해 주셨다. 계속되는 폭우에 시설하우스 내부에서 대화하기도 쉽지 않았는데, 다들 열정이 대단하셔서 많은 얘기를 나눌 수 있었다.\n1시간 이상의 스마트팜 보급 확산 방안을 토론하면서, 대한민국 미래 농업의 성공 요인은 \"승계농\" 이라는 공감대를 형성한 것이 인상깊었다. ^^;\n그만큼 현재 농업에 진입하기 위해서는 초기 투자 비용이 많이 들어가는 것을 반증하는 것이다. 조합장님들도 청년 농업인 육성에 대한 고민이 많다고 하신다. 이를 해결하기 위한 방안으로 스마트팜이 잘 적용되어야 하는데, 아직 부족한 부분이 많다.\n최근에 개발한 슬라워 2.0 모델을 시연해 보는 시간을 가졌다.\n계속된 토양 수분 장력 센서 테스트 과정들에 대해서 설명해 드렸다.\n이번에 방문을 연계해 주신 농협중앙회 제주시 지부 김태범 단장님과 조합장님 기념사진을 찍었다.",
      "content_length": 452
    },
    {
      "id": "223396594625",
      "title": "2024.03.26 : 제주 시설 만감류 농가 실증 설치",
      "date": "2024. 3. 27. 8:00",
      "content": "제주 시설 만감류 농가를 대상으로 한 스마트팜 설치 작업이 본격적으로 진행될 예정이다. 농업인 단체에서 개별 농가의 재배 현장을 파악하고 분석한 뒤 이를 기반으로 농가에 맞는 스마트팜 설치 Layout 및 사양을 결정하고 설치 작업을 진행하는 프로세스를 구축하고자 한다.\n이를 위해서 제주ICT협동조합 조합원들과 맘꽃가든 직원들이 모여서 실증 설치를 위한 사전미팅을 가졌고 이에 본격적인 작업을 진행하기로 하였다.\n남원읍 한남리에 위치한 농가에 모여서 우리가 진행하고자 하는 방향에 대해서 서로 의견을 나누고 본격적인 실증 작업을 위해서 스마트팜 시스템에 사용자, 농장, 작물, 구동기, 센서 등록 작업을 직접 수행보는 과정을 거쳤다.\n또한 개별 농가 설치 시, WIFI 설정 등록, 구동기, 센서 정보와 장비 Serial 번호를 맞추는 방법 등에 대해서 의견을 나누는 시간을 가졌다.\n이러한 실증 작업을 통해서 개별 농가에 맞는 스마트팜 시스템을 최적화 설치하고 농가는 편하게 스마트팜 장비를 사용할 수 있는 토대가 마련되지 않을까 한다.",
      "content_length": 526
    },
    {
      "id": "223394218317",
      "title": "2024.03.24 : 제주농업기술원 제주 토양 분석 작업 실시",
      "date": "2024. 3. 25. 8:16",
      "content": "시설 만감류 관수 알고리즘 개선을 위해서 제주농업기술원에서는 다양한 토양 환경에서의 관수 관리 방안을 연구 중이다. 토양 센서 중에 수분장력센서가 가장 신뢰성이 높은데, 이는 Meter Group에서 개발하는 TEROS 21, TEROS32가 가장 신뢰성이 높다. 하지만 가격이 높아서 농가 보급용으로 적용하기에는 어려움이 있다.\n이번에 제주농업기술원 시험포장에 12개 지점을 선정하여 각각의 토양 상태 및 관수 스케쥴을 조정해서 작물의 성장을 비교 분석하는 연구를 진행하기로 하였다.\n이를 위해서 맘꽃가든에서 개발한 데이터 수집기와 제빛나 시스템을 연동하는 작업을 수행했다.\n토양의 깊이는 약 20cm 내외 깊이로 파서 센서를 심어 두었다. 물론 젖은 흙으로 센서를 감아서 설치해야 한다고 했는데, 이전 테스트에서 그렇게 했는데, 결과값에 차이가 거의 없었다.\n토양 수분 장력은 주변 토양의 수분 상태가 안착될 때까지 측정값을 잘 모니터링해야 하는 것 같다.\n이렇게 12개 지점에 센서를 배치하고 각각의 물빠짐이나 토양 수분 장력 변화를 모니터링 할 예정이다.\n그리고 별도로 12개 농가를 대상으로 토양 수분 함량 변화를 확인하기 위해서 데이터 수집 장치를 설치하기로 하였다. 이 또한 잘 설치해서 데이터를 수집하고 비교 분석해 보고자 한다. 개별 농가에 데이터 수집 장치를 설치하는 과정도 쉽지 않지만 제주도 농업 기술 향상을 위해서 또 열심히 하루하루 최선을 다하고자 한다.",
      "content_length": 716
    },
    {
      "id": "223392079935",
      "title": "2024.03.21 : 시설만감류 40개 농가 슬라워 2.0 관수 서비스 설명회",
      "date": "2024. 3. 22. 17:41",
      "content": "작년부터 함께 협업해 왔던 제주ICT협동조합과 컨소시엄을 구성해서 농진원에서 진행하는 데이터 기반 스마트 농업 확산지원 사업에 선정되었다. 그래서 본격적인 시스템 설치 및 보급 사업 추진을 위해서 기존에 모집했던 농가들이 농사철이 다가오기 전에 빨리 설명회를 개최했으면 하는 요청들이 있어서 시설 만감류 관수 서비스 및 데이터 취득 내용들을 오길원 조합장이 직접 설명하고 있다.\n무엇보다도 스마트팜 기술을 개발하는 업체와 농업인 단체가 서로 필요한 것을 함께 고민하고 이를 직접 조합원들이 테스트할 수 있는 구조를 만들었다는 것에 뿌듯함을 느낀다.\n매번 여러가지 바쁜 일정에도 농민을 독려하고 조합원들에게 농업기술 개선 방법을 전달하고자 노력하는 오길원 조합장의 열정에 파트너로서 든든함을 느낀다.\n남원읍 다목적 센터에서 청장년 농업인이 참여해서 시설 만감류 스마트팜 시스템의 문제점과 개선 방안을 협의할 수 있음에 감사함을 느낀다.\n제주도 스마트팜의 미래가 점점 더 밝아보인다.\n이번에 설치 지원될 기자재도 전시를 해서 설명을 드렸고, 4월부터 본격적인 설치 작업을 진행하고자 한다.",
      "content_length": 551
    },
    {
      "id": "223384512552",
      "title": "2024.03.15 : 슬라워 2.0 업데이트 작업",
      "date": "2024. 3. 15. 17:18",
      "content": "슬라워 2.0 서비스를 시작하게 되었다. 그래서 기존에 현장에 설치했던 하드웨어 시스템 구성을 슬라워 1.0에서 슬라워 2.0으로 이전하는 작업을 시행하고 있다. 물론 테슬라처럼 OTA 기능을 통해서 자동으로 업데이트 되면 좋겠지만 그렇지 못해서 이렇게 농가를 방문해야 하는 문제점이 있지만 올해안에 사용자가 직접 업데이트할 수 있는 기능을 추가 개발할 예정이다.\n그래서 이런 수고는 성장하기 위한 필수 과정으로 받아드리고자 한다.\n이번에 현장 업데이트 작업은 현장 직원과 함께 하기로 해서 사무실에서 개발만 하던 박대리가 현장에 나와서 설치 현황도 확인하고, 설치 프로그램을 업데이트 작업을 수행하고 있다.\n그리고 새로운 슬라워 2.0 시스템에서는 다중 농장, 다중 사용자 등록이 가능해서 콩깍지 농원의 후계자가 직접 노트북에서 사용자, 농장, 구동기, 센서 등록 작업을 수행하고 있다.\n농업인이 시스템에서 직접 사용자, 농장, 구동기, 센서를 등록하고 운영할 수 있는 시스템을 지향한다. 슬라워 1.0에서 슬라워 2.0 버전을 진화했다.. 다시 농민이 편하게 농사 짓는 그날을 위해서 끊임없이 진화하고자 한다.",
      "content_length": 567
    },
    {
      "id": "223379485980",
      "title": "2024.03.11 : 키위 농가 MicroSD 카드 저장 로거 설치",
      "date": "2024. 3. 11. 8:35",
      "content": "빅데이터 수집하는 농가 중에서 인터넷이 되지 않는 농가가 있어서 MicroSD카드에 저장만 가능한 데이터 로거를 설치하였다. 작년에 제주농업기술원 요청에 따라서 클라우드 서버로 데이터 전송도 되면서 MicroSD 카드에 측정값을 저장하는 모듈을 개발하였다. 이를 테스트 하기 위해서 키위 농가에 토양수분장력센서(TEROS32), 온습도계(SHT35), 일사량계(SP-110)를 설치하고 이를 맘꽃가든에서 개발한 데이터 로거에 연결하는 작업을 실시하였다.\n데이터 저장은 10분에 한번씩 저장하고 저장 파일은 한달에 한번씩 생성되며, 값이 저장된다. 과거에 데이터 저장 장치 용량이 작아서 주기적으로 방문해서 데이터를 백업 받아야 하는데, 요즈음 워낙 데이터 저장 용량이 커서 32GB 기준으로 10개 센서 데이터를 10분씩 저장할 경우에 약 50년 이상의 데이터를 저장할 수 있는 것으로 예측되었다.\n농장주 분이 워낙 깔끔하신 분이라, 포장 관리가 잘 되어 있었다. 토양 수분 장력 센서는 TEROS32를 설치했는데, 아무래도 계속 증류수를 주입해야 하는 불편함이 있어서 추후에 TEROS21도 같이 설치해야 될 것 같다.\n각 센서의 설치 위치를 표현하였다. 이렇게 수집된 데이터를 키위 생육 연구에 잘 활용해야 되는데, 스마트팜 연구의 길은 Keep Going!!!!!!",
      "content_length": 655
    },
    {
      "id": "223345597533",
      "title": "2024.02.03 : ICT 시범 포장 관수 밸브 우회로 구성",
      "date": "2024. 2. 6. 10:17",
      "content": "제주농업기술원 ICT 시범 3개 포장에 벨콘 전동식 밸브가 설치되어 있는데, 기존 벨콘 밸브 제어 문제 발생시 우회 관수 밸브 구성을 위해서 기존 관수 라인에 우회로 구성을 하였다. 관수 밸브 설치 시에 당장 작동하게 만드는 것이 제일 중요하다보니, 유지/보수를 고려하지 않아 추가 작업할 때 관수 여유 공간이 없어서 힘든 경우가 많다. 이번에는 아무리 설계해도 PE관으로 우회로를 구성할 수 없어서 수도 부속을 맞춤형으로 다 제작해서 조립을 하였다.\n해당 길이에 맞는 파이프를 절단한 다음에 나사선을 다 가공하고 이를 소켓들과 조립해서 우회로 개념의 버마드 전자 밸브를 추가 설치하였다. 이러한 작업은 사실은 일반 농민이 하기 힘들다. 하지만 본인 농장에서 이런 상황이 된다면 무조건 해야 될것 이다. 그러다 보면 결국 농민은 백공이 된다. ^^; 이번 작업을 마치면서 관수 라인 구성을 체계적으로 잘 해 두는 것이 얼마나 중요한 가를 또 깨닫게 된다.\n아래는 옆으로 공간이 없어서 위로 우회라인 구축한 사례이다. 좁은 공간에 테스트를 위해서 다양한 관수 라인을 설치하다보면 정말 쉽지 않은 경우가 많다. 그래도 이런 경험을 통해서 좀 더 발전된 스마트팜 시스템을 만들 수 있을 것 같다.",
      "content_length": 610
    },
    {
      "id": "223361443536",
      "title": "2024.02.21 : 토양 센서 테스트용 베드 제작 (TEROS, FDR 동시)",
      "date": "2024. 2. 22. 9:01",
      "content": "제주 지역 특성상 토양 종류 및 시설하우스 지층 구조도 달라서 물빠짐이 상이한 경우가 허다하다. 그럼에도 불구하고 시설 만감류 재배 기술의 가장 중요한 것이 관수이기에 토양 센서 테스트 및 신뢰성 확보 요구가 점점 더 많아지고 있다. 그래서 TEROS 시리즈랑 FDR 센서 등을 동시에 데이터 취득하고 바로 조회할 수 있는 기능을 개발하고 있다.\n그런데 센서 개수도 많아지고 개별적으로 상토에 담아서 관리하기가 쉽지 않아서 6개 토양 센서를 한번에 담아서 테스트할 수 있는 베드를 자체 제작했다. 기존 기자재를 최대한 활용해서 쉽게 선 연결하고 물넣고 빼고 할 수 있는 구조를 뚝딱 만들었다.\n사무실에서 보유하고 있던 TEROS 32, TEROS 21, FDR 센서 등을 꽂아보니 나름 공간도 적게 차지하고 작업도 쉽게 이루어 질 수 있을 것 같다.\n센서 중에 일부 데이터만 바로 조회해 보니깐 토양 수분 함량이 그래프로 잘 나오고 있다. 스마트팜 기술 개발에 있어서 가장 까다롭다는 토양 관련된 연구를 이제 시작하고 있다. 올해 좋은 소식이 나올 수 있을지????",
      "content_length": 540
    },
    {
      "id": "223358474220",
      "title": "2024.02.18 : 제주시 농협 상추 생산자 출하협의회 정기 총회 참석",
      "date": "2024. 2. 19. 16:37",
      "content": "작년에 가입한 제주시 농협 상추 생산자 출하협의회 정기총회에 참석하였다. 제주시 지역에 총 28 상추 농가가 가입되어 있는데, 나는 신입회원으로서 참석하고 여러 선배님들한테 인사를 드리는 시간을 가졌다.\n총회를 시작하기 전에 미리 도착하신 분들은 총회 자료를 보시는데, 다들 상추 농사 경험이 10년 이상 이신 베테랑 분들이라 조용히 자리에 앉아서 선배님들이 진행하시는 것을 지켜보는 시간을 가졌다.\n신입 회원 농가가 3농가였고, 회원 분들중에서 50대는 나밖에 없었다. 여기에서는 나는 아직 10년 정도는 막내역할을 해야 한다. ^^; 선배님들한테 많이 배워서 제주도 농업 발전에 도움이 될 수 있도록 노력해야 할듯하다..",
      "content_length": 349
    },
    {
      "id": "223354692260",
      "title": "2024.02.15 : 슬라워 현장 설치 지원용 앱 개발",
      "date": "2024. 2. 15. 18:06",
      "content": "2024년 3월 초 슬라워 2.0을 운영하기 위한 작업을 진행하고 있다. 특히 현장에서 설치자 또는 농민이 하드웨어 대한 직접적인 연결 및 프로그램 관리 작업을 최소화 하기위한 현장 설치 지원용 앱을 개발하고 있다. 하드웨어를 구매해서 농장에 설치할 때 해당 농장의 WIFI SSID 및 비밀번호를 확인하고 이를 시스템에 입력해 줘야 한다. 또한 해당 농장에 필요한 구동기, 센서 설정을 해야한다. 이러한 설정을 모바일 앱을 통해서 바로 설정하고 펌웨어에 업데이트 할 수 있는 프로그램을 개발하고 있다.\n프로그램 개발 작업을 하면서 크게 WIFI 설정과 구동기, 센서 설치 개수 및 TYPE 등을 지정할 수 있도록 할 예정이다.\n설정된 정보를 바탕으로 슬라워 서버와 접속할 수 있도록 하는 작업이 이루어 질 것 같다.",
      "content_length": 401
    },
    {
      "id": "223684310567",
      "title": "2024.12.05 : 24년 마지막 스마트팜 농가 설치",
      "date": "2024. 12. 6. 9:26",
      "content": "지난 달에 갑자기 주문 전화가 와서 마지막 스마트팜 설치 작업 시작하다.\n올 한해도 열심히 다니고 서비스 개발하고 설치 작업을 진행했다.\n사고없이 무탈하게 설치 작업이 진행되었지만, 부족하고 아쉬운 부분이 많이 있다.\n하지만 꼭 제주도에서 개발한 기술과 서비스를 전국 단위로 수출하는 최초의 스마트팜 업체가 되기 위한 나의 목표 달성 위해 최선을 다하고자 한다.\n이번 농가는 관수 밸브가 21개다... 양수기 포함해서 22개 채널 제어를 진행할 예정이다.\n날씨가 따뜻해서 다행이다.",
      "content_length": 269
    },
    {
      "id": "223704843336",
      "title": "2024. 12.21: 제주지방조달청장 관계자 방문",
      "date": "2024. 12. 25. 10:45",
      "content": "맘꽃가든 슬라워 제품이 조달청 혁신제품으로 인증받고 시범사용 성공 판정이후에 현장의 목소리도 들으시고 및 내년 우수제품 인증 절차도 알려주시고자 방혜성 제주지방조달청장님과 관계자분들이 맘꽃가든 사무실을 방문해 주셨다.\n스타트업 기업으로 공공 기관의 지원과 관심은 기업 생명을 이어가는데 필수 영양소이다.\n제주도에서 \"저비용 스마트팜\"이라는 무에서 유를 창조하는 과정은 너무 어렵고 힘들다. 가격도 싸야하고 품질도 좋고, 농민도 안전하게 쓸 수 있는 스마트팜... 제주도에서 꼭 성공시키고자 한다. 다행히 농민도 살고 기업도 살 수 있는 제품을 만들고자 하는 가치를 인정해 주시는 분들이 많아지고 있으니, 힘이난다. 스마트팜 제품을 혁신하리라!!!!",
      "content_length": 362
    },
    {
      "id": "223700912564",
      "title": "2024.12.20 : 2024 제주 웹 컨퍼런스 강의",
      "date": "2024. 12. 21. 8:44",
      "content": "올해 마지막을 2024년 제주 웹 컨퍼런스 강연으로 마무리하다. 위니브 이호준 대표님이 좋은 기회를 주셔서 내년 개발자 채용 위한 회사 소개도 할겸,, 맘꽃가든 스마트팜 기술 개발 현황을 홍보할겸해서 행사에 참여했다..\n1시간에 걸친 맘꽃가든 스마트팜 구축 및 솔루션 개발 과정을 소개했는데, 스마트팜은 SW/HW 융복합 제품이라는 특징과 농업 기후 변화 따른 비지니스 기회가 점점 더 커진다고 설명드렸다...\n열정적인 강의에 감사하고, 연수끝나면 방문하겠다는 말에... 항상 기회는 만들어 가는 것임을 배운다..\n젊은 청년들과 소통에 부족함을 많이 느끼는 세대이지만 이러한 소통의 과정이 좀 더 많은 청년들이 농업에 참여하는 기회를 만들지 않을까???",
      "content_length": 365
    },
    {
      "id": "223679423608",
      "title": "2024.11.29 : 농협 관계자 시설만감류 스마트팜 농가 방문",
      "date": "2024. 12. 2. 6:53",
      "content": "맘꽃가든과 제주ICT협동조합이 2024년 동안 함께 설치한 제주 시설 만감류 관수 스마트팜 시스템에 대한 운영 현황 및 결과를 농협관계자 분들이 현장 방문해서 확인했다.\n이제 육지에서 다양한 분들이 제주도 스마트팜 운영 현황에 대한 관심을 가져 주셔서 뿌듯하다.\n농업인이 원하는 스마트팜은 기후변화가 가속화 되는 시점에 끊임없이 알고리즘을 업데이트 하지 않으면 안된다..\n성과위주 결과를 바라는 것은 초격차 다투는 스마트 팩토리에 적용될지 모르나, 스마트팜은 지속가능성이 더 우선이다. 이런 관념을 이제 스마트팜 관계자들이 많이 공감하는 것이 느껴진다..\n그래서 스마트팜은 연구소와 농업현장의 긴밀한 협업이 더 중요하다. 그들이 함께 문제 정의하고 알고리즘 개선이 진행되어야 할 것이다.\n우리는 이제 기후변화에 대응해야 한다.",
      "content_length": 406
    },
    {
      "id": "223697370047",
      "title": "2024.12.17 : 제주남원농협 청장년 농업인 협업 설명회",
      "date": "2024. 12. 18. 9:38",
      "content": "제주 남원 농협 / 제주ICT협동조합 / 맘꽃가든 3개 기관이 한국농업기술진흥원에서 추진하는 데이터기반 스마트농업 확산지원 사업으로 남원 농협 청장년 농업인에게 스마트팜을 보급하는 사업에 공동으로 응모하기로 하였다.\n이를 위해 청장년 농업인 대상으로 설명회를 개최하였는데, 감귤 수확으로 바쁜 시기임에도 고일학 조합장님, 오길원 이사장님을 비롯한 많은 분들이 참석해 주시고 스마트팜 보급사업에 많은 관심을 가져주셨다.\n새해가 아직 시작되지 않았지만 맘꽃가든은 이미 2025년 사업을 시작하고 있다. 그만큼 농업의 기후변화 및 세대 교체가 빠르게 진행되고 있음을 현장에서 느끼고 있다. 이를 위해서라도 현장에서 요구하는 스마트팜을 지속적으로 개발해서 제공하는 것이 필요하다.\n한 농가에서 \"왜 스마트팜이 아직도 보급이 잘 안되는냐??\"는 질문에 \"품종, 토양, 시설현황이 다 달라서 맞추기가 쉽지 않다. 그래서 농업인과 연대해서 현장 상황에 맞추기 위해 노력하고 있다\"고 답변드렸다. 이제 연대하고 공감하지 않으면 대한민국 농업은 위기가 찾아올 수 있다.\n오늘도 현장에서 농업인을 만나고 그들과 함께 공감하는 것이 맘꽃가든이 가야하는 중요한 길임을 느낀다.",
      "content_length": 590
    },
    {
      "id": "223690280389",
      "title": "2024.12.10 : 김녕리 가변형 고설베드 설치 시작",
      "date": "2024. 12. 11. 21:54",
      "content": "김녕리 이웃 농가에 상추 깻잎 재배를 위한 가변형 고설 베드 설치 작업을 시작하다.\n작물 재배 전문가 이신 전김녕리 이장님의 600평 규모 농장에 3월까지 가변형 고설 베드를 설치하기로 했다.\n베드 설치 설계는 다 마치고 제일 먼저 배수관 설치 위한 관로 작업을 시작하다. 포크레인도 기존 기술센터 임대형 모델보다 출력이 커서인지 작업이 어렵지 않게 마무리 되었다..\n백공이 된 자의 여유인가? 이제 원하는 바를 실시하는데 두려움이 없다. ^^;",
      "content_length": 249
    },
    {
      "id": "223670636549",
      "title": "2024.11.23 : 가변형 입식 재배 베드 - 쑥갓 재배",
      "date": "2024. 11. 23. 19:25",
      "content": "상추, 깻잎에 이어 쑥갓도 잘 자란다. 이제 어지간한 엽채류 재배는 다 될 듯... 역쉬 땀흘리는 자는 속이지 않는다.",
      "content_length": 66
    },
    {
      "id": "223665382571",
      "title": "2024.11.18 : 데이터 기반 스마트농업 확산 사업 제주 사례 발표",
      "date": "2024. 11. 18. 21:19",
      "content": "2024년 한해동안 제주 지역 시설과수 농가를 대상으로 보급 사업 진행한 결과를 발표한 자리.. 제주만 바라보다가 전국 업체들과 경쟁하면서 사례발표를 하다보니 긴장이 많이 되었다.\n그래도 나에게 이런 기회가 있음에 감사드리고 좀 더 분발해서 부족한 부분을 매꿔가야 할 듯하다. 역쉬 내가 배워야 할 고수가 많다. ^^;",
      "content_length": 178
    },
    {
      "id": "223661800007",
      "title": "2024.11.15 : 제주시 농정과 청창농 교육생 강의",
      "date": "2024. 11. 15. 15:56",
      "content": "제주시 농정과에서 청창농 교육생을 위한 강의를 요청하셔서 교육을 진행했다.\n교육의 핵심 요지는 대한민국 농업은 이제 농업 고유의 생태 문화적인 의미 \"agriculture\"보다 경영적인 \"business\" 즉 자영업에 가깝다는 얘기였다.\n특히 은퇴세대가 아닌 청창농은 마음 단단히 먹고 접근해야할 창업 스토리와 똑같다.\n거기에 스마트팜 초호화 융복합 기술이 총망라되어 있어야 함을 강조했다. ㅋㅋㅋㅋ\n그래도 박수받고 끝난 강의라 맘이 뿌듯하다. 청년들이여.. 도전하여라!!!!",
      "content_length": 266
    },
    {
      "id": "223656817449",
      "title": "2024.11.12 : 스마트팜 교체 희망 농가 사전 방문",
      "date": "2024. 11. 12. 7:59",
      "content": "스마트팜 교체 설치를 희망하는 농가를 방문했다. 기존 ooo 제품을 사용하고 있는데, 이를 슬라워 제품으로 변경하고자 하셔서 사전 방문을 했다.\n방문했을 때 비가 오고 있었는데, 천창이 닫히지 않고 있었다. TT; 센서가 불량인 것 같은데, 교체 주기를 맞추지 못한 것 같다.\n기존 관수 밸브도 부분 누수가 있어서 이번에 다 교체하자고 하시는데, 이런 교체 작업은 그렇게 어렵지 않다.\n다만 기존 제어 시스템을 다 교체하는 과정은 어떻게 될지 검토가 좀 더 필요한 상황이다.\n신규 설치보다 기존 시스템 교체가 힘들다는 것은 스마트팜을 해 본 사람은 다 안다.. ^^;\n그래도 이것도 새로운 도전이기에 한번 시도해 볼것이다.",
      "content_length": 348
    },
    {
      "id": "223655431719",
      "title": "2024.11.10 : 맘꽃가든 상추 재배 현황",
      "date": "2024. 11. 11. 10:12",
      "content": "다행히 날씨가 아직 추워지지 않아서 이중 및 난방을 하지 않아도 재배가 잘 되고 있다. 작물 재배 전문가와 스마트팜 기술 전문가가 만났을 때 어떠한 결과가 나올 수 있을지를 맘꽃가든 실증 농장을 통해서 확인할 수 있다.\n농업은 원래부터 협업이다. 협업하지 않는 농업은 성장할 수 없다.\n다행히 농산물 가격도 높게 유지되고 있어서 좋은 결과가 나올 것 같다. 이번주도 홧팅!!!\n맘꽃가든 가변형 입식 재배 현황\n재생\n16\n좋아요\n0\n00:08\n\n접기/펴기\n가변형 입식 재배 현황",
      "content_length": 266
    },
    {
      "id": "223654653364",
      "title": "2024.11.07 : 스마트팜 전문위원과 시설 농장 현장 점검",
      "date": "2024. 11. 10. 18:06",
      "content": "관수 스마트팜 설치 농가 8개소에 대한 스마트팜 전문위원 현장 점검 실시,,, 하루 하루 열심히 살고 있는 농장주 분들 홧팅입니다.",
      "content_length": 73
    },
    {
      "id": "223654650584",
      "title": "2024.10.25 : 제주시농업기술센터 신규농업인 기초과정 농업인",
      "date": "2024. 11. 10. 18:03",
      "content": "제주시농업기술센터 스마트농산업 신규농업인 기초과정 농업인 방문..\n그런데 신규농업인이 아닌 베테랑 농업인 분들이었다.. 다만 내가 왜 이렇게 농사지을려고 노력하는지를 공감해 주셔서 많은 힘을 얻었다..\n이제 농사는 관행으로 갈 수는 없다. 바꿔야 한다. 그렇기에 농업인들의 목소리가 전달되어야 한다.\n오늘도 정신없었지만 나를 응원해 주는 분들이 있기에 내일도 일해야겠다. TT;;;\n존재하지 않는 이미지입니다.",
      "content_length": 229
    },
    {
      "id": "223654649470",
      "title": "2024.11.01 : 제주시 상추 작목반 농가 방",
      "date": "2024. 11. 10. 18:02",
      "content": "제주시 상추 작목반 회원분들과 육지 상추 재배 농가 현장 방문 진행 중.. 이번 방문으로 제주 상추 농가의 토경 재배 환경에 많은 변화가 생길 것으로 기대된다.\n참여 하신 모든 회원 분들이 기후온난화/고령화에 따른 재배 작물 변화 속도가 빠르게 진행되고 있다는 사실에 크게 공감했다..\n이번 현장 방문으로 고설 재배 베드를 개선할 중요한 단서를 찾았다. ^^;;;\n무엇보다도 농업 현장에서 농민들과 함께 답을 찾고자 하는 것이 스마트팜 기술 개발의 기본 자세이다.\n존재하지 않는 이미지입니다.",
      "content_length": 275
    },
    {
      "id": "223654647671",
      "title": "2024.11.05 : 전북농업마이스터대학 시설원예분과 방",
      "date": "2024. 11. 10. 18:00",
      "content": "한국농수산대학교 채소학과 안율균 교수님과 전북농업마이스터대학 시설원예분과 학생분들이 맘꽃가든을 방문하셨다. 마이스터 과정 학생분들은 해당 작물 베테랑이시라 작물 재배 관련 강의보다는 현 제주 시설 스마트팜 현황 및 가변형 고설 재배 베드 노하우를 공유하는 자리였다\n특히, 고설 양액 재배를 하면서 관수주기가 3일 내외라는 사실에 깜짝 놀라셨고, 기존 분무수경이나 펄라이트 배지 기반 재배보다 훨씬 양액관수 관리가 쉽다는 것에 크게 응원해 주시고 기술 교류를 지속적으로 진행하기로 하였다.\n나는 반대로 너무나도 귀한 하절기 상추 재배용 차광막 트랜드랑 로메인 신품종 정보를 제공받아서 농업의 품앗이 정신을 느낄 수 있는 소중한 시간이었다..\n새로운 기술에 도전하는 사람은 상대방이 진심일 때 바로 동지가 될 수 있다.. 그래서 농업 최전선에서 기후변화 어려움를 해결해 가는 여러 농민들과 협업하는 것이 대한민국 스마트팜 발전에 가장 중요한 부분이 아닐까 한다. 계속 방문하는 기관이 늘어나서 힘들기는해도 응원해주는 전국 농민을 위해 오늘 하루도 알차게 보내자..\n존재하지 않는 이미지입니다.",
      "content_length": 553
    },
    {
      "id": "223612237184",
      "title": "2024.10.08 : 스마트팜 융복합 사업",
      "date": "2024. 10. 9. 6:35",
      "content": "요즘 농업 현장에는... 아니 스마트팜을 설치하는 현장은 항상 두가지가 존재한다.\n1번째 : 오랫동안 농장주가 자식처럼 아끼면서 사용했던 전기 구동기들.. 당장 바꿔야 되는데 버리기도 힘들고 새로 구입하자니, 가격도 비싸고 설치하기도 쉽지 않다. 그래서 그 구동기를 꼭 살려야 한다. ^^;\n2번째 : 이런 전기 구동기를 ON/OFF하는 스위치나 타이머가 내장되어 있는 구동제어기들... 대부분 지역 내 전기제어업체 들이 제작해서 공급하는 것들이다.\n이러한 전기 구동기나 제어장치가 없으면 농사를 지을 수가 없다.\n물주는 것도 수압이 약해서 펌프로 돌려야 하고, 이제 비오는 날 / 더운 날 시설 내부 온습도 관리 위해서 환풍기, 순환팬 돌리는 것은 필수이다..\n그렇기에 이제 농업인은 꼭 전기를 배워야 한다. 작물, 시설, 전기를 배워야 운영이 가능한 융복합 사업이다.\n아름농장 방문했을 때 \"스마트팜 사업할 때 사업멤버들이 농과계열이 대부분이었는데, 공과대 출신이 있었으면 현재 많이 달라졌을거라\" 는 말을 현장에 갈 때마다 되뇌어 본다..\n스마트팜은 절대 농업도 아니고 ICT 단독 사업도 아니라.. 융복합사업이다.. 그래서 많은 전문가들이 협업해야 된다.\n여하튼 오래가고 볼일이다. 그래야 협업하지!! ^^;",
      "content_length": 624
    },
    {
      "id": "223609752565",
      "title": "2024.10.05 : 차세대 스마트팜 플랫폼 테스트 장비 세팅",
      "date": "2024. 10. 7. 9:56",
      "content": "스마트팜 코드 표준화 및 재사용률을 높이고자 국립원예특작과학원 시설원예연구소에서 개발중인 차세대 스마트팜 플랫폼 \"아라\" 시스템의 현장 테스트 위한 장비 세팅 중!!\n배포버전 1.0의 베타테스트용 장비이지만 여러 구동기와 센서 연동을 통해서 기술적 개선 작업이 진행될 것이다..\n버전 1.0이 \"성장 가능성 무한대\"를 의미한다고 믿기에....",
      "content_length": 191
    },
    {
      "id": "223607911125",
      "title": "2024.10.03 : 신규농가 센서 보드 설정",
      "date": "2024. 10. 5. 16:26",
      "content": "10월 3일 개천절.. 오전에는 농가 현장 방문해서 센서 등록 프로그램 테스트하고 센서값 취득 모니터링 실시..\n현장 설치팀에서 센서랑 LTE라우터 설치하고 나면 마지막 WIFI SSID랑 센서별 ID 입력하는 앱으로 바로 등록할 수 있도록 개발했다..\n등록 완료 메세지 뜨고 앱에서 바로 센서값 확인될 때 약간의 성취감이 느껴진다.\n이 맛에 R&D 사업한다.",
      "content_length": 201
    },
    {
      "id": "223606589784",
      "title": "2024.10.01 : 신규 관수 제어 서비스 설치",
      "date": "2024. 10. 4. 13:18",
      "content": "신규로 관수 제어 스마트팜 설치하고 농장주랑 시간 맞춰서 방문해서 사용법 설명드리고 설치 점검을 완료하다.\n제주도에서 감귤 농장 운영하면서 주중에는 직장에서 공휴일에는 농장 관리하는 분들이 많은데, 조금씩 입소문을 타면서 관수 제어쪽으로 스마트팜 설치해 달라는 분들이 늘어나고 있다..\n물한번 주기 위해 점심 때 짬내서 왕복했던 일이 사라진다고 좋아하셔서 설치하고 같이 테스트 한 나도 뿌듯하다.",
      "content_length": 221
    },
    {
      "id": "223603870577",
      "title": "2024.09.30 : 청소년 체험 구역 정비 완료",
      "date": "2024. 10. 2. 7:52",
      "content": "2박 3일 동안 스마트팜 실증 농장 맞은편 정비하다.\n나만의 정원으로 꾸밀려고 농장 지으면서 나온 돌이나 자재들을 놔뒀었는데, 이번에 싹 다시 정리했다..\n깨끗해진 캔버스가 된 노지 포장.. 이번에 청소년들 상추 재배 체험하고 나면 노지스마트팜 실증 공간으로 재탄생 시켜야 할듯!!\n청년농업인들한테 잘 되는 것만 보여주면서 허상 심어주는 거 말고,, 100평 관리도 얼마나 어려운지를 현실적으로 보여주는 농장으로 거듭날 듯 하다.. ㅋㅋㅋ\n그게 진정한 대한민국 농업이 발전하는 길이다!!",
      "content_length": 272
    },
    {
      "id": "223311128279",
      "title": "2024.01.02 : 제주농업기술원 23개 시험 포장 슬라워 제품 설치",
      "date": "2024. 1. 3. 13:35",
      "content": "제주농업기술원 강정, 상귀 지역 23개 포장에 슬라워 제품 설치를 진행 중이다. 인터넷 망 설치 및 전기 배선 설치를 마무리하고 시설 환경 측정 장치, 구동기 제어 장치함 설치를 완료하였다. 이제 시스템에 해당 포장을 등록하고 구동기, 센서를 설치하는 과정을 수행해야 한다. 이를 통해 제품의 성능 및 문제점을 평가하고자 한다. 2024년 1월 부터 또 열심히 활동을 진행해야 겠다.",
      "content_length": 214
    },
    {
      "id": "223336766911",
      "title": "2024.01.27 : 제주농업기술원 상귀 포장 옥외용 WIFI 공유기 설치",
      "date": "2024. 1. 29. 6:37",
      "content": "시설하우스 주위로 센서나 제어기를 설치하고자 할 경우에는 WIFI 확장기 설치가 필수적인데, 대부분 제품들이 옥내용이라 설치에 제한이 많았다. 좀 더 넓은 곳까지 WIFI 서비스를 제공하려고 옥외용 공유기 제품을 찾고 있었는데 다행히 최근에 TPlink에서 해당 제품을 출시하게되어 설치를 하게 되었다.\n제품은 흰색으로 방수 처리가 잘 되어 있어서 브라켓을 하우스 물받이 난간 파이프에 고정하고 걸어두면 된다. 낙뢰 피해에 대비해서 난간 높이보다 낮게 설치했다.\n통신 모뎀 장비랑 확장기 사이는 옥외용 유선 케이블로 연결하고 케이블이 처지지 않도록 케이블 타이로 고정하는 작업을 진행했다.",
      "content_length": 329
    },
    {
      "id": "223334142538",
      "title": "2024.01.25 : 시설하우스 내 스마트팜 설치 면허 취득 중..",
      "date": "2024. 1. 26. 7:19",
      "content": "본격적인 하우스 내 스마트팜 시설 공사를 위해서 전문건설면허를 취득 중에 있다. 항상 계획적으로 살려고 하는데 건설업 면허까지 취득할 줄이야... ^^; 이게 사업의 재미인 것 같다. 2024년 부터 앞으로 20년 멋진 그림 다시 만들어 보자...",
      "content_length": 138
    },
    {
      "id": "223323257768",
      "title": "2024.01.14 : 관수 밸브 추가 설치 및 로메인 재배",
      "date": "2024. 1. 15. 17:55",
      "content": "겨울임에도 낮 기온이 10도 이상을 유지하다보니 로메인 상추가 잘 자라고 있다. 정식 작업도 진행하는 중이다.\n그리고 별도로 버마드 관수 밸브 50A를 설치해야 되는 일이 있어서 별도로 소켓이랑 유니언을 조립해서 준비했다.\n그런데 기존 밸브가 고착화되어서 분리가 안된다. --; 아... 농업 현장은 항상 변수가 너무 많다. 그래서 어쩔수 없이 PE관을 짜르고 새로 준비한 교체 모듈을 재조립했다.\n일부 길이 조절이 안되어서 추가로 PE관을 짜르고 조립을 끝내고 누수 여부를 확인해 본다. 30분 정도에 끝내려고 교체 모듈을 준비해 갔는데, 결국은 2시간 가까운 시간이 걸린다.",
      "content_length": 323
    },
    {
      "id": "223318113889",
      "title": "2024.01.09 : 점적테이프 마구리 밸브 및 스프링 설치",
      "date": "2024. 1. 10. 13:42",
      "content": "점젝테이프 설치 시 마구리 밸브 및 베드에 고정하기 위한 방법을 계속 고민하다가 최근에 스프링과 연동될 수 있는 마구리 밸브 제품이 있다는 것을 확인하고 20개 제품을 샘플을 받아서 설치 테스트를 하였다. 이제 점적 관수 시설에 대한 세팅은 완료가 된 것 같다.",
      "content_length": 146
    },
    {
      "id": "223308952635",
      "title": "2023.12.31 : 2023년 마지막 가족 여행, 거제 정글짐",
      "date": "2024. 1. 1. 10:25",
      "content": "간만에 가족들과 부산 본가를 방문해서 가족 여행을 다녀왔다. 농사만 한다고 맨날 일할 수 없어서 놀러왔는데, 결국은 거제시농업기술센터를 방문했다. 여기에 요즘 핫한 거제정글짐이 있다. 일본 오사카 여행 때 봤던 식물원 보다 구성이나 운영이 훨씬 더 잘 되고 있다.\n시설하우스 온도 관리 측면에서 내부 온도를 확인해 보니 최저 18, 최대 21도 내에서 관리하는 걸 보고 대단함을 느낀다. 개폐는 상부 천창이랑 하부 측창 개폐 시스템을 갖추고 있었다..\n하부에 있는 귀뚜라미 공조팬... 여기로 따뜻한 바람이 올라온다. ㅎㅎ 나도 이런 시스템 깔고 싶다.\n근래에 방문한 기관 시설 중에 가장 관리도 잘 되는 곳이다. 제주도에서도 공공기관이 이런 시설을 운영하면 좋을 듯..",
      "content_length": 375
    },
    {
      "id": "223202750082",
      "title": "2023.09.04 : 제주농업기술원 광량 센서 설치 모델명 (SP-522-SS)",
      "date": "2023. 9. 5. 9:56",
      "content": "제주농업기술원 5번 시험 포장에 열대 작물 재배 관련해서 광량 및 조도 센서를 설치하기로 하였다. 광량 센서는 그늘진 곳도 측정이 가능한 Apogee 사의 SP-522-SS 모델이다. RS-485 출력에 맞춰서 데이터를 측정 수집할 수 있도록 준비를 하였다.\n아래가 현재 작물 재배 현황이다. 재배 방법은 최대 일사량 반응을 보기 위해서 2가지 형태로 유인줄 구성을 달리 하였다. 이에 따른 성장 속도 및 일사량 구성을 실제로 확인하고자 한다.\nSP-522-SS 모델은 빛스펙트럼 측정 범위가 넓어서 그늘진 곳까지 측정이 가능하기에 하부에 50cm 정도 돌출된 구조를 만들어서 센서를 설치하고자 한다.\n일사량 센서 외에 조도센서를 추가 설치할 예정이다. 작물 재배 영역에서 30cm 정도 상단에 조도 센서를 설치하고자 한다.\n센서 설치 위치를 검토한 뒤 환경 측정용 센서함을 우선 설치하기로 하였다. 센서를 설치하기 위한 브라켓을 별도로 제작해야 할 것 같다. 보통 센서 업체에서 제공하는 센서 브라켓 가격이 워낙 비싸서 이번에는 자작하기로 하였다.\n센서함까지 설치완료했고, 전원 연결도 확인했다. 이제 브라켓 제작 해서 센서 설치하고 해당 데이터 측정 부분만 잘 확인하면 될 것 같다.\n센서 종류가 너무 많다. 자연을 분석한다는 것은 나에게 하루하루 도전의 연속이다.",
      "content_length": 654
    },
    {
      "id": "223220731754",
      "title": "2023.09.24 : 고설 재배용 점적테이프 교체 및 테스트",
      "date": "2023. 9. 25. 7:48",
      "content": "점적테이프를 10cm 간격으로 된 칩인 방식 국산 제품을 사용했는데 오래 사용하다 보니 여러 문제점이 보여서 최근에 5cm , 10cm 드립이 가능한 제품을 구매해서 설치 테스트를 진행하고 있다. 설치 테스트 때문에 관수를 하지 못했던 구역이라 상추의 잎이 축 쳐저 있어서 빨리 설치를 하고 관수를 했다.\n다행이 이 제품을 공급하는 곳에서 저렴하게 구매를 했는데 제주도라 택배 비용이 제품 구매 가격의 1/3 정도를 차지했다.",
      "content_length": 238
    },
    {
      "id": "223216399688",
      "title": "2023.09.19 : 제주농업기술원 시험포장 \"슬라워\" 설치 준비",
      "date": "2023. 9. 20. 7:43",
      "content": "제주농업기술원 내의 시범포장 중에 일부를 맘꽃가든에서 개발한 스마트팜 제품으로 설치하기로 하고 준비 중에 있다. 오늘 주요 설치 포장의 인터넷 통신 연결을 위해서 KT, 기술원 연구사, 통신설치업체 관계자들이 모여서 주요 현장들의 통신 설치 가능 여부와 기존 설치 현황을 파악했다..\n아래는 제주농업기술원에서 관리하는 상귀 지역 시험포장이다. 이곳에 6대의 스마트팜을 설치할 예정이다.\n기존 포장 중에는 반딧불이와 경농 스마트팜 제품이 설치되어 있다.",
      "content_length": 252
    },
    {
      "id": "223214972870",
      "title": "2023.09.18 : 안정적인 상추 재배 프로세스 정착",
      "date": "2023. 9. 18. 18:57",
      "content": "주말에는 사무실 대신에 농장에서 일하는 일정이 고정화 되었다. 그래도 행복하다. 안정적인 상추 재배 프로세스가 정착되어 가고 있음을 현장에서 느끼고 있다. 파종, 육묘, 정식, 재배, 수확, 포장, 판매 과정이 하나씩 자리를 잡아가고 있다.\n이번에 2Kg 짜리 상추 포장 박스를 별도로 제작하였다. 식당 상인들이 매출 감소로 어려움을 겪고 있어서 2Kg 단위의 소포장을 원하는 경우가 많아서 별도로 2Kg 소포장 박스도 주문하였다.\n500평 면적에 38,000주 상추 재배가 이제 자리를 잡고 하나씩 하나씩 품질 향상에 촛점을 맞추고 있다.\n수확 후 정리한 곳에는 다시 정식을 하고 상추 재배가 1년 내도록 지속적으로 재배될 수 있도록 구축중이다.\n매일 납품하는 상추 박스들... 9월 중순부터 물량이 증대되고 있음을 확인하였다. 아마도 추석 이후에는 가격 하락이 될 것 같다.",
      "content_length": 435
    },
    {
      "id": "223209999631",
      "title": "2023.09.13 : 제주농업기술원 일사량/조도 센서 설치",
      "date": "2023. 9. 13. 8:07",
      "content": "제주농업기술원 시험포장에 일사량/조도 센서를 정해진 위치에 설치하고 측정 프로그램을 업로드 하였다. 측정 위치가 다 달라서 해당 위치에 맞는 브라켓을 구하는게 쉽지가 않았다.\n아래는 일사량 센서를 배치하기 위한 브라켓이다. 제주도는 특히 자재매장이 많지 않기에 딱 원하는 제품을 보고 찾아야 하는데, 어떤 때는 반나절 이상 맘에 드는 부품을 찾으러 다녀야 한다.\n하우스 기둥에 브라켓을 설치하고 그 위에 일사량 센서를 배치할 예정이다.\n일사량 센서를 설치하고 측정 프로그램을 업로드 하였다. 측정된 데이터는 바로 제주농업기술원 빅데이터 서버로 전송된다.\n조도 센서도 각 시험군 위치와 높이에 맞춰서 설치하였다. 설치가 잘된 만큼 작물도 잘 재배되기를 희망한다.\n추가적으로 그늘진 하부에도 조도 센서와 일사량 센서를 설치했다.",
      "content_length": 405
    },
    {
      "id": "223208055173",
      "title": "2023.09.08 : 제주 동부 지역 농업 관계자 단체 방문",
      "date": "2023. 9. 11. 10:14",
      "content": "제주동부농업기술센터 김경익 소장님을 비롯한 동부지역 농업 관계자 분들이 농장을 방문해 주셨다. 무엇보다도 입식 재배 시설 및 스마트팜을 가까운 지역 농민들에게도 보급할 수 있다는 희망이 현실화 되는 것 같아서 하루하루 최선을 다하고 있음에 보람을 느낀다.\n제주로 이주해서 본격적으로 시설하우스 농사를 시작한 뒤 4년째 접어들고 있는데, 이렇게 지역 주민들이 찾아와서 관심을 가져주시니 이제서야 제주도 농민으로 자리잡을 수 있음을 느낀다.",
      "content_length": 244
    },
    {
      "id": "223178338663",
      "title": "2023.08.07 : 청상추 정식 재작업",
      "date": "2023. 8. 8. 18:06",
      "content": "태풍이 오기전에 또 다시 청상추 정식 작업을 진행했다. 더운 날씨에 시설하우스 안에서 작업 한다는 게 쉽지가 않다. 그래도 다시 또 도전하고 내일부터 태풍대비다..",
      "content_length": 91
    },
    {
      "id": "223198862443",
      "title": "2023. 08. 30 : 차세대 온실 종합관리 플랫폼 현장 평가회 참석",
      "date": "2023. 8. 31. 18:41",
      "content": "클라우드형 스마트팜 초기 모델 개발 때부터 자문을 받아왔던 시설원예연구소 방지웅 박사의 초청으로 차세대 온실 종합관리 플랫폼 현장 평가회에 참석했다. 올해 초 제주도 방문 때부터 얘기했던 저비용, 저개발, 신시장 개척이라는 3가지 키워드를 가지고 시설원예연구소에서 먼저 이러한 플랫폼을 개발/배포하겠다는 것이 정말 대단한 일인 것 같다.\n무엇보다도 기존의 스마트팜 기자재 표준화 한계를 벗어나서, TCP/IP 통신 기반(MQTT)으로 확장하며, PLC 등의 고가 장비 기반 단일 서버가 아닌 클라우드 서버를 통해 IoT 기기를 연결하는 개념으로 스마트팜 시스템 전환하고자 하는 기술 혁신이 그대로 국가 정책에도 반영될 것 같다.\n이에 제주농업기술원 김현수 연구사와 함께 해당 설명을 들으면서 맘꽃가든과 제주농업기술원이 추진하고 있는 \"오픈소스 기반 저비용 스마트팜 시스템 개발이 향후 스마트팜 개발 방향의 주류가 될 것이다\"라는 확신을 가지게 되었다.\n맘꽃가든에서 사용하고 있는 MCU와 동일한 계열의 ESP32 기반 8채널 데이터 수신 장치도 확인하였다. 많은 스마트팜 관계자들이 참석하여 열띤 스마트팜 IoT 기기 개발 및 적용 현장을 확인하였다.\n시설원예연구소 방지웅 박사가 개발한 ESP32 기반 8채널 센서 데이터 수집 장치, 기존의 원형 커넥터가 아닌 C-TYPE를 적용하여 범용성을 상당히 높인 결과를 만들었다. 농업 분야에서 이렇게 다양한 제품 개발 기술을 가진 분들이 계시기에 대한민국의 스마트팜 미래는 점점 더 밝아지리라.",
      "content_length": 750
    },
    {
      "id": "223190084677",
      "title": "2023.08.22 : 베드별 상추 재배 순환 프로세스 구축",
      "date": "2023. 8. 22. 10:05",
      "content": "이제 총 21개 재배 구역에서 38,000주 상추가 베드별로 순환 재배되는 프로세스가 구축되어가고 있다. 오늘 아침 상추 수확을 위해 3명의 인력이 투입되어서 수확 작업을 진행하고 계신다.\n동시에 다른 베드에서는 정식한 상추가 잘 자라고 있다. 365일 500평 규모에서 하루에 15박스 이상 수확할 수 있는 프로세스 구축 실증이 거의 마무리되어 가는 것 같다.\n로메인은 잘 재배되고 있어서 추후에 다품종 재배 프로세스도 구축이 가능할 것 같다.\n품질도 많이 개선되었고, 최근에 제주지역 상추 작목반 관계자 분도 농장 견학을 하셔서 추후에 제주도 상추 재배 작목반에 가입도 할 예정이다.",
      "content_length": 328
    },
    {
      "id": "223172555162",
      "title": "2023.08.01 : 제주도 감귤 과수원 토양 분석 모니터링 (C&H 협조)",
      "date": "2023. 8. 2. 9:44",
      "content": "제주농업기술원과 제주ICT 협동조합 2개 기관과 협업으로 제주도 감귤 과수원 토양 분석 모니터링을 진행하고 있다. 전체 농가 중에서 일부 농가의 센서 데이터 값이 정상적으로 취득되지 않고 있어서 현장에 직접 가서 측정값을 모니터링하고 센서를 추가 설치했다. TEROS21 모델은 농가당 하나씩 설치했는데, 이번에 C&H 에서 추가 분석 위해 토양 센서를 실험용으로 추가 제공해 주셔서 설치 모니터링 진행 중이다.\n기존에 설치한 수동 토양 수분 장력 센서는 석영 부분이 파손되어 일단 제거하고 추후 석영만 추가 구매해서 설치해야 할 것 같다.\n제주농업기술원 연구사와 함께 다른 감귤 농장에 방문해서 미래센서 데이터 신뢰성 검토를 위해서 고정형으로 설치한 2개 모델 이외에 휴대용 센서를 설치해서 해당값을 확인하고 있다.\n휴대용 데이터 로거에 토양 옵션을 변경하니깐 측정값 차이가 많이 발생해서 제주도 토양중에 대표적인 화산회토 기준으로 값을 확인할 예정이다.",
      "content_length": 479
    },
    {
      "id": "223186707700",
      "title": "2023.08.18 : 제주농업기술원 청년 농업인 교육 프로그램",
      "date": "2023. 8. 18. 8:36",
      "content": "제주농업기술원에서 추진하고 있는 청년 농업인 교육 프로그램의 일환으로 교육생들이 맘꽃가든 농장을 방문하였다. 김지우 지도사 인솔로 약 10여명의 청년 농업인들이 방문해서 입식 재배 시설 및 클라우드형 스마트팜 운영에 대해 소개를 해주었다. 무엇보다도 적은 비용으로 이런 시설과 시스템을 구축할 수 있다는 것에 큰 관심을 가졌다. 그리고 연간 소득 및 매출액을 물어보는데, 이에 대한 대답은 \"상추처럼 천천히 성장 중\"임을 알려주었다. 교육생들이 서귀포 지역에 살고 있어서 감귤 재배를 하고 있고, 노지 재배도 많아서 스마트팜 도입에 대해서 고민이 많다고 한다. 최근에 청년농업인들과 자주 만나고 얘기를 나누다 보니깐, 의외로 경영자적인 마인드로 접근하는 요망진 청년 농업인들이 많다는 것을 느낀다. 농업은 철저한 자기 사업이다. 시골의 정서는 이제 농업 현장에서 찾아보기 힘들다. 그래도 이렇게 농업을 이끌어 가고자 하는 청년이 많고 그들과 소통할 수 있다는 것은 내게 큰 삶의 활력소다.\n농장 내부에 모기가 많아서 밖에서 얘기를 나누는데, 반가운 소나기가 내리기 시작해서 다들 즐거운 맘으로 비를 맞았다.\n상추는 여전히 성장 중이다.....",
      "content_length": 583
    },
    {
      "id": "223185728514",
      "title": "2023-08-16 : 무인 방제기 개발 관계자 미팅",
      "date": "2023. 8. 17. 8:08",
      "content": "제주도내에서 무인 방제기를 개발하고 있는 파워레인 임영진 공장장님, 박대한 연구소장님 , 하이브리드 정밀 임한석 대표님, 한국생산기술연구원 양영진 박사님과 함께 무인 방제기 개선에 관한 관계자 미팅을 가졌다. 도내에서 많이 사용되는 제품인데, 다양한 시설하우스 환경 및 작물 조건에서 약제를 살포하기 위한 기능 개선 작업을 추진하기로 하였다. 엔지니어에게 있어서 제품 완성은 끝이 아니라 새로운 시작이다. ^^; 추후 스마트팜과 연계될 수 있는 방안에 대해서도 같이 협의하는 시간이었다. 파워레인은 도내에서 유일하게 관수 자재 및 시설을 자체 생산 개발하는 업체로서 다른 자재 유통 업체에 비해서 배울 것이 많은 업체이다.\n이번에 특별히 양영진 박사님이랑 임한석 대표님까지 참석해 주셔서 시설하우스 내의 제어 기자재 개발에 대한 의견 및 개선방향을 협의할 수 있었다.\n파워레인에서 특허 개발한 교반기 제품도 확인하고 이를 통해 약제가 교반/살포되는 과정을 확인할 수 있었다. 농업 환경 개선을 위해 노력하는 많은 분들을 뵐 때 마다 스마트팜 개발 업체 대표로서 책임감을 느낀다.",
      "content_length": 547
    },
    {
      "id": "223179751344",
      "title": "2023.08.10 : 상추 38,000주 연중 생산 체제로",
      "date": "2023. 8. 10. 8:21",
      "content": "태풍 대비한다고 정신이 없었는데, 무탈하게 잘 지나가고 묶어두었던 버팀줄을 다 풀고 나니, 상추가 다시 보이고 있다. 이제 맘꽃가든에서 상추 38,000주 연중 생산 체계로 전환이 될 것 같다. 구역별로 파종, 육묘, 정식, 재배, 수확이 순차적으로 진행될 수 있도록 하는 체계를 만들었다. 이제 품질을 올리고 재배 품목을 다양하게 구성하는 것이 필요하다. 이렇게 세팅하는데 하우스 짓고 딱 3년 걸렸다.",
      "content_length": 226
    },
    {
      "id": "223170546655",
      "title": "2023.07.29 : 농업 대학 지원 미래 농업인 방문",
      "date": "2023. 7. 31. 9:26",
      "content": "육지에서 귀한 손님들이 오셨다. 농업 대학교에 진학을 준비 중인 여주자영농업고등학교 3학년 학생 3명과 경북대학교 농과대 재학중인 학생이 방문해서 입식재배 시설과 스마트팜 기술에 대해서 문의를 하였다.\n무엇보다도 이미 진로에 대한 목표와 준비가 진행 중인 청년이라서 질문들이 직설적이었다. 수익성, 기술 개발 정도, 가격 구성 등에 대해서 질문을 나누었다. 특히 작물 선택의 중요성을 같이 고민할 수 있다는 게 너무 좋았다.\n농업은 단순한 경영이 아니라 사업가로서 접근해야 하며, 백가지 기술을 가진 백공이 되어야 한다는 말에 공감하기에 농업의 발전에 큰 도움이 될 것 같다.",
      "content_length": 322
    },
    {
      "id": "223145727655",
      "title": "2023.06.28 : 영파머스 투자자 대상 맘꽃가든 사업 발표",
      "date": "2023. 7. 3. 18:12",
      "content": "만 50세 이하 영파머스를 대상으로 하는 IR 발표자리가 있어서 상추 재배 및 스마트팜 설치를 앞두고 서울 여의도에 발표를 하러 갔다. 이제 강의랑 사업 소개를 여러번 하다보니깐 그렇게 긴장이 되지도 않는다. 약 20명의 투자 전문가들 앞에서 맘꽃가든이 가고자 하는 농업 환경 변화의 길에 대해서 발표를 하였다.\n무엇보다도 맘꽃가든이 지향하고 있는 입식으로 전환 필요성에 대하여 얘기를 하였다.\n그리고 맘꽃가든이 개발한 다구형 포트와 스마트팜 통신 모듈을 가지고 직접 투자자에게 설명하였다. 무엇보다고 가공 식품 위주의 농식품 업체가 많은데, 이렇게 재배 시설 개선과 스마트팜 개발을 동시에 하는 업체는 처음 본다는 얘기를 많이 듣게 되었다. 특히 농업인들과 함께 직접 네트워크를 구성하는 것이 좋은 장점으로 판단된다고 하셔서 희망의 메세지를 다시 한번 더 써본다.\n정말 바쁘다. 블로그에 사진 올리고 정리할 시간도 없이 하루하루를 보내고 있다.",
      "content_length": 473
    },
    {
      "id": "223168170482",
      "title": "2023.07.28 : 상추 박스 1,500개 추가 제작",
      "date": "2023. 7. 28. 6:52",
      "content": "상추 가격이 많이 올랐다. 식당 주문도 덩달아 많이 생기면서 기존에 제작했던 상추 박스가 다 소진되었다. 그래서 이번에 추가로 상추 박스 1.500개를 추가 제작하였다. 기존 맘꽃가든 로고를 넣었던 것을 이번에는 과감히 없애고 기존 농가들도 사용하는 상추 박스 디자인으로 제작을 하였다. 대신에 박스 재질이 더 좋은 하얀색 박스로 제작하였다.\n처음에 박스 2,000개 정도 제작할 때 정말로 다 판매하고 소비할 수 있을까 했는데, 포기하지 않고 재배, 판매하다보니 드디어 상추 박스를 다 사용하게 되었다. 이번에 새롭게 제작한 박스는 아래처럼 하얀색으로 좀 더 두꺼운 재질로 선택했다.\n더운 날씨에 이 많은 상추 박스를 정리하려고 하니, 온 몸이 땀으로 범벅이다. 이렇게 나의 상추 재배 도전은 여전히 진행중이다. ^^;",
      "content_length": 403
    },
    {
      "id": "223164335525",
      "title": "2023.07.21 : 제주농업마이스터대학 졸업생 스터디 강의",
      "date": "2023. 7. 24. 6:42",
      "content": "제주특별자치도에서는 제주농업마이스터 대학을 운영하고 있다. 이곳을 졸업한 졸업생들이 모여서 스터디 모임을 운영하는데 스마트팜 강의를 요청해서 참석하게 되었다. 실질적으로 같은 농민의 입장에서 스마트팜을 얘기하고 개발하는 곳이 없다고 해서 스터디 대표께서 직접 연락을 주셨는데, 이렇게 농업 현장에서 같이 농업 현장의 문제점을 토론하는데 보람을 느낀다.\n파워레인에서 개발한 무인방제기... 최근에 한국생산기술연구원의 의뢰로 제품 개선에 도움을 달라고 해서 살펴본 제품을 현장에서 직접 보게 되었다.\n메인전원함에 설치된 스피드바...",
      "content_length": 296
    },
    {
      "id": "223157703272",
      "title": "2023.07.16 : 제주시 4H 청년 농업인 방문",
      "date": "2023. 7. 16. 17:40",
      "content": "제주시 4H 청년 농업인들이 농장 방문을 하였다. 과수 보다는 채소 재배에 관심이 많아서 청년후계농에 선정되거나 벌써 토지 임대/매매하고 시설하우스를 지을 준비를 하기도 했다. 시설 / 토지구입 자금 부족으로 정부지원사업에 적극적으로 참여한 것 같은데, 초기 투자 금액이 적지 않아서 같은 농민으로서 걱정이 앞선다. 그래도 젊기에 도전하는 청년 농업인들이 있기에 농업 고령화 걱정은 잠시 접어도 될 것 같다. 계속된 장마로 농장에 모기가 너무 많다.",
      "content_length": 251
    },
    {
      "id": "223152834720",
      "title": "2023.07.08 : 서귀포 스마트팜 전문가 교육 수강생 농장 견학",
      "date": "2023. 7. 11. 13:10",
      "content": "감귤 재배 명인이신 김종우 회장님이 주관하고 있는 서귀포 스마트팜 전문가 교육 수강생들이 농장 견학을 왔다. 10명 내외로 방문하기로 하였는데, 어떻게 소문이 났는지 20명 넘는 농민들이 방문해서 입식 재배 시설 및 스마트팜 운영 상황을 함께 공유했다. 특히 김종우 회장님이 적극적으로 스마트팜 기술에 대하여 농민의 입장에서 접근해야 하는 방법 등에 대해서 토론할 수 있는 자리였다.\n다들 농업인들이라 작물 재배 및 스마트팜 제어에 관심이 많으셔서 즐거운 시간을 보낼 수 있었다.",
      "content_length": 268
    },
    {
      "id": "223124253064",
      "title": "2023.05.27 : 감귤연구회 스마트팜 강연 및 시연",
      "date": "2023. 6. 9. 11:37",
      "content": "대부분의 스마트팜 교육이 이론 교육에 머물러 있다는 문제점을 타파하기 위해서, 김종우 회장님의 부탁으로 스마트팜 제품 시연을 실시하였다. 현재 농업현장에 사용되는 장치 등을 기반으로 직접 장치 구현을 해서 스마트팜 구성이 어떻게 되어야 하는지에 대해서 토론을 하였다.\n감귤연구회_스마트팜 시연\n재생\n13\n좋아요\n0\n00:07\n\n접기/펴기\n감귤연구회_스마트팜 시연\n간단하게 원격 제어를 통해 MC 스위치가 작동되고 이를 확인하기 위해 A접점, B접점용 경광등을 연결해서 구동기 제어 신호에 따라서 어떻게 스마트팜 제어 장치와 MC가 연동되는 지를 설명하였다.\n그리고 농업현장에서 직접 사용되는 버마드 50A, 밸콘 50A 밸브를 각각 제어하는 방식에 대해서 설명드리고, 개폐기 제어도 함께 설명을 드렸다.",
      "content_length": 393
    },
    {
      "id": "223122192303",
      "title": "2023.06.05 : 맘꽃가든 청상추 재배 현황",
      "date": "2023. 6. 7. 9:10",
      "content": "여름 감기에 걸려서 1주일 동안 제대로 활동을 못하고 있다. 그래도 상추는 키워야 하고 재배도 해야 한다.\n이번에 특별하게 제작 주문한 흑백 유공 비닐에 상추를 식재하고 있다. 기존에 대비하여 상추 품질을 높일 수 있을 거라 기대한다. 그래서 육묘한 상추를 하나씩 뽑아서 유공비닐 기준으로 식재를 하고 있다.\n식재된 상추가 잘 자라기를 기대한다.\n그리고 설치했던 차광막을 다시 걷었다. 광에 의한 성장 속도 차이가 발생하였다. 제주 지역에 계속된 흐리고 비오는 날씨 때문에 차광막까지 설치했던 상추의 상태가 별로 좋지 못하다. 결국 차광막을 다시 정리해서 한곳으로 모았다.\n잘 자라고 있는 상추의 모습을 보고 있으니 아픈 몸도 낫게 하는 것 같다. 이번 감기는 쉽게 떨어지지 않는 것 같다. 하루 정도는 쉬어야 할 것 같다.",
      "content_length": 405
    },
    {
      "id": "223136039466",
      "title": "2023.06.20 : 서귀포 농업 기술 센터 스마트팜 교육",
      "date": "2023. 6. 22. 17:50",
      "content": "제주도내 스마트팜 교육 요청이 계속 있어서 서귀포 농업 기술 센터에서 스마트팜 교육을 실시하였다. 기존과 동일하게 우리가 제작한 제어 시스템과 환경 측정 장치를 가지고 가서 스마트팜 구성에 어떻게 사용되는지를 시연해 드렸다.\n무엇보다도 농업현장에 사용되는 장치를 직접 가지고 설명하는 것이 교육 효과가 제일 높다. 그리고 농민들의 질문도 제일 많아진다. 특히 현장에서 농업용 장치를 설치/유지/보수를 해 보신 분들은 꼭 명함을 가져가신다. ^^;\n이제 6월 마지막 날 제주시농업기술센터에서 하는 스마트팜 교육을 하고 나면 스마트팜 개발에 집중해야 할 것 같다.",
      "content_length": 313
    },
    {
      "id": "223132541662",
      "title": "2023.06.16 : 동부농업기술센터 스마트 강소농 현장 교육",
      "date": "2023. 6. 19. 8:20",
      "content": "동부농업기술센터에서 진행한 스마트 강소농 교육 프로그램 마지막 회차로 맘꽃가든 실증 농장을 방문해 주셨다. 참가하신 분들 중에 초보 농민분들도 계셔서 귀농 선배로서 이런 저런 얘기를 나눌 수 있는 기회를 가지게 되었다.\n동부농업기술센터의 이석준지도사가 단순한 현장 견학이 아니라, 스마트팜 장치의 직접 구동 및 구성 방법에 대한 강의를 부탁하셔서 맘꽃가든에서 개발한 슬라워 제품을 실습용으로 제작했다. 농업 현장에 직접 사용되는 순환팬, 밸브, 개폐기 등을 연결해서 직접 구동되는 과정을 설명했다.\n그리고 각종 전기 장치들로 직접 실물을 보여드리면서 구동을 해서 보여드렸다.\n이번 교육에는 특별히 박대리가 보조강사로 참여해서, 스마트팜 장치 구동 시연을 농민분들에게 해 드렸다. 앱 및 소프트웨어 개발하면서 이제 하드웨어 구성, 시연도 진행하게 되어서 뿌듯함을 느낀다.",
      "content_length": 430
    },
    {
      "id": "223128851062",
      "title": "2023.06.14 : 본격적인 상추 수확 작업",
      "date": "2023. 6. 14. 17:44",
      "content": "상추 재배가 안정을 찾아가면서 본격적으로 상추를 수확하고 있다. 이전에 육묘를 통해 정식했던 20,000주 정도에서 수확이 진행되고 있고, 다 채우지 못한 곳은 육묘 말고 직파를 통해서 38,000주를 채워가고 있다.\n안정적인 상추 수확 작업을 위해 고정 인력을 채용하기로 하고 장모님이 새로 고용한 분에게 상추 수확 및 잎 정리하는 방법을 가르쳐 주고 계신다.\n다행히 상추 가격은 2주 전부터 오르고 있어서 이번 여름에 높은 수익을 기대하고 있다.\n장모님이 수확한 상추를 4kg 박스에 적재하는 방법을 가르쳐 주신다. 새로 오신 분은 이전에 토경 재배 작업만 하셨는데, 입식 재배로 작업하니깐 너무 좋은 것 같다고 계속 일하고 싶다고 하신다.\n사위 잘못 만나서 농장에서 고생하시는 장모님... 이번 여름에 꼭 수익 창출해서 용돈을 팍팍 드려야 할 것 같다.\n상추의 생육 상태를 확인하고 계시는 실장님... 상추잎 중에서 생육 상태가 좋지 않은 것은 제거하고 잎은 색깔, 두께 등을 수시로 체크하고 계신다.\n그리고 상추 재배 일손이 부족해서 85세 이신 장인 어른까지 상추 정식에 참여하시고 계신다. 500평이라는 공간에 38,000주 재배 실현은 거의 완성을 했는데, 이제 안정적으로 재배하고 수확, 판매하는 것이 남아있다.",
      "content_length": 630
    },
    {
      "id": "223117320322",
      "title": "2023.05.31 : 서부농업기술센터 스마트강소농 강의",
      "date": "2023. 6. 1. 11:01",
      "content": "스마트팜 강의 요청이 연속으로 있어서 이번에는 서부 농업기술센터에서 스마트 농업기술 교육을 실시했다.",
      "content_length": 56
    },
    {
      "id": "223097030643",
      "title": "2023.05.07 : 토양 수분 장력 센서 추가 설치 및 스마트팜 제어 모듈 설치",
      "date": "2023. 5. 9. 9:06",
      "content": "제주 ICT 협동조합 회원 농가 중에 천혜향 재배 농가에 토양 수분 장력 센서 TEROS 21 설치를 하고 센서 데이터 확인하기 위해서 방문을 하였다. 중요한 것은 농민이 직접 센서와 센서 측정함을 설치한 것이다. 다행히 해당 농가는 청년 농업인이라서 IOT 기기 사용 및 전기 설비 설치에 어려움이 없어서 나는 방문해서 측정 프로그램 업로드하고 데이터 이상 유무만 확인하였다. 이렇게 농업은 변화되고 있다. 스마트팜 제품이 Easy to Use 되기 까지는 현장 농업인들의 자발적인 노력이 필요하다.\n그리고 추가로 스마트팜 기자재를 설치하고 있는 농가를 방문했다. 해당 농가에 SHT-35 온습도계 2쌍을 설치했는데, 설치 백엽상을 15m 이상(양쪽 폭 30m) 떨어진 곳에 설치하기를 원하셨는데, 거리가 멀어서 인지 데이터가 올라오지 않는다. 센서 전원이 5V 이하라서 15m 이상 거리까지는 안정적으로 센서 전압이 유지되지 못하는 것 같다. 예상했던 바였지만 막상 이렇게 되고 나니 고민이 많아졌다. 위치를 조정할 것인가? (농장주가 원하지 않음), 케이블을 바꿀것인가? (다시 배선 작업해야 함) 측정 위치 가까운 곳에 센서함을 두개 설치할 것인가?( 보드 제작 비용 증가)...\n다행히 케이블을 교체하고 8m 거리에서는 측정이 되어서 추후 연장 케이블 구매해서 다시 측정해 보기로 하였다.\n그리고 스마트팜 관수 제어를 위한 배선 작업을 실시하였다. 기존 배선함에 EOCR를 추가 설치한 뒤 스마트팜 제어 모듈이랑 자동/수동 전환 스위치를 통해서 스마트팜 관수 제어에 문제가 생겼을 경우에도 수동으로 사용할 수 있도록 하였다. 이렇듯 스마트팜 설치 시 기존 설비를 제거하고 설치하게 되면 간단하게 운영이 가능할 수 있지만, 혹시 발생될 수 있는 비상 상황을 대비해서 기존 설비도 운영될 수 있도록 세팅을 해야 되기 때문에 스마트팜 설치가 쉽지가 않다. 왜냐하면 농장의 설치 상황도 다르고 요구사항도 차이가 나기 때문이다. ^^;",
      "content_length": 971
    },
    {
      "id": "223096365854",
      "title": "2023.05.07 : 서귀포 감귤 농가 스마트팜 강의",
      "date": "2023. 5. 8. 15:08",
      "content": "감귤명인이신 김종우 회장님께서 운영하시는 감귤 농가 스마트팜 강의 프로그램에 강사로 초대를 받아서 연휴에도 열심히 일하는 행운을 가지게 되었다. 청년 농업인을 포함하여 10명의 농업인들에게 \"저비용 스마트팜 및 빅데이터 활용\"이라는 주제로 강의를 하게 되었다. 올해 10기수에 걸쳐서 강의를 하게 되어서 나름대로 농업 현장의 농민들과 많은 스마트팜 적용 애로 사항을 얘기하고 토론할 수 있을 것 같다. 첫 강의라서 그런지 2시간 강의 시간이 지루하지 않을 정도로 뜨거운 열기를 느낄 수 있었다. 이번 강의에서는 뜻하지 않게 중요한 질문이 나왔다. \"스마트팜 설치하면 작물 재배 품질에 효과가 있나요?\"... 이에 대한 나의 대답은 \"가능하지만, 작물 재배 품질까지 기대하시기에는 아직 부족한 부분이 많습니다. 작물 재배 품질 효과보다는 노동력 절감에 중점을 두셔야 합니다\" 였다.\n강의 과정에 열띤 질문과 토론이 이어지면서 김종우 회장님께서 경험한 스마트팜 기술 적용 사례도 말씀해주셔서, 많은 도움이 되었다. 이렇게 현장에서 농사를 짓는 농민과 전문가가 늦은 저녁시간까지 연구하고 고민하고 있지만, 아직 스마트팜 기술 적용이 쉬운 것은 아니다. 인공지능, 빅데이터 기술을 적용하기 전에 농장 시설 개선 및 관리가 중요한 것이 현실이다.",
      "content_length": 636
    },
    {
      "id": "223093194302",
      "title": "2023.05.03 : 청양 상추 농가 2번째 가변형 고설 재배 시설 구축",
      "date": "2023. 5. 4. 11:12",
      "content": "충남 청양 상추 농가에 가변형 고설 재배 베드 및 포트를 설치 하였다. 전국 단위로 가변형 고설 재배 시설을 구축하고자 했는데, 이렇게 빠르게 제2의 맘꽃농장 구축이 진행될 줄은 몰랐다. 직접 가변형 고설 재배 베드를 설치하셨는데, 청양 상추 농가 농장주에게 진심으로 감사의 말씀을 이 자리를 빌어서 드리고자 한다. 아래는 시멘트 바닥 시설이 되어 있어서 쉽게 가변형 고설 베드 및 포트 설치가 가능했다고 하신다.\n가지런히 놓여 있는 청상추가 잘 성장하기를 바란다. 기존의 고정형 설비 대비 30% 이상 식재가 가능해서 농가에서도 수확량이 증대되고 작업도 서서하는 것이라 기존보다 작업 환경도 개선될 것으로 기대하고 계신다.\n여기는 두번째로 설치한 상추 시설하우스 내부 모습이다. 바닥이 기존의 토경 재배 시설이라서 베드 설치에 어려움이 있었다고 하시는데, 다행히 잘 설치도 되고, 정식까지 마쳤다고 하신다. 이번 5월 중순경에 직원들과 현장을 방문할 예정이다. 한껏 기대가 되고, 베드 시설을 운영하시는데 문제가 없도록 많은 지원을 해드려야 할 것 같다.",
      "content_length": 535
    },
    {
      "id": "223115388327",
      "title": "2023.05.29 : 제주농업기술원 스마트팜 정예인력양성 프로그램 강의",
      "date": "2023. 5. 30. 13:00",
      "content": "석가 탄신일 대체공유일 지정으로 휴무일인데도, 미리 약속한 강의 일정이 있어서 제주농업기술원에서 강의를 하게 되었다. 프로그램은 \"스마트팜 정예인력양성 프로그램\"이며 나의 발표 주제는 \"저비용 스마트팜 및 빅데이터 활용\"에 대한 강의였다. 교육 담당자인 김지원 지도사가 비도 오고 공휴일이라 참석자가 많지 않을 거라는 걱정을 했음에도 불구하고 강의실 의자가 다 찰 정도로 많은 분들이 참석하였다.\n그만큼 본인의 농장에 스마트팜을 적용하고자 하는 열의가 높음을 알수 있었다. 특히 나와 같은 기술개발 업무나 IT 프로젝트에 참여했던 귀농인 분들도 계셔서 여러가지 기술적인 현황 등에 대해서 얘기를 나눌 수 있는 자리였다.\n약 4시간에 걸친 교육 시간 동안 단순한 이론 교육에 그치지 않고, 실제 앱 사용, 센서 장치 특징, 장치 구동 등을 보여드리고자 노력했다. 이제 스마트팜에서 이론교육만 하는 것은 무의미하다.",
      "content_length": 454
    },
    {
      "id": "223111630068",
      "title": "2023.05.24 : 청양 수현 농장 가변형 입식 재배 시설 견학",
      "date": "2023. 5. 25. 16:34",
      "content": "맘꽃가든의 파트너 농장으로서 활동하고 계시는 청양 수현 농장 가변형 입식 재배 시설 견학을 다녀왔다. 기존의 버섯 재배사를 약 3개월 정도의 작업 기간 동안에 이렇게 완벽하게 가변형 입식 재배 시설로 변화시키셨다. 현재 몇 가지 개선 사항이 있지만 상추 재배 및 수확에 큰 제약은 없었다고 하신다. 농장주 사모님께서는 기존 토경재배의 기술을 그대로 유지하면서도 \"서서\" 작업하니깐 일을 마치고 나면 이전보다 훨씬 몸이 가볍다고 하신다. ^^; 맘꽃가든이 개발하고자 했던 기술의 장점이 나타나는 것 같아서 진심으로 감사를 드린다.\n추가로 노지 바닥에 가변형 베드를 설치해서 상추 재배 테스트도 진행하고 계신다고 한다. 기존 버섯 재배사에서 사용했던 자재를 최대한 재활용하여 베드 프레임을 만들고 가변형 포트만 구매하셔서 구성을 하셨는데, 그 열정에 항상 배움을 느낀다.\n그리고 수확량 및 재배 현황을 비교하기 위해 기존 노지 재배 포장은 일부 남겨두셨다고 한다. 이를 통해 재배상의 문제점 및 개선 사항을 지속적으로 찾으려고 하신다.\n그리고 이번에 새롭게 구축하신 양액 시스템... 구축 비용은 1,???만원 정도 발생했다고 하시는데, 고품질 상추 재배를 위한 노력을 끊임없이 하고 계신다.\n이날 재배 시설 견학에는 청양군 농업, 농협, 한국생산기술연구원 박사님을 포함한 여러분이 참여를 하셨는데, 수현농장 농장주 님의 노력에 다들 격려를 보내셨다.",
      "content_length": 698
    },
    {
      "id": "223109254712",
      "title": "2023.05.22 : 모바일 앱 반응형 화면 개발",
      "date": "2023. 5. 23. 8:00",
      "content": "Flutter 기반의 스마트팜 모바일 앱을 출시해서 일반 사용자 대상으로 슬라워 설치를 진행하고 있다. 사용자가 늘어나면서 대상 기종 중에 일부 화면이 깨지는 현상이 발생하였다. 반응형 화면을 개발해서 거의 모든 모바일 기기에 잘 적용이 될 거라고 생각했는데, 갤럭시 S21 기종에서 아래와 같이 센서 항목이 제대로 로딩되지 않았다.\n사무실에 돌아와서 직원들과 해당 문제가 왜 발생했는지에 대한 원인을 찾고 있다. android studio에서 S21 emulator (화면폭, 해상도) 설정해서 로딩했는데, 똑같은 형상이 발생되지 않는다. 다행히 반응형 화면 설정에서 문제 원인 및 해결 방안에 대한 실마리를 찾았지만, 테스트 해보고 다시 업데이트 하는 과정을 거쳐야 한다. 이렇게 스마트팜 개발은 농업, IT, 사용자, 센서, 구동기 특성 등 검토해야 할 사항이 많다. 그래도 끈기있게 진행하리라. 왜냐하면 맘꽃가든의 미래를 기다리는 농민들이 있기에....",
      "content_length": 481
    },
    {
      "id": "223107557139",
      "title": "2023.05.20 : 제주 감귤 연구회 스마트팜 실습 교육",
      "date": "2023. 5. 21. 7:50",
      "content": "제주 감귤 연구회 농가를 대상으로 한 스마트팜 실습 교육을 토요일 저녁에 실시하였다. 기존의 스마트팜 교육이 모두 이론 위주의 교육이 대부분이라 농업 현장에서 직접 적용할 수 있는 실습 교육 프로그램을 만들기 위한 노력을 진행하고 있다.\n멀리 대정이나 성산에서 오신 분들도 많이 있고, 열정적으로 농장을 운영하고 계시는 여성 농민분들도 계셨다. 직접 시설하우스 운영에 참여하고 스마트팜을 도입하고 계셔서 대단함을 느끼고 있다.\n좀 더 심화된 내용을 얘기하기 위해 스마트팜 국가 표준에서 정의하고 있는 구동기, 센서의 특징에 대한 설명을 하였다. 특히 구동기는 스위치형, 개폐기형으로 구분되며, 농업용 센서는 아날로그와 디지털로 나뉘는데 요즈음 대부분 RS-485, SDI-12, I2C 통신 등의 디지털 센서가 많음을 설명드렸다. 또한 농장 내의 WIFI 망 구성, CCTV 구성 등에 대한 실질적인 농업현장에서 적용 방안에 대한 교육을 진행하였다.\n그리고 클라우드 스마트팜 시스템 내에서 내 농장의 구동기와 센서가 어떻게 등록되고 관리되어야 하는지에 대한 설명도 진행하였다.\n현장 실습을 위해서 제작한 실습용 제어함과 센서 측정함을 가지고 전자 밸브 구동 시연을 위해서 전자 밸브 선을 분리해서 연결하고 직접 구동을 시연하였다.\n그리고 스위치형 구동기 시연은 별도 펌프 구동이 교육장에서 힘든 관계로 경광등 램프로 대체해서 진행하였다.",
      "content_length": 692
    },
    {
      "id": "223091291986",
      "title": "2023.05.01 : 빅데이터 수집 장치 이전 설치",
      "date": "2023. 5. 2. 15:07",
      "content": "2022년에 제주농업기술원 공동연구를 위해서 설치했던 빅데이터 수집 장치 농가 2곳을 다른 농가로 이전 설치하기로 하였다. 5월 1일 근로자의 날, 직원들은 휴무라서, 대표가 직접 현장에 나가서 김동균 연구사와 함께 하우스 기둥에 매달려서 작업을 하였다. 5월 1일 근로자의 날에 쉴 수 없는 사람은 업체 사장이랑 공무원들 밖에 없다는 위안의 말을 서로 나누면서 작업을 수행하였다.\n시설하우스 면적이 넓어서 IPTIME RING WIFI 확장기를 농업용 창고 시설 상부에 설치하였다.\n토양센서도 이전 설치할 곳에 20cm 정도 깊이로 파서 설치 작업을 수행하였다.\n센서와 데이터 로거에 연결하고 작업을 완료하였다.",
      "content_length": 343
    },
    {
      "id": "223091290559",
      "title": "2023.04.30 : 탑그린 상추 6,300주 파종 실시",
      "date": "2023. 5. 2. 15:06",
      "content": "여름 상추 재배 위해서 105구 육묘포트 60개 파종을 실시했다. 총 수량은 6,300주 정도 파종이 되었는데, 이전 파종 물량과 합치면 12,600주 정도 파종을 실시했다. 전체 시설 면적 기준으로 1/3 정도 상추 물량 파종이 완료되었다. 이제 잘 육묘해서 재배하면 된다. 그게 제일 어렵지만..",
      "content_length": 167
    },
    {
      "id": "223106512326",
      "title": "2023.05.19 : 제주중앙중학교 학생 진로 체험 방문",
      "date": "2023. 5. 19. 16:56",
      "content": "",
      "content_length": 0
    },
    {
      "id": "223103339707",
      "title": "2023.05.10 : 스마트 농업 연구회 소속 농촌지도사 방문",
      "date": "2023. 5. 16. 10:37",
      "content": "제주농업기술원의 추천으로 전국 단위 농업기술센터 소속 농촌지도사 연구 모임 중에서 \"스마트농업 전문 지도 연구회\" 소속 지도사 분들이 맘꽃가든을 방문하셨다. 많은 인원이 한꺼번에 방문하시는 자리라서 어떻게 설명을 드려야 할 지 몰라서 걱정을 했는데, 다들 농업 현장에서 근무하시는 분들이라 스마트팜 기술 개발의 개선 방향이나 농민들에게 보급할 수 있는 방안에 대해서 대화를 나눌 수 있는 자리였다. 무엇보다도 기술과 현장 적용에 있어서 차이가 아직 많음을 같이 공감하는 자리였다고 할 것이다. 그래도 이렇게 많은 전문가들이 스마트 농업 기술 보급에 함께 하고 있음을 희망을 느낀다.\n가변형 입식 재배 구조에 대해서 설명드리고 한번 테스트 해 보면서 무게에 비해서 사람 손으로 쉽게 움직여서 놀랍다고 하셨다.\n그리고 현재 여름 상추 재배를 위해서 준비 중인 재배 시설에 대해서 설명 드리고 의견을 나누는 시간을 가졌다. 이렇게 많은 곳에서 찾아와 주시고 맘꽃가든이 제주도를 대표하는 스마트팜으로 서서히 자리를 잡아가는 것 같아서 희망을 느끼는 하루였다.",
      "content_length": 532
    },
    {
      "id": "223102293754",
      "title": "2023.05.14 : 스마트팜 슬라워 농가 설치 진행 중",
      "date": "2023. 5. 15. 9:26",
      "content": "슬라워 시스템을 통해서 환풍기, 순환팬 원격 제어도 되면서도 기존 수동 제어함도 작동되도록 제어함을 추가 설치하고 프로그램을 수정, 업데이트 진행 중... 기존의 환풍기 제어함이랑 순환팬 제어함이랑 구조가 달라서 기존 전기제어함 전환 스위치를 모듈마다 별도로 구성해서 연결함.\n그리고 제주 ICT 협동조합 농가에 설치한 토양수분장력센서 데이터 취득을 확인하러 방문함.. WIFI 접속이 안된다. 다시 보드 점검을 실시해야 할 듯하다. 센서마다 인터페이스 방법이 달라서 확인해야 할 게 많다.",
      "content_length": 274
    },
    {
      "id": "223102287357",
      "title": "2023.05.13 : 청상추 재배 차광막 설치 55%",
      "date": "2023. 5. 15. 9:16",
      "content": "여름 상추 재배를 위해서 차광막 설치를 진행했다. 작물 재배에 차광막 사용은 35%, 55% 두 가지 종류가 사용된다. 이번에 두 가지 종류를 모두 주문해서 설치할 예정이다. 우선 하우스 두동에 55% 차광막을 설치했다. 하우스 가로장대 위로 걸치는 데 기존에 순환팬 작동을 위해서 VCTF 전선을 케이블 타이로 고정한 게 걸려서 다시 전선을 파이프 하단으로 옮기고 케이블 타이도 다시 고정했다.\n하우스 가로 장대 위로 차광막을 한 줄씩 땡기면서 설치했다. 다행히 차광막 무게가 가벼워서 2m 간격으로 놓여진 가로장대 사이로 처지는 문제는 크게 없었다.\n이제 상추 모종 파종오 거의 20,000주 진행되었고 순서대로 정식하는 작업을 진행하고자 한다.\n관주용 비료도 미리 정량을 1차 희석해 두었다. 색깔이 맘에 든다..",
      "content_length": 402
    },
    {
      "id": "223067664007",
      "title": "2023.04.07 : 스마트팜 보급 사업 설치 제어함 조립",
      "date": "2023. 4. 7. 13:24",
      "content": "스마트팜 연구회 회원 농가에 설치하기 위한 시설 통합 제어함, 관수 제어함, 시설 환경 측정함, 일사조도 측정함 등을 제작하고 있다.\n시설 하우스 내부를 측정하고, 제어하는 것도 중요하지만 기존에 설치된 아래의 제어함들과 연동하기 위해서는 별도의 스위치 전환이 필요하다. 현재의 스마트팜 기술 보다는 기존에 제어했던 방식을 사용할 경우도 많기 때문이다.\n그래서 시설통합제어함에 기존 시설함 제어와 연동, 전환될 수 있도록 스위치를 설치하고 있다. 그래서 농민이 필요에 따라서 전환, 사용할 수 있게 하기 위해서다.\n그리고 이번에 특별히 제주농업기술원 의뢰로 일사량 측정용 RS 485통신 기반의 Apogee SQ-522 제품을 구입해서 설치할 예정이다. 아래 제품의 그늘이 진 영역까지 일사량 측정이 가능한 제품이라고 한다.\n시설하우스 내부에 그늘이 지거나, 작물 수형 (잎 분포)에 따른 생육 상태를 확인하기 위해서 테스트를 진행할 예정이다. 기존 SP-110 제품 보다는 뛰어난 제품으로 확인되므로 현장 설치해서 검증할 예정이다.",
      "content_length": 522
    },
    {
      "id": "223065196237",
      "title": "2023.04.04 : 토양수분장력센서 애월 키위 농가 3개소 추가 설치",
      "date": "2023. 4. 5. 6:30",
      "content": "제주농업기술원에서 진행하고 있는 토양환경 빅데이터 수집 연구를 위해 애월 키위 농가 3개소에 총 6개의 토양 수분 장력 센서를 설치 진행 중이다. 지난 주에 1개소에 설치를 완료하고 데이터 수집이 정상적으로 이루어 지는 것을 확인한 뒤, 이번에 추가로 애월 키위 농가 2개소에 추가 설치하였다. 센서는 기본적으로 매 개소마다 2개씩 설치해야 하므로 환경 측정 보드에 2개의 센서 데이터 취득이 가능하도록 하였다. 그리고 예비 측정 기간동안 알게 되었던, 대기압 보정 알고리즘을 추가 적용하였다.\n제주농업기술원 연구사 및 직원들과 설치 위치를 정하고 땅을 파는 작업을 진행하고 있다. 토양 수분 장력 센서의 신뢰성을 확보하기 위해서 기존의 수동으로 측정했던 지점과 가까운 곳에 TEROS 32 토양 수분 장력 센서를 설치했다.\n고가의 센서 파손을 위해서 센서 위치에 추가로 노란색 고추 지지대를 추가 설치해야겠다. 추후 재 방문시 표시를 할 필요가 있을 것 같다.",
      "content_length": 482
    },
    {
      "id": "223063011187",
      "title": "2023.03.31 : 스마트팜 데이터 수집 장치 주문 제작",
      "date": "2023. 4. 3. 6:14",
      "content": "스마트팜 장치 보급 사업체 및 장비로 등록되면서 스마트팜 데이터 수집 장치 및 제어 장치에 대한 제작 주문이 계속 들어오고 있다. 특히 이번에는 스마트팜 보급 사업 선정 농가에 통합 제어 모듈까지 함께 납품해야 한다. 제주농업기술원에서도 일사량 및 조도 센서 측정 관련 데이터 수집 의뢰가 있어서 두 대의 데이터 수집 장치를 제작하게 되었다. 지금까지 농업용 센서의 데이터 수집 방법을 거의 다 분석해서 이제 웬만한 센서는 그냥 연결해서 데이터 수집 및 조회가 가능하다.\n그리고 이번에 알람과 장치 작동 이력을 조회할 수 있는 기능을 슬라워 앱에 적용, 배포하였다. 사용자가 늘어나면서 기능 개발 요구가 늘어나고 있다. 스마트팜은 소프트웨어 기술이 제일 중요하다.",
      "content_length": 371
    },
    {
      "id": "223088734118",
      "title": "2023.04.29 : 여름 상추 38,000주 중에서 1,300주 정식 시작",
      "date": "2023. 4. 29. 18:42",
      "content": "주말 비오는 날씨에 정식을 시작하다.. 정식은 흐린 날이 제일 좋다. 스마트팜 설치하러 다닌다고 정식 시기를 놓쳤다. TT; 일이 너무 많다. 그래도 할일은 해야 되니깐 여름 상추 재배 위해 38,000주 중에서 1,300주 정도를 심었다. 웃자란 묘종을 정리하는 데 시간이 더 많이 걸렸다. TT; 그래도 농사는 꾸준히 하다보면 된다. 포기는 하지 말고... ^^;",
      "content_length": 205
    },
    {
      "id": "223084909083",
      "title": "2023.04.25 : 제주ICT협동조합 농가 토양 수분 장력 센서 설치",
      "date": "2023. 4. 25. 19:25",
      "content": "하루종일 비가 오는데 제주 ICT 협동조합 소속 5개 농가에 대한 토양 수분 장력 센서 설치 작업을 수행하였다. 오전에 먼저 제주ICT 협동조합 교육장에서 회원 농가 대상으로 시설 환경 측정 방법 강의를 수행하였다. 오랜 기간동안 같이 스마트팜 연구를 했던 청년 농업인들이기에 시스템의 구조 및 데이터 취득 방법을 쉽게 설명할 수 있었고 제주 스마트팜의 발전 방향에 대해서 뜻깊은 대화의 시간을 가질 수 있었다. 무엇보다도 현재의 농업 실정에 맞지 않는 스마트팜 기술 개발 및 보급 사업의 문제점을 얘기하고 이에 대한 개선 방향을 얘기하는 시간이 많았다. 같이 농사짓는 사람으로서 스마트팜의 진정한 접근 방법을 찾아갈 수 있는 좋은 동반자들을 만난 기분이다.\n그리고 자문 교수님으로 제주농업마이스터 대학의 김찬우 교수님께서 참여해 주셨는데, 어느 농민 단체의 스마트팜 기술 교육 수준보다 높다는 칭찬도 해주시고 향후 기술 개발 방향도 제시해 주셔서 뜻깊은 대화를 나눌 수 있었다.\n이번에 선정된 회원 농가는 천혜향을 재배하는 농가로서 포장에서 특정 수목을 선정하고 토양 수분 장력 센서를 설치한 뒤 해당 측정값을 확인하였다.",
      "content_length": 573
    },
    {
      "id": "223083309224",
      "title": "2023.04.24 : 동부 디지털 농업 연구회 농가 버마드 50A 관수 제어 밸브 설치",
      "date": "2023. 4. 24. 8:23",
      "content": "동부 디지털농업 연구회 회원 농가에 50A 관수 제어 밸브를 설치하기 위해서 일요일 오후에 방문하였다. 700평 규모의 하우스에 여러 스마트팜 장치와 CCTV 8대를 설치하고 있는 중이다. 우선 WIFI 통신 및 CCTV 설치 위해서 관련 통신선, 전원선 등을 사무실과 연결하는 작업을 농장주와 함께 작업을 실시하였다. 이 농가는 제주도에서 최초로 3중으로 하우스를 지었는데, 사무실과 농장 사이에 통신 및 전원을 위한 CD관 매설 작업을 하지 않아서 여러 케이블을 재설치하는데 시간이 오래 걸렸다.\n그리고 오늘 작업의 핵심은 버마드 50A 전자밸브를 설치하는 것이다. 아래의 수동 밸브 앞쪽에 전자밸브를 설치해서 제어하고자 한다.\n설치하기 전에 기존의 관에 있던 물 빼기 작업을 실시하였다. 농장주가 관수 시설 설치에 경험이 많아서 많은 도움이 되었다. 농사를 짓는데 있어서 작물을 잘 아는 것도 중요하지만, 이제 농민은 백공이 되어야 한다.\n기존 관에 연결하기 위해서 스텐 50A 부싱을 설치하였는데, 플라스틱 나사선과 맞지 않아서 플라스틱 연결 부싱으로 교체를 하고 있다. 그랬는데도 물이 샌다... ^^; 항상 연결 작업이 완료되고 나서, 구동을 하게 되면 1군데 이상은 물이 샌다. 한번에 완벽하게 되는 경우도 드물다. 다행히 농장주도 똑같은 경험을 가지고 있어서, 연결 이후 테스트를 반복하면서 물이 새는 곳을 잡았다.\n연결이 완료되었다. 이제 제어 시스템과 펌프를 연결해서 밸브를 제어하는 작업을 진행할 예정이다. 펌프가 보통 5마력이상이라서, 밸브 제어와 연동시 타이밍을 잡기가 힘든 부분이 있다. 이 또한 하나씩 해결해 나갈 예정이다.",
      "content_length": 812
    },
    {
      "id": "223079510090",
      "title": "2023.04.19 : 동부 디지털 농업 연구회 농가 설치",
      "date": "2023. 4. 19. 19:21",
      "content": "동부 디지털 농업 연구회 소속 농가 회원 중에서 가장 젊은 청년 농업인 하우스에 맘꽃가든에서 개발한 슬라워 시스템을 설치하기로 하였다. 그래서 우선 통합제어함을 비롯한 기초적인 스마트팜 장치들을 오늘 설치하기로 하고 방문하였다.\n기존 제어함을 유지하면서 스마트팜 설치를 하고자해서 기존 설비가 모여있는 곳에 통합 제어함을 설치하고자 C형 거치대를 조립하고 있다.\n시설환경측정 센서 및 CCTV 설치를 위해서 하우스 중간에 WIFI 확장기를 설치했다.\n그리고 메인 전원함에 낙뢰방지기를 설치했다.\n기존 관수 펌프 제어함에 열동형 계전기를 추가 설치하고 추후 관수 제어함과 연동할 예정이다.\n이제 기본적인 함을 설치했고, 하나씩 기존 제어 시스템과 연계 작업을 실시하기로 하고, 농장주와 기술적인 협의를 진행하였다. 스마트팜 설치에 있어서 개발 업체의 능력도 중요하지만, 결국 사용자인 농장주가 어떻게 농장을 운영할 건지, 작물 재배는 어떻게 진행할건지, 기존 장치 운영과 호환은 어떻게 할건지 등.. 긴 시간을 두고 하나씩 하나씩 진행하고자 한다. 농장 10개를 설치하는게 중요한 게 아니라, 하나의 농장이라도 잘 운영되는 것이 가장 중요하다. 스마트팜을 도입한 농장주와 함께 연구하고 성장할 수 있도록 계속 노력해야 할 것이다.",
      "content_length": 631
    },
    {
      "id": "223076763438",
      "title": "2023.04.16 : 관수 제어 밸브 및 점적테이프 새들 설치",
      "date": "2023. 4. 17. 8:34",
      "content": "확장된 입식 재배 시설의 관수 제어를 위해서 전자밸브와 점적 테이프 새들을 설치하였다. 주중에는 스마트팜 관련 업무 때문에 농장에서 작업할 시간이 없어서 주말에 관수 부품을 준비해서 제어 밸브를 설치했다. PE관은 25A 기준으로 설치했다.\n버마드 전자밸브.. 25A 기준이고 12VAC에 의해서 작동되는 릴레이 제어방식 모듈이다. 맘꽃가든은 총 21개 구역이 있기 때문에 구역별 관수 전자밸브만 21개가 배치된다. 이를 순차적으로 제어하는 프로그램을 작물 생육 과정을 지켜보면서 개선해 가고 있다. 가장 힘든 일이 지속적으로 관수 스케쥴 알고리즘을 개선해 가는 과정이다. 많은 사람들이 전문가 인것처럼, 이런 저런 정보 예를 들어, 양액 상태, 배액 상태, 배지 상태, 온습도 상관관계, 공공 기상 데이터를 연계, 작물 재배 특성,,, 모든 정보를 기반으로 최적화된 관수 스케쥴을 만들어야 한다고 하지만, 이를 구현하는 것은 오랜 시간이 걸리는 노력이 필요할 것이다. 그래도 이런 노력을 인정해서 격려해 주시는 분들이 많아서 요즈음 힘이 많이 생긴다.\n전자 밸브를 연결한 모습이다. 차주에 12VAC 선을 연결하면 관수 제어가 완료될 것 같다.\n그리고 25A PE관에서 13 점석 호스로 연결하는 새들을 설치하였다.\n이제 새들에 13A 점적 호스를 연결하였다. 차주에 점적테이프까지 연결하면 여름상추 재배 준비가 어느 정도 마무리 될 수 있을 것 같다.",
      "content_length": 702
    },
    {
      "id": "223074222258",
      "title": "2023.04.13 : 한국생산기술연구원 파트너 기업 선정 및 제주 감귤 연구회 스마트팜 강의 참석",
      "date": "2023. 4. 14. 10:48",
      "content": "가변형 입식 재배 시설 및 클라우드형 스마트팜을 개발하면서 기술 자문을 해 주셨던 한국생산기술연구원에서 성장 가능성이 높은 기업으로서 맘꽃가든을 파트너 기업으로 선정해 주셨다. 스타트업 업체로서 기술 개발을 독자적으로 진행하는데, 어려움이 있을 때마다 공공 기관의 지원을 받을 수 있는 것이 큰 도움이 된다. 올 한해도 포기하지 않고 끊임없이 입식 재배 기술 및 클라우드형 스마트팜을 지속적으로 개발해 나가야 겠다.\n그리고 제주도 최대 연구회 단체인 감귤연구회의 2023년 정기 강의가 서귀포 감귤 연구소에서 개최되었는데, 스마트팜 관련 강사로 참석하게 되었다. 감귤 분야에 베테랑 분들을 대상으로 하는 강의라서 긴장을 했는데, 다들 농사에 진심인 분들이라 좋은 대화를 많이 나눌 수 있었다. 특히 현재의 고령화된 농업 현실을 스마트팜으로 다 해결할 수 있을지,,,, 농장마다의 재배 시설, 작물 현황이 다 다른데, 스마트팜이 다 커버할 수 있을지 등에 대해서 편하게 의논할 수 있는 자리였다. 무엇보다도 스마트팜의 기대치가 맞춰가고 있다는 느낌도 들었다. 이렇게 농업 현장에서 직접 작업하는 농민을 만남으로서 스마트팜 기술 개발의 방향을 결정하는 것이 무엇보다도 필요하다고 생각된다.",
      "content_length": 607
    },
    {
      "id": "223072024462",
      "title": "2023.04.11 : 충남 청양 가변형 입식 베드 설치 현황",
      "date": "2023. 4. 12. 8:04",
      "content": "충남 청양의 한 농가에 가변형 입식 재배 베드를 설치하기로 계약을 하고 설치 진행 현황을 확인하기 위해 방문을 했다. 해당 농가에서는 기존 토경 재배 시설을 입식으로 전환하고자 진행 중에 있으며, 재배 시설이 잘 구축되면 주변 농가에도 보급하는 절차를 밟을 예정이다.\n기존 하우스 시설을 점차 변경할 예정이라고 하시는데, 잘 진행하실 수 있도록 도움을 드려야 할 것 같다.",
      "content_length": 208
    },
    {
      "id": "223039721991",
      "title": "2023.03.09 : 토양센서 입력 전압 보정 및 가변형 고설 베드 기자재 개발 협의",
      "date": "2023. 3. 9. 18:19",
      "content": "토양센서 데이터 측정값이 불안정해서 PCB 보드 개발을 협업하고 있는 하이브리드 정밀 대표님께 자문을 구하고자 또다시 육지 출장을 가게 되었다. 약 2시간에 걸쳐서 문제 원인을 찾아내니, 입력 신호 전압에 추가 보정이 필요함을 확인했다. 간단하게 추가 회로를 구성하고 재 테스트 하니 정상적으로 신호값 수신 완료... 문제 해결!!!!! 역쉬 전문가의 경륜은 어떠한 것으로도 대체될 수 없다. ㅎㅎ\n그리고 오후에는 하우스 시설 자재 생산업체인 만성코프레이션을 방문해서 가변형 고설베드 관련해서 신규 부품 개발/제작 방안을 협의하였다. 두분다 전문 분야에 베테랑 분들이신데 귀중한 시간을 내어주셔서 감사함을 느낀다!!!!!!",
      "content_length": 348
    },
    {
      "id": "223038499017",
      "title": "2023.03.08 : 2023년 스마트팜 전문가 교육 과정 기자재 납품(샛별 한라봉 농장)",
      "date": "2023. 3. 8. 15:19",
      "content": "2021년 대한민국 최고 농업기술 명인(과수 감귤 분야) 이신 김종우 회장님께서 추진하고 계시는 스마트팜 전문가 육성 사업에 맘꽃가든 슬라워 제품을 현장 실습 교육 기자재로 납품하게 되었다. 총 10차수 (현직 농업인 7차수, 청년 농업인 3차수)에 걸친 스마트팜 전문가 육성 교육 프로그램이 2023년 한해동안 샛별 한라봉 농장에서 진행될 예정이다. 이번 교육에서는 이론 교육 보다는 실습 교육의 비중이 높아서 현장에서 직접 스마트팜 기자재를 작동해 보면서 스마트팜 구성 원리를 이해할 수 있도록 운영할 예정이다. 이때 사용될 교육 장비로 슬라워 제품이 선정되어 이번에 납품을 하게 되었다.\n회장님께 슬라워 제품 구성 및 장치, 센서 등록 과정을 설명드리고 있다.\n장치 제어용 시스템의 하드웨어 구성을 설명드리고 있다. 감귤 명인으로서 최고의 자리에 있으면서도 젊은 농업인 육성을 위해서 열정적으로 활동하시는 모습에 많은 것을 배우게 된다. 배움에는 정년이 없다!!!!!",
      "content_length": 488
    },
    {
      "id": "223036665537",
      "title": "2023.03.06 : 공공기상데이터 기반 공기순환팬 저전력화 현장 실증 점검",
      "date": "2023. 3. 6. 20:01",
      "content": "공기순환팬 저전력화 시스템 외부 자문 전문가이신 제주대학교 풍력대학원 양경부 교수님과 제주농업기술원 원종장 운찬일 연구사님을 모시고 공기순환팬 저전력화 시스템 현장 실증 점검을 수행했다. 현재 맘꽃가든에서는 거의 한달 가까이 시스템 운영이 되고 있고 다른 5개 실증 농장은 구동한지 1주일 정도되는데, 이에 대한 전문가 두분을 모시고 현장 점검을 진행했다. 알고리즘 개발 이전의 공공기상데이터 및 공기순환팬 성능 평가 방법은 A, B, C, D 4단계에 걸쳐서 진행되었다.\n(1) A 단계 : 공공기상대 vs 사설기상대 신뢰성 분석\n(2) B 단계 : 공공기상대 vs 시설하우스 내부 신뢰성 분석\n(3) C 단계 : 동일 지역 내 시설하우스 간 공기순환팬 구동 여부에 따른 과도한 운영 요소 추출(강우, 바람, 고온기, 천측창 개폐)\n(4) D 단계 : 맘꽃가든 내부 실증 구역 간의 공기순환팬 가중치 분석\n이러한 4단계에 걸친 분석 결과에 대해서 말씀드리고, 현재 실증 농가에서 취득되고 있는 운영 정보를 실시간으로 조회해서 확인을 하였다.\n특히 운영 결과에 따라서 사용자 개선 요구사항으로 운영 시간 제어 세밀화 방안, 천측창 개폐 정보 연동, 작물 성장에 가장 많은 영향을 주는 일출 전후 일사량 정보 연동 방안 등의 개선점에 대해서 논의할 수 있는 자리가 되었다.\n사무실에서 데이터 검증이 끝난 이후에 맘꽃가든 농장으로 이동해서 저전력화 시스템의 실시간 알고리즘 업데이트 및 장치 작동여부를 확인하고 저전력화에 따른 효과를 확인하였다.\n그리고 콩깍지농원을 방문해서 저전력화 시스템 구동 현황을 검정하는 시간을 가졌다. 현재까지 1주일 정도 작동하는 과정에서 하드웨어적인 오류(장치 작동 중단), 서비스 오류 등은 발생하지 않았지만 지속적으로 모니터링 할 예정이다. 이러한 기술을 추후 농가에 많이 보급할 수 있도록 할 예정이다.",
      "content_length": 915
    },
    {
      "id": "223035272502",
      "title": "2023.03.04 : 청양 지역 농가 입식재배 포트 납품 계약 협의 방문",
      "date": "2023. 3. 5. 13:48",
      "content": "드디어 충북 청양 농가에 입식 재배 시설과 포트를 납품하고 대리점 계약을 하기 위해 청양에 방문을 하였다. 기존에 버섯 재배 시설의 일부를 입식 재배 시설로 변경하기 위한 테스트 베드를 설치하기로 하고 직접 현장을 방문했다. 폭은 12m 정도 인데, 여기에 가변형 고설 베드를 설치해서 시설면적대비 재배면적 최대효과를 검증할 예정이다. 이러한 실증 작업이 완료되면 주변 농가를 대상으로 보급, 확산하는 과정을 진행하고자 한다.\n1800평 규모의 농장 중 일부는 이미 토경 기반 상추 재배를 하고 계시는데, 위의 테스트 베드가 실증이 완료되면 토경 하우스도 입식 재배 시설로 변경할 예정이다.\n그리고 납품된 포트의 일부가 농장의 마당에 놓여 있다. 가변형 고설 베드가 완료되면 다구형 포트가 베드위에 놓여져 입식 재배가 시작될 것이다.\n그리고 청양 지역의 또다른 토경 기반 상추 농가를 방문하였다. 이 농가는 단동형 10개의 하우스를 운영하고 계시는데, 2022년 한해동안 잘 설치되고 운영되면 내년부터 입식 재배 시설로 전환할 예정이다. 농업 현장에서 이렇게 진취적인 분들을 뵙고, 농업의 미래를 얘기할 수 있어서 너무 좋았다. 스마트팜은 작물 재배, 재배 시설, 시설 제어가 함께 되어야 한다.",
      "content_length": 613
    },
    {
      "id": "223034232460",
      "title": "2023.03.04 : 경기도농업기술원 & 병해충 발생 예측 모델 개발 업체 방문",
      "date": "2023. 3. 4. 7:18",
      "content": "2023년에 맘꽃가든이 개발해 왔던 입식재배 시스템과 클라우드 스마트팜이 인정을 받으면서 해야할 일들이 많이 생겼다. 그래서 스마트팜 시스템 개선 및 향후 개발 방향을 확인할 겸해서 직원들과 함께 경기도 농업기술원과 스마트팜 예측모델 개발 업체를 방문했다. 먼저 병해충 발생 예찰/예측 모델을 개발하는 (주)에피넷을 방문해서 주요 시스템 개발 현황 및 기술 협의를 진행하였다. 특히 경기도농업기술원 통합 모니터링 시스템의 유지/보수를 담당하고 있어서 이에 대한 현황도 확인할 수 있었다.\n경기도농업기술원 시스템과 유사한 화성시 농업기술센터 스마트팜 시스템의 대쉬보드를 확인했다.\n그리고 직접 경기도농업기술원의 스마트팜 현장지원센터를 방문해서 2017년에 개발해서 현재까지 운영되고 있는 경기도 스마트팜 통합 관리 시스템을 보게 되었다. 엔지니어 출신이신 연구사님의 현재 개발 현황, 유지보수, 개선 방향 등에 대한 자세한 얘기를 듣고 많은 현실적인 얘기를 나눌 수 있었다. 스마트팜의 개발 방향은 이제 데이터 수집, 모니터링을 넘어서 이를 활용한 작물 생육 모델과 연동되도록 해야 한다. 이를 위해서 작물 재배, 재배 시설, 시설 제어가 연동되어 이를 종합적으로 연구 개발해야 가능함을 느끼는 하루였다.",
      "content_length": 617
    },
    {
      "id": "223061274143",
      "title": "2023.03.31 : 고설베드 상토 배치",
      "date": "2023. 3. 31. 22:02",
      "content": "다구형 포트 설치를 완료하고 고설 베드 위에 상토를 배치하다. 제품은 뚝심이... 가격은 좀 비싼데, 일단 구입해 둔 것이라 일단 배치해 두다. 상토는 보통 50리터 기준인데, 추가로 사는 상토는 다른 제품으로 충진할 예정이다. 기존에 구입해 둔 펄라이트도 10포대 정도 있는데, 같이 섞어서 사용하고자 한다.\n상토를 채우고 나면 점적 테이프를 깔기 위해서 10cm간격의 그린드립 1000m 제품을 구입했다. 스마트팜 설치 문의도 많은데, 상추 재배까지 하려니깐 시간에 쫓기는 날들의 연속이지만 하루하루 최선을 다하고자 한다.",
      "content_length": 294
    },
    {
      "id": "223058119197",
      "title": "2023.03.24 : 한국농업기술진흥원 기술융복합 현장 심사 방문",
      "date": "2023. 3. 28. 18:39",
      "content": "3월 초에 한국농업기술진흥원에서 추진하는 기술융복합 현장 지원 사업에 신청하여, 1차 서류 심사, 2차 대면 발표를 통과하고 3차 현장 실사를 하게 되었다. 제주농업기술원에서 해당 기관으로 부터 홍보 메일을 받고 맘꽃가든이 참여하면 좋을 것 같다고 연락이 와서 사업 참여 신청을 하게 되었는데, 뜻하지 않게 3차 심사까지 가게 되어서 긴장된 맘으로 현장 심사를 받았다. 전국 단위로 3개 사업만 선정하는 사업이라 경쟁이 치열하다고 생각했는데, 3차 심사까지 가게 된 것만 해도 맘꽃가든이 가진 기술을 인정받은 것이라 생각한다. 그리고 스마트팜 연구회 회원분들도 현장 심사에 참여해 주셔서 든든한 맘으로 심사관들에게 우리가 가진 기술을 보여드렸다.\n심사 과정에서 우선 기 제출한 사업계획서와 현장 상황을 대조하는 평가를 진행했다. 처음으로 신청하는 지원 사업이라서 현장 실증 평가 방법 및 준비 사항 등에 대해서 심사관들이 부족한 부분들을 지적해서 한동안 진땀을 흘렸다.\n그리고 맘꽃가든 재배 시설을 직접 확인하고 기술융복합 사업 지원 실현 여부를 확인하였다.\n그리고 마지막으로 맘꽃가든이 개발한 스마트팜 환경 측정 및 제어 시스템에 대한 시연을 진행하였다. 여기서는 반응이 너무 좋았다. 심사관들도 맘꽃가든이 지향하는 작물 재배와 스마트팜 기술 개발을 병행하는 것에 많은 격려를 받았다.\n긴장된 맘으로 평가결과를 기다리겠지만, 멀리 육지에서 맘꽃가든의 기술력을 확인하기 위해서 3명의 심사관이 방문한 것만 해도 좋은 경험이라 생각한다.",
      "content_length": 747
    },
    {
      "id": "223055705519",
      "title": "2023.03.25 : 남자가 80세까지 상추 재배하는 맘꽃가든",
      "date": "2023. 3. 26. 6:58",
      "content": "봄 기운이 완연해 지면서 노지에서는 양파/마늘 작업이 한창이다. 외국인 노동자 몸값도 올라가고 인력사무소 반장한테 사람 구하는 것도 쉽지가 않다. 오늘 점심을 먹고 하우스로 돌아가는 길에 양파밭에 인력사무소에 오신 분들이 열심히 검질(잡초)을 메고 계신다. 내 주변의 어머니,아버지, 삼촌뻘 되시는 분들이시다. 제주도 분들은 워낙 부지런해서 거의 쉬는 분들이 없어서 이렇게 알바를 다니시는 분들이 많다. 가끔식 장모님도 이렇게 당근수확이나 키위 수분작업등에 다녀오시곤 했다. 하지만 다녀오시면 며칠동안 다리, 어깨, 허리가 아프셔서 병원을 더 많이 다니시게 된다. 아내랑 내가 가시지 말라고 해도, 가면 재미있다고 가셨는데, 최근에 크게 탈이 나셔서 이제는 가지 않고 계신다.\n이런 모습 때문에 농업 현장에 젊은 청년들이 유입되지 않는 이유일 것 이다.\n그래서 맘꽃가든이 가변형 입식 재배 베드를 만든 이유이다. 맘꽃가든에서는 남자들이 농사를 짓는다. 4명의 직원들이 프로그램 개발과 농사를 직접 함께 하고 있다. 이번주 금요일에는 이전에 심었던 로메인 상추 솎음 작업을 진행했다. 아마 위의 사진처럼 쪼그리고 앉아서 작업해야 한다면 다들 힘들어 했을 것이다.\n남자들도 80세까지 편하게 농사 지을 수 있는 환경을 만들기 위한 과정을 맘꽃가든은 묵묵히 수행하고 있다. 남들이 그건 아직 안된다고, 어떻게 될 수가 있냐고 하는 것들을 만들어 가고 있다. 그리고 하나씩 구현되고 있다. 아직 맘꽃가든이 젊은 농업 회사로 성장하는 것처럼, 농사도 젊은 남자가 잘 지어 성장할 수 있는 시대를 만들고자 한다.",
      "content_length": 784
    },
    {
      "id": "223052711090",
      "title": "2023.03.22 : TEROS32 토양센서 현장 설치",
      "date": "2023. 3. 22. 21:14",
      "content": "애월 키위 농가에 토양장력센서를 설치하러 갔다. 기존의 압력게이지 방식 대신에 디지털 측정이 가능한 TEROS32 센서를 현장에 설치하였다.\n기존 수동센서와 측정값을 비교하기 위해 가까운 지점에 동일한 깊이로 센서를 설치했다.\n그리고 환경데이터 수집 장치랑 연결해서 측정값을 확인했다...\n여기서 대반전이 있다. 스마트팜 연구회 회원 농가에서 급하게 전화 연락이 왔다. 봄 재배 준비로 트랙터로 밭을 갈았는데 기존에 설치했던 토양센서랑 수분장력계도 같이 갈아 버렸다고 하신다. ㅋㅋㅋㅋ 이전 다른 농가는 예초기로 잡초 제거하면서 토양센서 데이터선을 날려버렸다고 하셨는데, 이번에는 트랙터다... 스마트팜은 예상하지 못한 변수가 너무 많다. 너무 미안해 하시는 데 담에 스마트팜 연구회 지원 사업 생기면 교체해 드린다고 말씀드렸다. 토양센서 설치 위치 표시를 더 명확하게 해야할 듯 하다.\n토양센서의 삶과 죽음을 다 느끼는 하루였다.",
      "content_length": 465
    },
    {
      "id": "223051528757",
      "title": "2023.03.21 : 추대된 로메인 상추 정리",
      "date": "2023. 3. 21. 19:09",
      "content": "다구형포트에서 추대된 로메인 상추를 일렬로 쭉 뽑았다. 다행히 뿌리도 잘 뽑히고 서서 작업하는 것이라 그리 힘들지는 않았다.\n추대된 상추는 버리고 상토만 남겨둔 상태... 부족한 상토는 다시 보충하였다. 상토를 최대한 오랫동안 사용하고 싶은데 살균 처리 과정까지 고려해야 하기에 연구해야할 부분이 많다. 현재로서는 3회까지는 안정적임..\n상토를 보충한 후에 흑백 양면 비닐을 덮었다. 포트 간격에 맞는 유공비닐이 없어서 현재는 수작업으로 구멍을 내야하는데, 올해안에 유공비닐 제작 업체를 찾아서 계약 구매할 예정이다. 유공비닐까지 세팅이 되면 입식재배 관련 기자재는 거의 다 마련이 된 것 같다.",
      "content_length": 333
    },
    {
      "id": "223050416641",
      "title": "2023.03.20 : 로메인 상추 봄재배 성장 상태, 겨울 재배 추대",
      "date": "2023. 3. 20. 19:49",
      "content": "로메인 상추를 봄에 출하하려고 정식했던 베드의 로메인 상추가 자리를 잡아간다. 파란 상추만 보면 맘이 편안해 진다. 이렇게 건강하고 파란 상추만 보면 좋으려만.. ㅎㅎ\n베드의 맞은편에서는 약 5개월동안 나에게 기쁨을 줬던 상추가 추대되어서 정리를 앞두고 있다. 이렇게 상추도 자연의 섭리를 따라간다.\n맘꽃가든에서는 베드 구역별 재배 시기 조절이 가능해서 이렇게 두개의 상추가 공존하고 있다.\n그리고 지난 달에 파종했던 로메인 상추는 발아해서 조금씩 성장해 가고 있다. 베드별로 12달 연중 생산이 가능한 시스템을 만들기 위한 여정이 계속되고 있다.",
      "content_length": 306
    },
    {
      "id": "223032674451",
      "title": "2023.03.02 : 보온커튼 설치 및 제어 업체(대성테크) 미팅",
      "date": "2023. 3. 2. 17:40",
      "content": "동부자립형스마트팜 연구회 농가중에 보온커튼을 새로 설치한 농가에서 기존 보온커튼 제어함에 슬라워 시스템을 연동해서 제어하고자 하셔서 기존 보온커튼 설치 업체(대성테크) 사장님하고 미팅을 가졌다. 해당 농가는 총 16채널의 모터가 설치되어 있고 타이머 기반으로 일출 전후에 개방되고 일몰 이후에 닫히게 된다고 하신다. 특히 겨울에는 외부 개폐기와 상관없이 일출, 일몰 타이머 기준으로 완전 개폐되도록 작동되고, 여름에는 개폐량을 외부 개방된 경우가 많아서 일부만 개폐되는 기능을 만들었다고 하신다. 스마트팜 분야에 조회가 깊으신 대표님이라 우리가 개발하고 있는 슬라워 제품에 대해서도 많은 의견을 주셨다.\n타이머 기반으로 자동/수동 전환 스위치와 16개 채널 2 Level 스위치로 제어할 수 있도록 제어함이 구성되어 있다.\n그리고 별도로 퓨즈테스트 장치를 만들어서 농민들이 손쉽게 문제가 되는 퓨즈를 찾아서 교체할 수 있도록 만들어 놓으셨다. 아직 24V 변압기를 설치하지 않으셨다고 하시는데, 자세하게 구조 설명도 해주셨다.\n오늘 대성테크 사장님과 스마트팜 개발 과정에 대한 의견을 많이 나눴다. 보드 기반의 제어시스템이 농업현장에 적합한가? 농민들이 사용하기에는 단순한 전기 제어 장치 기반으로도 잘 작동되는 것이 중요하다는 말씀에 공감했다.\n이제 잘 준비해서 보온커튼 제어하는 것도 진행해야 한다. 사용자가 원할 때 MCU 보드 제어와 전기 제어 사이에서 원활하게 전환 제어되는 방법을 찾아야 한다.",
      "content_length": 730
    },
    {
      "id": "223048990001",
      "title": "2023.03.18 : 다구형 포트 배치 90% 완료, 점적테이프 & 상토 선택 문제",
      "date": "2023. 3. 19. 10:01",
      "content": "다구형 포트 배치가 90% 정도 진행되었다. 다행히 배치에 큰 문제가 없어서 올 여름 작기에 맞춰서 상추 재배가 진행될 수 있을 것 같다. 쉽지 않은 일이지만 포기하지 않으면 된다. 입식재배로 500평 38,000주 상추 심기는 이제 품질 확보 및 스마트팜 시스템 연동해서 운영될 수 있는지 테스트 하는 것으로 진행될 것 이다. 이제까지 테스트 과정에서 가장 문제가 된 것은 상토와 관수주기..\n작년까지는 아래 사진의 그린드립 제품을 사용해서 관수를 했는데, 1년이 지나니깐 터지는 곳이 여러 발생했다. 관리를 잘못한 부분도 있을 것이다.\n그래서 올해는 점적 간격이 좁은 수입 제품을 사용해 볼까 한다. 물론 가격이 문제다. 아직 관수 기자재 기술은 한국 제품이 부족한 부분이 많은 것 같다.\n그리고 상토는 뚝심이 제품을 사용했는데, 비싸다.. --;\n그래서 올해는 일부 베드 구역에 저렴한 상토를 사용해 보려고 한다. 농자재 가격이 너무 비싸다. 상추 가격도 비싸면 좋겠지만, 이번주 농협 공판장 상추 가격을 보면 한숨만 나온다. 지금부터 6월 초순까지는 상추 농사는 하지 않는게 이득이다. 상추 재배/수확 인건비가 더 많이 발생하기 때문이다. 적절한 상추 시기를 찾고 그에 맞는 재배법을 개발하는 것만큼 가격을 유지하는 게 필요하다. 언젠가 안정적인 재배 기술이 마련되면 적절한 상추 출하 시기를 조절하거나 유통/판매 경로를 개척하는 작업도 해야할 것 같다.\n농사는 사업이다!!! 그냥 할게 없어서 농사 짓는 시기는 이제 없다!!!!",
      "content_length": 748
    },
    {
      "id": "223046657678",
      "title": "2023.03.16 : 공기순환팬 테스트용 비닐 제거 및 토양 수분장력 측정 센서 측정함 제작",
      "date": "2023. 3. 16. 18:54",
      "content": "맘꽃가든 실증 농장에서 진행되었던 공기 순환팬 저전력화 테스트 작업이 완료되었다. 처음 연구 목적보다 높게 약 10% 이상 순환팬 가동 시간을 줄일 수 있다는 결과가 나왔다. 이제 결과 보고서 작성을 마무리할 때가 온 것 같다. 오전부터 심팀장과 하우스 기둥에 매달려서 스프링 패드에 걸려있는 비닐용 스프링을 제거했다. 설치할 때 보다 쉽게 제거되었다.\n비닐이 제거되고 나니깐, 하우스 전체가 시원하게 보이고 있다. 작물 재배랑 연구를 함께 하려고 하니깐 하루 하루가 금방 지나간다.\n오후에는 제주농업기술원 감귤아열대과 요청으로 제작하고 있는 토양수분장력센서 측정함 제작을 마무리하였다. 값 측정에 대한 기본 테스트가 완료되어서 각 농가별 2개씩 총 6개의 토양수분장력센서를 애월 지역 3개 키위 농가에 설치할 예정이라, 미리 측정함에 측정보드, SMPS, 센서 연결 터미널 등을 세팅하였다.\n단순하게 측정함을 구성했지만 제일 중요한 것은 센서 측정값(토양수분장력, 토양온도)이 잘 측정되어서 클라우드 서버로 전달되는가 인데,,, 결과는 이상무!!!!!!!\n차주 금요일에 감귤아열대과 연구사와 함께 3개 포장에 방문해서 센서측정함 1개에 센서 두개를 설치해서 데이터를 취득할 예정이다. 깊이는 15cm ~ 20cm 정도로 예상하고 있다. 세라믹 부분을 토양에 잘 심어야 될텐데, 또다시 흙 파내어서, 큰돌, 작은돌 골라내고, 다시 고운 흙으로 덮는 과정을 거쳐야 된다. 그리고 텐시오미터 내부에 증류수를 잘 넣어서 테스트를 시작하며 여러가지 좌충우돌이 생길 것이다. 그런 과정에 맘꽃가든이 새로운 스마트팜 기술을 또 배우게 될 것 같다.",
      "content_length": 804
    },
    {
      "id": "223044978376",
      "title": "2023.03.14 : 2023년 동부 자립형 스마트팜 연구회 정기 총회",
      "date": "2023. 3. 15. 10:57",
      "content": "2023년 동부 자립형 스마트팜 연구회 정기 총회를 제주동부농업기술센터 교육장에서 개최하였다. 이번 총회에서는 특별히 김경익 동부농업기술센터 소장님께서 참석해서 농업에 있어서 농민들의 스마트팜 연구 활동 중요성 및 활동 지원 격려를 해주셨다. 적은 인원으로 시작해서 이제 기술센터에서 촉망받는 연구회로 거듭나고 있음을 느끼는 시간이었다. 그 과정에서 3년에 걸쳐서 같이 활동해 주신 임병준 전회장님, 유도균 부회장님, 오동규 총무, 심인보 대표님, 김성훈 대표님 등 많은 회원분들에게 진심으로 감사를 드린다.\n그리고 한윤아 팀장님께서는 이제까지 강소농 중심의 농업인 사업이 올해부터 \"스마트 강소농\"육성 사업으로 정부의 정책 방향이 변경되었다고 알려주시면서, 스마트팜 연구회 활동에 적극적인 농민들에게 많은 혜택이 갈 수 있다고 하셨다. 그래서 교육프로그램도 그렇게 변경될 예정이라 많은 참석을 바란다고 해 주셨다.\n올해는 회원 농가 대상으로 스마트팜 실증 사업을 추가 진행하면서 도외 선진지 견학을 꼭 진행하고자 한다. 작년에 맘꽃가든에서 방문했던 스마트팜 시설 및 재배 농가들을 회원분들하고 같이 방문해서 현재의 스마트팜 기술 현황 및 적용이 어떻게 이루어 지고 있는지를 확인하는 시간을 가지고 싶다.",
      "content_length": 618
    },
    {
      "id": "223043165406",
      "title": "2023.03.13 : 입식 재배용 다구형 포트 배치 시작",
      "date": "2023. 3. 13. 17:34",
      "content": "가변형 고설 베드 조립 및 설치가 완료되고, 이제 베드 위에 입식 재배용 다구형 포트를 배치하기 시작했다. 올해 들어서 스마트팜 관련 문의 및 업무가 너무 많아서 직원들이 그쪽에 매달리다 보니, 입식 재배 베드 설치는 온전히 내 몫이 되어 있다. 그래도 틈틈히 농장에 와서 청상추 관리 및 입식 베드 설치를 진행해서 마무리를 하고 이제 다구형 포트 배치 작업을 시작하였다.\n포트 배치까지 마무리되면 점적 관수 라인을 설치하고, 상토를 충전하면 상추 재배 준비는 완료될 것 같다.\n4월 이후에 상추 재배가 21구역 전체에서 재배가 시작되는 날이 다가오고 있다.",
      "content_length": 312
    },
    {
      "id": "223040442342",
      "title": "2023.03.10 : IT동아일보 가변형 입식 베드 및 슬라워 소개 기사",
      "date": "2023. 3. 10. 14:12",
      "content": "한국농업기술진흥원의 지원으로 IT동아일보에 가변형 입식 베드 및 슬라워 시스템 소개 기사가 나왔다. 맘꽃가든이 가진 기술들이 이제 하나씩 세상에 알려지고 있다. 이제 입식 재배의 길이 점점 더 현실화 되고 있음을 느낀다. 편하게 농사짓는 그날을 위해 오늘도 하루 하루 최선을 다한다.\n동아일보\n[농업이 IT(잇)다] 맘꽃가든 “가변형 입식 베드 스마트팜, 농가 불편 해소”\n[KOAT x IT동아] 한국농업기술진흥원과 IT동아는 우리나라 농업의 발전과 디지털 전환을 이끌 유망한 스타트업을 소개합니다. 기발한 아이디어와 상품, 그리고 독창적인 기술로 …\nwww.donga.com\nhttps://www.donga.com/news/It/article/all/20230310/118266016/1\nIT동아\n[농업이 IT(잇)다] 맘꽃가든 “가변형 입식 베드 스마트팜, 농가 불편 해소”\n[KOAT x IT동아] 한국농업기술진흥원과 IT동아는 우리나라 농업의 발전과 디지털 전환을 이끌 유망한 스타트업을 소개합니다. 기발한 아이디어와 상품, 그리고 독창적인 기술로 우\nit.donga.com\nhttps://it.donga.com/103579/",
      "content_length": 579
    },
    {
      "id": "223010530927",
      "title": "2023.02.09 : 공기순환팬 저전력화 시스템 실증 운전 시작",
      "date": "2023. 2. 9. 18:46",
      "content": "2022년 부터 시작된 공기순환팬 저전력화 시스템 시제품 개발을 완료하고 실증 운전을 시작하였다. 공기순환팬 구동을 공공 기상 예측 정보를 기반으로 매일 새벽 5시경에 운전 스케쥴을 생성하고 이를 기반으로 구동하는 시스템을 개발하였는데 이에 대한 실증 운전이 드디어 시작되었다.\n1차 실증 기간은 약 15일간 운전할 예정이며, 이를 통해 기존 운영 시간 대비 구동 시간을 얼마나 줄일 수 있을지 평가할 예정이다. 사실 여름 시즌에 평가하는 것이 가장 좋은데, 연구 기간이 올 4월말 완료 예정이라 지금부터라도 구동을 하면서 실증 데이터를 수집할 예정이다.\n공기순환팬 저전력화 실증\n재생\n7\n좋아요\n1\n00:10\n\n접기/펴기\n공기순환팬 저전력화 실증 테스트\n이러한 구동 스케쥴 알고리즘 개발을 위해서 작년부터 스마트팜 연구회 회원 농가에 사설 기상탑을 설치하고 가장 가까운 공공 기상 정보와 상관 관계 및 차이를 분석하였다. 예상보다 높은 상관 관계를 가지고 있으며, 고도 및 지형적 차이가 없는 경우에는 10km 이내 거리에서는 오차가 높지 않은 것으로 확인되었다.\n공공 기상탑에서 가장 가까운 농가의 10월 ~12월 일별 온도 차이 분석 결과값이다. 가을, 겨울 시즌에서는 낮 시간보다는 일출 이후 오전 시간대 온도변화가 가장 심해서 차이가 많이 발생함을 확인하였다.\n대부분의 농가에서 최대값은 일중 시간 전후가 되는데, 거의 차이가 없는 것으로 확인되었다. 이를 통해 공공 기상 정보의 신뢰성을 확인했다.\n이러한 분석 정보를 기반으로 사용자가 일별 공공 기상 데이터를 기반으로 순환팬 가동 시간을 결정할 수 있는 시스템을 개발하고 이제 시운전을 시작하였다. 4월 달까지 계속 운영해 볼 예정이며, 3월부터는 스마트팜 연구회 및 제주 ICT 협동조합 농가에서도 실증이 시작될 예정이다.\n오늘 하루도 작물 재배, 재배 시설, 시설 제어를 함께 적용하는 클라우드형 스마트팜 개발이 진행되고 있다.",
      "content_length": 948
    },
    {
      "id": "223009097813",
      "title": "2022.09.27 : 동부자립형스마트팜 연구회 회원 깻잎 농가 밸콘 밸브 설치",
      "date": "2023. 2. 8. 14:33",
      "content": "[과거기록] 스마트팜 연구회 회원 중에 깻잎농가에서 메인 관수 밸브 원격 제어를 요청하셔서 같이 작업을 하였다. 아래가 우리 스마트팜 회원 농가 하우스 시설이다.\n대부분의 경우 농업 용수는 아래와 같이 20mm PE관으로 오랜 기간동안 계량기 부분을 제외하고 땅속에 뭍혀 있었다.\n하우스 내부의 공간도 너무 좁아서 계량기 연결 부분을 옮겨서 밸콘 밸브를 달 수 있는 공간을 만들었다.\n밸콘 밸브는 가격이 좀 비싼 방수형으로 설치했는데, 스마트팜 연구회 회원분들과 이 밸브가 물속에서 얼마나 견딜지 다들 테스트 하는 분위기로 설치가 진행되었다.\n설치가 다 완료된 이후에 핸드폰으로 원격 조정하는 것을 테스트 완료 하였다. 항상 느끼는 것이지만, 스마트팜은 원격제어, 환경 측정이 어려운 것이 아니라, 설치해야 할 농가의 상황이 매번 다르다는 것이 가장 큰 문제이다. 아직까지 밸콘 밸브는 이번 겨울에도 무사히 잘 견디고 있다.",
      "content_length": 461
    },
    {
      "id": "223006706239",
      "title": "2023.02.05 : 로메인 상추 3번째 정식 실시",
      "date": "2023. 2. 6. 13:22",
      "content": "일요일에 아내랑 아이들이 와서 3번째 로메인 정식 작업을 진행하였다. 주중에도 일하고 공부하는 아내를 일요일에 불러서 한다는 게 너무 미안한 일이지만 그래도 아침부터 농장에 와서 작업해 줘서 너무 고맙다. 이제 상추판매로 수익이 더 생기면 선물이라도 해줘야겠다. 매일 연구비, 사업비 지출만 하는 남편을 이해해 주는 것도 너무 감사한 일.... ㅎㅎ\n그리고 포트 내부의 상토 상태도 확인해 보고 있다. 상토구성은 크게 문제가 안될 것 같은데, 어떻게 양액을 균일하게 잘 공급해야할지??? 하루도 숙제가 없는 날이 없다. ㅎㅎ",
      "content_length": 293
    },
    {
      "id": "223005902825",
      "title": "2022.02.04 : 입식재배시설 다구형 포트 배치 시작",
      "date": "2023. 2. 5. 16:38",
      "content": "입식재배시설 증설 작업이 계속 진행 중이다. 주말에도 일해야 하는 농업인의 삶이 이제는 익숙해 지고 있다. 가변형 고설 재배 베드의 하부 프레임 작업이 거의 완료되었다. 그래서 이제 다구형 포트 배치 작업을 진행하였다. 이미 포트는 다 제작되어서 배치만 하면 되는데, 스마트팜 연구 작업도 병행해야 하기에 작업이 늦어지고 있다. 그래도 맘꽃가든 실증농장이 청상추로 다 채워질 날이 멀지 않았다.",
      "content_length": 220
    },
    {
      "id": "223005159904",
      "title": "2023.02.03 : 음수투약방식 양액기 한파 피해 부품 수리",
      "date": "2023. 2. 4. 17:55",
      "content": "2월 1일 전후에 제주지역에 한파 피해가 발생해서 외부에 있던 도사트론 음수투약기, 필터, 밸브체크 방식 펌프 하우징이 다 부서졌다. 며칠동안 상추 수확이랑 미팅 때문에 교체 및 수리를 미루고 있다가 오늘에서야 분리하고 교체하였다. 특히 윌로펌프는 동일 기종이 파손된 경우가 많았는지, 수리할 부품이 없다고 맡기고 가라고 해서 두고 왔다. 영하의 날씨였지만 그렇게 춥지 않았는데 펌프하우징이 깨졌다는 게 아쉽다. 윌로제품이면 제주도 겨울 날씨 정도는 견딜 줄 알았는데....\n그래도 상토기반의 입식재배시설이라 2일 정도 관수를 못했지만 상추는 이상무!!!!",
      "content_length": 311
    },
    {
      "id": "223029290219",
      "title": "2023.02.27 : 공기순환팬 저전력화 5개 농장 실증 시운전",
      "date": "2023. 2. 27. 16:56",
      "content": "2022년 하반기부터 본격적으로 개발 진행되었던 공기순환팬 저전력화 기능에 대한 5개 농장 실증 시운전이 시작되었다. 이미 클라우드 서버를 통해 농장별로 공기순환팬 원격 제어 및 온습도 모니터링은 가능한 상황이라, 오늘 하루에 걸쳐 맘꽃가든이 개발한 공기순환팬 저전력화 시스템 기능에 대해서 5개 농장별로 방문해서 웹/앱 사용방법을 알려드렸다. 실증 시운전은 내일부터 시작해 약 15일간 진행될 예정이고, 맘꽃가든에서 제공하는 알고리즘에 따라 농장 내 공기순환팬이 잘 작동되는지, 센서값 측정에 문제가 없는지, 사용자에게 알람은 잘 가는지 등에 대해서 테스트를 진행할 예정이다.\n특히 매일 업데이트되는 공공기상 예측 데이터를 기반으로 공기순환팬 운영 방식을 어떻게 관리하면 되는지를 설명해 드렸는데, \"동부자립형스마트팜 연구회\" 및 \"제주ICT협동조합\" 농가를 대상으로 실증하는 것이라 스마트팜 운영 및 장치 구성에 대해서 충분히 이해하고 있어서 어려움없이 추가 설치 및 설명이 진행되었다. 하루에 제주도 한바퀴 다 돌면서 경광등 모듈 설치하고, 농민들에게 현황을 설명한 직원들의 노고에 감사함을 느낀다.\n특히 웹 기반에서는 총 4개 구간(일출, 주간, 일몰, 주야)으로 나뉘어진 공기순환팬 작동 알고리즘에 대해서 설명 드리고, 모바일앱에서는 장치 작동 및 환경 모니터링 알람 기능에 대해서 설명드렸다.\n(1) 제주 구좌 깻잎 농장\n웹 기반의 공기순환팬 저전력화 시스템 사용 방법 설명\n모바일 앱에서 공기순환팬 구동 현황 및 알람 조건 설정 방법 설명\n환경 모니터링용 경광등 설치 설명\n(2) 제주 구좌 블루베리 농장\n블루베리 농장 재배 포트에서 웹기반 원격 제어 설명\n블루베리 농장 전경\n환경 모니터링 장치와 경광등 모듈 설명\n(3) 서귀포 하우스 감귤 농장\n운행 스케쥴 생성 과정 및 모바일 앱 사용법 설명\n공기순환팬 제어함 및 경광등 모듈\n(4) 서귀포 하우스 만감귤 농장\n운행 스케쥴 생성 과정 및 모바일 앱 사용법 설명\n공기순환팬 제어함 및 경광등 모듈\n운행 스케쥴 생성 과정 및 모바일 앱 사용법 설명\n(5) 서귀포 레드향 농장\n스마트팜 제품이 이렇게 다양한 농업 현장에 맞추어 설치되기 위해서는 많은 노력들이 필요하다. 특히 스마트팜 장치 작동 조건들이 열악하기 때문에 스마트팜 사용자 교육이 절대적으로 필요하다. 그래도 하나씩 하나씩 농가에 슬라워 제품이 설치되고 농업인들이 거부감없이 우리가 추구하는 스마트팜 개발 방향에 함께 하기에,,,,, 오늘 하루도 아자아자!!!!",
      "content_length": 1224
    },
    {
      "id": "223027357403",
      "title": "2022.12.25 : 농사도 설계가 중요하다 (가변형 입식 베드 배치)",
      "date": "2023. 2. 25. 16:31",
      "content": "[과거기록]시설 원예를 해야겠다는 결정을 하고 본격적으로 농업에 뛰어들면서 제일 먼저 진행한 것은 100평 정도의 시설하우스를 직접 짓는 것이었다. 2018년 겨울 부터 진행했던 시설 하우스 구축 과정은 시설하우스 설계로부터 시작되었다. 제주 지역은 강풍 피해에 대비한 표준 설계 규정이 있다. 단순하게 육지에서 본 단동형 하우스와는 개념이 다른 50mm 파이프를 기둥으로 구성한 연동형 하우스가 기본 구조이다. 그래서 측량을 하고 기초 자리를 파고, 근가를 묻기 위한 포크레인 운전 기술을 배워야 했다. 하우스 자재상을 만나서 하우스 조립 부품 리스트(BOM)을 뽑고 납품받아서 바닥에서 조립, 세우고 하나씩 하나씩 조립해 갔다. 사실 무모한 도전이었으나, 지금은 제주농업기술원 연구사가 되신 운찬일 선배의 지도와 도움이 없었으면 아예 꿈도 꾸지 못할 일이었다. 하루에 사다리를 수백번 오르락 내리락 하면서 진행하다 보니, 작업한지 3달만에 100평 하우스를 혼자서 짓게 되었다. 하우스 파이프에 매달려 작업하다가 떨어진 경우도 여러번 있었지만, 팔다리가 부러지지 않고 무사히 비닐까지 마무리한것만 해도 하늘이 나에게 농사를 업으로 삼으라는 기회를 주신 것처럼 느껴졌다.\n그렇게 하우스 100평 짓고 난 뒤 하우스 내부에 작업실 만들고, 가변형 입식 재배 만들어서 테스트 한지 1년 반만에 특허 3건 등록하고 본격적인 재배 시설 확장에 돌입하게 되었다. 특히 하우스 증설 초기에 하우스 가로장대를 연결하기 위해 측면 비닐에 구멍을 뚫고 며칠 뒤에 태풍이 닥쳐서 작업실이랑 입식 재배 테스트 베드가 다 날라간 날은 내 인생에 잊지 못할 추억으로 남았다. 다행히 하우스 증설 업체랑 얘기가 잘 되어서 일부 보상은 받았지만, 하우스 내부에 설치된 제어 장비랑 센서가 다 문제가 생겨서 교체하는 작업을 진행해야 했다. 이 일을 겪고 난 뒤 하우스 내부에 두었던 WAS 서버를 AWS(클라우스 서버)로 변경하게 되었다.\n이러한 우여곡절을 겪고 난 뒤 하우스에서 진행했던 것은 하우스 바닥에 전기선, 통신선을 매설하는 것이었다. 이것도 입식재배베드 설계를 기반으로 무경운 재배를 할 예정이라서 아예 CD관을 하우스 설비 이전부터 세팅을 진행해서, 하우스 증설 이후에 바로 전기와 인터넷 통신이 가능한 상태로 만들었다.\n2021년 가을 부터 진행되었던 하우스 증설 작업은 그해 겨울 초입이 되어서야 마무리 되었다. 아래의 사진이 현재의 맘꽃가든 실증 농장 외관이다. 그래도 하우스 자재 가격이 오르기 전에 진행되어서 다행이라는 생각을 하고 있다.\n그리고 아래가 현재 맘꽃가든의 입식재배 베드 배치 현황이다. 아직 100% 완성된 것은 아니지만, 최초 설계했던 과정대로 진행되고 있다. 500평 규모에 38,000주 상추가 재배되도록 하겠다는 목표가 현실로 다가오고 있다.\n청장년 농업인 대상 교육을 할 때 항상 얘기하는 것이 있다. 만약에 스마트팜을 하고자 한다면 본인의 농장에 대한 설계 부터 진행해야 한다고..... 즉 \"농사도 설계가 중요하다\".. 스마트팜은 집을 짓는 것 만큼 어렵고 돈이 많이 들어가는 작업이다. 그렇다고 집을 지을 때는 전문가(건축가)와 협업이라도 가능하지만, 스마트팜은 아직 나에게 맞는 스마트팜을 설계해 줄 전문가가 그렇게 많지 않다. 그래서 더욱더 공부하고 경험해 봐야 한다.\n농업에 본격적으로 뛰어든지 5년 정도가 되어서야 내가 원하는 농장이 만들어지고 있다. 그 시간 동안, 좌절과 희망은 항상 내곁에서 나를 시험해 왔다.\n이후에도 그렇게 될 것이지만 오늘도 개선할 부분을 찾아서 새롭게 설계하고 하루하루 또 전진할 것이다.",
      "content_length": 1763
    },
    {
      "id": "223026189991",
      "title": "2023.02.24 : 토양 수분 장력 센서 TEROS 32 (SDI-12 통신 테스트)",
      "date": "2023. 2. 24. 11:58",
      "content": "애월 키위 3개 농장에 설치할 토양 수분 장력 센서 TEROS 32를 구입하였다. 작년까지는 실증요원이 1주일에 2번 이상 농가를 현장 방문하고 압력 게이지에 나와 있는 결과값을 수기/엑셀 입력하는 방법으로 진행했는데, 올해부터 슬라워 데이터 수집 장치를 통해 실시간 측정값을 받는 것으로 변경하고자 한다. TEROS 32 제품은 현재 국내에 수입되는 토양 수분 장력 센서 중에 고가에 해당 되는 제품이라 면밀한 테스트 과정이 필요하다. 고장나면 한순간에 ???만원이 날라간다. TT; ESP32 보드와 SDI-12 통신을 통해 측정값을 받아야 하는데, 1차 테스트 결과 입출력 신호 전압 (3.3V) 를 맞추는 과정이 자세히 검토해야 할 것 같다.\n바늘 주사기를 통해 증류수를 공급하는 부분이다. 토양 상태에 따라 달라질 수 있는데, 일반적인 육지 토양에서는 최대 2주동안 증류수를 공급하지 않아도 된다고 하는데, 물빠짐이 좋은 제주도에서는 최소 10일 단위로 현장 방문해서 증류수를 공급해야 할 것 같다. 그래도 실시간 측정값을 확인할 수 있는 장점이 있어서 향후 토양 수분 장력은 이 센서를 통해서 연구가 진행될 것 같다.\nSDI-12 통신용 피그테일 케이블(은색 : GND, 진갈색 : VCC, 브라운: DATA)로 구성되어 있다. 열심히 프로그램짜고 테스트 진행해야 할 듯 하다.\n테스트는 먼저 상토에서 진행될 예정이고, 토양 깊이는 최대 20cm 정도에서 결정될 것 같다.\n추후 테스트 결과는 블로그를 통해서 알려드리겠습니다.",
      "content_length": 748
    },
    {
      "id": "223025527904",
      "title": "2022.08.16 : 청상추 파종 후 다단 베드 육묘 과정",
      "date": "2023. 2. 23. 19:40",
      "content": "[과거기록] 2022년 7월 초에 다단육묘베드에서 권농 청상추 파종 이후 육묘 과정을 정리해서 올리고자 한다. 현재 맘꽃가든에서는 총 5세트의 다단육묘베드가 있는데, 102구 육묘판 기준으로 32,000주 정도를 동시에 파종, 육묘할 수 있다. 물론 그런 날이 올건지? 의심하면서 시스템을 만들었지만, 점점 D-DAY는 다가오는 것 같다.\n한꺼번에 파종하기에는 코팅용 씨앗을 기준으로 한 아래의 파종기가 편하고 좋은 것 같다. 맘꽃가든은 스마트팜 연구회 회원분의 기증 및 추가 구매에 의해 총 4 종류의 파종기(105구, 128구, 162구, 200구)를 보유하고 있다. 파종기에 씨앗통, 누름판등... 약 100만원이 들었다. 농사는 다 돈이다...--;\n보광을 위해 LED를 설치했는데, 효과가 없다고는 할 수 없지만, 많이 설치해야 한다. 적어도 8줄 정도인데, 자재비가 없어서 4줄만 설치했다. 올해 추가로 구매해서 8줄을 다 채울 예정이다.\n그리고 육묘가 된 묘종을 옮기기 위한 이동 트레이도 간이로 제작했다. 한번에 6개씩 들고 갈 수 있게 만들었는데, 현재도 요긴하게 사용하고 있다.\n육묘는 수직형 다단베드로 구축하는 게 좋은 것 같다. 다만 LED를 생각보다 많이 설치해야 육묘가 잘 되고 정식 이후에 성장도 잘 된다.\n최근에 수직농업 관련 기사가 있기에 공감하는 차원에서 공유하고자 한다. 우리나라 실정도 잘 확인해 봐야 할 듯.\n‘미래의 대안’ 극찬 받던 수직농업 꺾이나…수직농업 스타트업, 기술 부족에 경영난까지 이중고\n‘미래의 대안’ 극찬 받던 수직농업 꺾이나…수직농업 스타트업, 기술 부족에 경영난까지 이중고\n수직농업은 한 때 시장에서 농업의 미래를 밝히는 등불이라며 기대를 한 몸에 받았다. 토지를 개발하지 않아 기후 변화에 적절히 대응하는 방식이며, 도시민들에게 오염되지 않은 농작물을 도시 인근에서 생산 공...\nnaver.me",
      "content_length": 927
    },
    {
      "id": "223024442277",
      "title": "2023. 02. 22 : 제주 동부지역 품목농업인연구회 임원 연찬회 및 농기계 사고 강연 참석",
      "date": "2023. 2. 22. 20:04",
      "content": "코로나19로 인해 연기되었던 품목농업인연구회 임원진 모임이 제주동부농업기술센터에서 개최되었다. 이에 동부자립형스마트팜연구회 회원이신 콩깍지농원 김성훈 대표님과 함께 참석하였다. 동부 지역 연구회 책임자이신 한윤아 팀장님의 2023년 품목 연구회 활동 및 등록 갱신 일정 설명을 듣고 난 뒤 제주대학병원에서 농기계 관련 중대사고 특별 강연을 듣게 되었다. 아래 사진에는 없지만 농업 현장에서 발생한 실제 사고 사례 사진을 발표자료에서 많이 보게 되었는데, 정말 농기계를 안전하게 다루는 것이 중요함을 느끼는 시간이었다. 사고 사례는 대부분 50대~80대까지 다양한 연령대에서 발생했는데, 최고 고령자가 89세 여성분이었다. 집에서 쉬셔야 되는데, 농업 현장 인력이 없으니... TT; 대부분 손가락이 베이고, 짤리고, 다리가 부러지고..... 등등... 특히 손가락 짤리는 사고가 너무 많은데, 제주도에서는 신경을 연결하는 접합 수술 받기 어려운 경우가 많아서 안타까운 일들이 많이 생긴다고 한다. 아 농사는 힘들다....\n그리고 2021년 기준의 현재 농어촌 지역 고령화 및 인구 감소에 대한 통계 데이터도 확인했다. 지금이 2023년이니깐 더 많이 고령화되고 농업인구가 감소되었을 것 같다. 이런 환경에서 청장년 세대가 농업 현장에 신규로 유입되기는 쉽지 않을 것이다.\n그래도 기뻤던 것은 이번에 배포된 자료에 당당히 동부자립형스마트팜연구회가 등록되어 있다. 가장 최근에 만들어진 연구회라는 것을 설립연도를 보니 확 와닿는 것 같다. 연찬회 모임이 끝난 뒤에 모 연구회에서 스마트팜 강의를 연구회 회원 대상으로 해 달라는 부탁을 하셨다. 특히 한윤아 팀장님께서 추후 농업기술 지원에 있어서 스마트팜 비중은 점점 더 확대 될 것 같다는 말씀을 하셨다. 다들 스마트팜에 대한 관심이 높다는 것을 오늘도 느끼게 된다.",
      "content_length": 903
    },
    {
      "id": "223023167447",
      "title": "2023.02.21 : IT 동아일보 인터뷰",
      "date": "2023. 2. 21. 17:53",
      "content": "한국농업기술진흥원의 기업 홍보 지원 프로그램을 통해 IT 동아일보 인터뷰 기회가 생겼다. 서울에서 직접 차주경 기자가 농장을 방문해서 인터뷰를 진행하였다. 특히 제주동부농업기술센터에서 지역 농민들과 진행하고 있는 스마트팜 교육 지원에 대한 홍보도 함께 할 겸해서 인터뷰에 참여해 주셨다. 기자분이 농업 관련 업체 방문 경험이 많으셔서 농업 현장의 문제점과 스마트팜 기술 발전 방향에 대해서 함께 의견을 나누는 좋은 자리였다. 매일 매일 맘꽃가든이 지향하는 농업 환경 개선 방안이 알려질 수 있는 기회가 생겨서 올 한해는 좋은 성과들이 생길 것 같다.\n그리고 동생 가족 모두가 농장을 방문해서 로메인 상추 수확 작업을 했다. 요즈음 직원들이 스마트팜 개발 및 연구 보고서 작성에 바빠서 음식점 주문을 소화해 내지 못하고 있다. 주문이 있어도 수확을 못하는 상황도 만들어 지고... ^^;\n귀한 휴가 기간에 농장 일을 도와준 가족들에게 감사함을 느낀다.",
      "content_length": 475
    },
    {
      "id": "223022183818",
      "title": "2023.02.20 : 한국농수산대학 진학 준비중인 조카.. 로메인 상추 정식/파종 체험",
      "date": "2023. 2. 20. 21:15",
      "content": "부산에 있는 남동생 가족이 방학을 맞이해서 농장을 방문했다. 특히 고3이 되는 조카가 한국농수산대학 진학 준비중인데, 가족들이 여행 다니는 시간에도 혼자서라도 농장에서 일하고 싶다고 해서 방학중인 딸과 함께 상추 정식 작업을 진행했다. 오전에는 상추 정식, 오후에는 파종 체험을 하는데 작업 속도는 늦어도 작업 과정이 너무 신기하다는 말에 농업 전공을 적극 추천하고 있다. 그리고 단순한 체험만 할거면 안해도 된다고 했는데 진학하기전에 꼭 해보고 싶다는 말에 농업에 진진하게 접근하는 의젓함을 느낀다. 올 연말에 좋은 진학결과가 나오기를 희망한다.",
      "content_length": 306
    },
    {
      "id": "223003350110",
      "title": "2023.02.02 : 한국농수산대학교 채소학과 재학생 방문",
      "date": "2023. 2. 2. 19:52",
      "content": "오늘 청상추, 로메인 주문이 많아서 외국인 여성 노동자 두분을 불러서 작업을 했다. 스마트팜 연구회 회원 농가에서 고정으로 근무하는 여성분들인데, 다행히 시간이 맞아서 농장에서 상추 수확을 진행하였다. 입식재배시설이 너무 편하다고 칭찬해 주시니깐 고생한 보람을 느낀다. 그렇게 상추 수확 작업을 하고 있는데, 지인분의 아들이 농장을 방문해서 이런저런 얘기를 나눴다. 한국농수산대학교 채소학과 2학년에 재학중인데, 제주아열대연구소 실습 중에 농장을 방문해서 얘기를 나눴다. 부모님의 농업을 이어갈 청년의 굳은 의지를 보면서 농업의 희망을 얘기하는 행복한 시간이었다. 맘꽃가든이 연구 개발하는 것들이 젊은 청년 농부들에게도 도움이 되기를 바래본다.",
      "content_length": 360
    },
    {
      "id": "223020151265",
      "title": "2023.02.18 : 감귤명인 김종우회장님과 만감류 스마트팜 구현 방안 협의",
      "date": "2023. 2. 18. 18:57",
      "content": "2021년 농촌진흥청 감귤 명인으로 선정되신 샛별한라봉농장 대표 김종우회장님이 맘꽃가든을 방문해 주셨다. 맘꽃가든에 설치된 스마트팜 시설을 보시고 여러가지 현장에서 느끼는 스마트팜 개발 방향에 대해서 30분 동안 의견을 나누면서 A4 이면지 한장이 가득 차도록 얘기를 해주셨다. 특히 한라봉 꼭지 생성 및 온도 관리, 레드향 열과 피해 방지 방안, 고품질 농가 빅데이터 수집 방법, 포장별 토양 환경 측정 방법 등... 이제 명인의 반열에 올라 계셔도 끊임없이 노력하는 선배님들의 열정에 더 노력해야 함을 느낀다. 배움에는 끝이 없다.",
      "content_length": 299
    },
    {
      "id": "223019264398",
      "title": "2023.02.17 : 스마트팜 실습 교육 세트 판매",
      "date": "2023. 2. 17. 19:43",
      "content": "제주도내 감귤 연구 단체에서 스마트팜 실습용 교육 세트를 제작해 달라는 요청이 있어서 구동기 제어 1세트, 환경측정 5세트를 제작하였다. 그중에 오늘 한 세트씩 시연을 위해서 별도로 제작하고 납품하였다. 구동기 제어 세트는 스위치형 8채널, 개폐기형 8채널 동시 제어가 가능한데, 농업에서 가장 많이 사용되는 삼상펌프, 단상순환팬, 개폐기, 전동 밸브가 제어될 수 있도록 하였다. 환경측정세트는 감우, 온습도, 토양온습도 등의 데이터 수집/모니터링이 가능하게 구성되었다. 과거 스마트팜 교육 때마다 이론위주로 진행된 것을 탈피하고자 하는 노력들이 계속되고 있다. 아마 나도 실습강의를 여러차례 해야될 것 같다. 농민들과 IT를 하드웨어 보면서 얘기할 수 있을까? 그렇게 보면 우리 동부자립형스마트팜 연구회가 이런 활동의 시발점이었을 것 같다..올해는 다행히 총과정 중에 30%는 청년농업인 대상이라고 하는데 천천히 강의도 준비해야 할 것 같다.",
      "content_length": 472
    },
    {
      "id": "223017846331",
      "title": "2023.02.15 : 국립원예특작과학원 시설원예연구소 방지웅 박사, 밭작물 연구단지 강태환 팀장, 김현수 연구사 방문",
      "date": "2023. 2. 16. 16:38",
      "content": "ESP32 보드 기반의 환경 제어 연구를 함께 해 왔던 시설원예연구소 방지웅 박사님이 공기순환팬 저전력화 관련한 강의 및 자문을 위해서 제주도로 직접 방문해 주셨다. 2020년 부터 ESP 계열 보드를 가지고 환경 모니터링 및 제어 관련 오픈소스 프로그램을 같이 개발해 왔는데, 이틀동안 맘꽃가든 사무실, 농장을 방문해서 현재 개발 현황 및 운영 내용에 대해서 강의 및 자문을 해 주셨다.\n특히 시설원예 연구소에서 개발하고 있는 차세대 온실 통합 관리 플랫폼도 소개 받고 추후에 우리가 개발하는 제품도 같이 공유할 수 있을지 지속적으로 협의하기로 하였다. 공학박사 출신으로 농공계열에서 직접 스마트팜 통합 온실 제어 프로그램을 직접 개발하고 계셔서 하드웨어 선정 및 솔루션 개발 방향, 그리고 농업 현장 적용 방법등 여러 부문에 있어서 자문을 구하고 있다.\n특히 이번에 맘꽃가든 실증농장도 방문해서 현재의 입식재배 방법 및 공기순환팬 저전력화 실증 방법 등에 대한 기술 자문도 진행하였다.\n그리고 오후에 제주농업기술원 밭작물연구소의 강태환 팀장님과 김현수 연구사가 방지웅 박사와 함께 저비용 스마트팜 개발 방향에 대해서 협의하기 위해 방문하셨는데, 밭작물 재배에 전문가이신 강태환 팀장님이 입식재배 베드에 관심이 많으셔서 소개를 드렸다.\n그리고 우리가 개발하고 있는 저비용 스마트팜 제품에 대해서 같이 하드웨어를 확인해 보고 기술 개발 방향 및 향후 적용 방안에 대해서도 협의하는 시간을 가졌다.\n제주도에서 스마트팜 전문가들이 농업현장에서 직접 스마트 온실 환경 측정 및 제어 방안에 협의할 수 있는 시간이었다. 다들 1세대 스마트팜 개발도 부족한 상황에서 2세대, 3세대 스마트팜으로 바로 접근하는 것은 한계가 있다는 것에 공감을 하였다. 제주도에서도 여러 스마트팜 기술 개발을 진행하였기에 이제는 그러한 기술을 단순화 시키고, 2세대 스마트팜으로 진화하기 위한 기초기술을 다지는 것이 더욱 필요할 것이다.",
      "content_length": 956
    },
    {
      "id": "223014992681",
      "title": "2023.02.13 : 봄재배용 로메인 상추 파종 시작",
      "date": "2023. 2. 14. 8:56",
      "content": "작년 가을에 심었던 로메인 수확이 거의 완료되어 간다. 이제 점점 추대되어 더이상 수확이 힘들어 질 것 같다. 날씨도 따뜻해 질 것 같아서 \"권농 진청 로메인\"상추 씨앗을 주문해서 파종에 들어갔다.\n스마트팜 개발 업무 때문에 한꺼번에 다 파종을 할 수 없어서, 간단하게 12판만 파종을 했다. 김팀장 혼자서 12판 작업하는데 한 시간도 걸리지 않으니깐, 이제 여러가지로 재배 작업이 익숙해짐을 느낀다.\n김팀장이 파종 작업을 하는 동안, 나는 정식 작업을 진행하였다. 이제 입식 재배 과정이 잘 자리를 잡아감을 느낀다. 농장에서 슬리퍼 신고도 모든 작업이 진행될 수 있다.\n그리고 지난 연말에 정식했던 로메인이 자리를 잡아감에 따라, 떡잎 솎음 작업을 진행했다. 일찍 작업을 했어야 하는데, 인력 구하기가 너무 힘들다. 작물 재배 기술은 계속 늘고 있는데, 재배만 전문적으로 맡아줄 사람을 구하기가 너무 힘들다.",
      "content_length": 453
    },
    {
      "id": "223011609653",
      "title": "2022.10.24 : 공기순환팬 원격 제어위한 스마트팜 연구회 회원 농가 설치",
      "date": "2023. 2. 10. 17:07",
      "content": "[과거기록] 공기순환팬 원격 제어를 위해서 스마트팜 연구회 회원 농가 중에 콩깍지 농원, 리버티 필드 두 개 농장에 원격 제어 모듈을 설치했다.\n기존의 전기 제어 방식을 맘꽃가든에서 개발한 구동기 제어 모듈과 연결시켜서 원격 제어가 가능하도록 구축하였다.\n심팀장이 블루베리를 재배하는 리버티필드 농장에 원격 제어 모듈을 설치하기 전에 농장주와 현재 상황을 얘기하고 있다. 리버티필드 농장은 10분 단위의 타이머 기반으로 작동을 하고 있다.\n그리고 각 농장의 개폐기 제어함 구성이다. 24V 트랜스와 AC 전원 --> DC 전원으로 변경하는 다이오드, 릴레이 등을 볼 수 있다.",
      "content_length": 322
    },
    {
      "id": "223282186148",
      "title": "2023.12.03 : 작물 재배와 입식베드 추가 설치",
      "date": "2023. 12. 4. 7:33",
      "content": "주중은 스마트팜 개발 및 설치를 진행하고, 주말에는 농장에서 상추 재배 관련 작업을 진행하고 있다. 확실히 야간온도가 떨어지고 나서는 작물 성장 속도가 더뎌지고 있다. 수확량이 많지 않을 것 같다. 이중커튼과 난방을 해야하는데, 시설 비용이 없어서 올해는 이렇게 지나가야 할 것 같다.\n새로 정식할 베드를 정리하는 작업을 수행했다.\n동부디지털농업연구회 회원이신 임병준 사장님 댁에 테스트로 입식베드를 추가 설치하고 재배 세팅을 준비하고 있다.",
      "content_length": 247
    },
    {
      "id": "223282184228",
      "title": "2023.12.02 : 시범포장 시설 내 전기선 인입 작업",
      "date": "2023. 12. 4. 7:28",
      "content": "제주농업기술원 시범 포장 중에 설치가 오래되고 전기 제어 방식으로 설치된 시설들은 전기선 인입 작업이 쉽지 않다. 특히 외부에 설치된 시설 내부에 환경 측정 장비라도 넣으려면 외부 제어함에서 전기를 공급해야 하는데, 기존 전기 배선 라인을 알면 쉽게 작업이 가능하지만, 최초 설치 도면을 확인하는 것이 쉽지가 않아서 하나씩 하나씩 요비선을 넣어서 시설하우스 내부와 외부의 연결상태를 확인해야 한다.\n또다른 하우스에 우성하이텍 개폐제어 설비가 구축되어 있어서 개폐기 라인과 열풍기 라인, 접지 등이 어떻게 내부랑 연결되는지 확인하는데 어려움을 겪었다.\n그리고 일부 장비는 노지 관수로 추가 설치가 필요해서 외부에 지지대를 세우고 제어 장비를 설치했다. 노지 환경은 시설 하우스보다 훨씬 열악한 환경이기에 설치하는 것이 쉽지 않다.",
      "content_length": 407
    },
    {
      "id": "223307289871",
      "title": "2023.12.29 : 제주농업기술원 스마트팜 협업 시스템 개발 완료",
      "date": "2023. 12. 30. 10:45",
      "content": "3년간의 공동 연구 과정을 통해 드디어 제주형 스마트제어 및 데이터 통합관리시스템 구축 개발을 완료하였다. 제주형 스마트팜 기술 확보를 목표로 함께 해준 제주농업기술원 연구자, 동부디지털농업연구회 회원님들, 제주아이씨티협동조합 조합원들에게 감사드린다. 이제 2024년도 다시 시스템 안정화 및 실증에 최선을 다하고자 한다. 제주도가 스마트팜 기술의 선두지역이 될 수 있도록 홧팅!!!!!",
      "content_length": 216
    },
    {
      "id": "223305402906",
      "title": "2023-12-25 : 문자 메세지 발송 테스트 및 5cm 간격 접적 테이프 교체",
      "date": "2023. 12. 28. 11:02",
      "content": "문자 메세지 발송 테스트 및 5cm 간격 접적 테이프 교체 작업에 대한 블로그 글을 올렸는데, 광고성 댓글 삭제를 하다가 본문을 삭제하는 실수를 저질렀다. 그래서 사진만 다시 올립니다.",
      "content_length": 103
    },
    {
      "id": "223300714446",
      "title": "2023.12.15 : 최다 인원 60여명 농장 방문",
      "date": "2023. 12. 22. 18:49",
      "content": "제주도로 단체로 견학로 농업인 중에 최대 인원이 맘꽃가든을 방문했다. 60여명이 방문해서 정말 정신이 없었지만, 많은 얘기를 나눌 수 있었다.\n농장 관리를 맡고 있는 백대표가 청년농업인 대표로서 인사를 하고 있다.",
      "content_length": 119
    },
    {
      "id": "223296953381",
      "title": "2023-12-17 : 제주시 농협 상추 생산자 출하 협의회 하반기 모임 개최",
      "date": "2023. 12. 19. 6:36",
      "content": "추운 날씨에 상추의 성장이 드뎌지고 있다. 올해 가입한 제주시 농협 상추 생산자 출하 협의회에서 하반기 모임을 맘꽃가든에서 가지게 되었다. 상추 재배에 있어서 베테랑 이신 분들을 모시고 현재 맘꽃가든의 재배 기술 및 현황을 함께 공유하는 자리를 가진 것이다. 만석농장 대표님은 상추 농사 40년 이라고 하시는데, 저절로 고개가 숙여지고 배워야 할 부분이 많음을 느끼게 된다.\n맨 앞자리에 하경수 회장님을 비롯한 많은 분들이 현재 맘꽃가든이 추진하고 있는 가변형 입식 재배 베드에 대해서 격려해 주시고 문제점을 지적해 주셨다. 내년에는 동부농업기술센터 시범사업 진행 시에 참여하시겠다고 하는데, 많은 도움이 될 것 같다.\n이번 상추출하자협의회 모임에도 청년농업인이 한명 있다. 세 아이의 아빠라고 하는데, 많은 책임감을 느끼고 있는 것 같다. 나에게 도움을 요청하는데, 어떻게 도움을 줄 수 있을지 고민해야 할 듯 하다.\n겨울 상추 품종 선정 및 재배 노하우에 대해서 여러가지 좋은 정보를 주셨다. 스마트팜은 결국 작물 재배다. 어떻게 기후 변화에 대응하고, 인력을 줄이면서 지속 가능한 농사를 재배할 수 있는지에 대해서 고민해야 한다. 이는 혼자서 해결할 수 있는 문제가 아니다. 농업이 위기이기에 함께 노력하는 지혜가 필요하다.",
      "content_length": 632
    },
    {
      "id": "223291068912",
      "title": "2023-12-12 : 시간예약/센서 기반 관수 시스템 시연 준비",
      "date": "2023. 12. 13. 7:35",
      "content": "제주농업기술원과 1년에 걸쳐서 공동 연구 개발해 왔던 관수 시스템 시연을 준비하고 있다. 오픈 소스 기반의 클라우드형 스마트팜 플랫폼을 개발하면서 심여를 기울였던 관수 시스템 기능 개선 작업을 마무리하고 시연하기 위한 준비를 진행하고 있다. 시연 위한 하드웨어 설치에만 1주일 넘게 걸리고 있다. 일반 하우스 농가와 동일한 상황을 구현하기 위해 펌프도 분리해서 2개 설치하고, 밸브도 3가지(직수 원격, 시간 스케쥴링, 센서 스케쥴링)로 구분, 구동하기 위해 총 7개 설치하였다. 또한 개별 농가가 별도로 수동 조작하기 위한 셀렉터 스위치 회로도 구성했다.\n센서도 토양 센서 4종(TEROS21, TEROS12, 미래센서, WaterMark), 일사량센서(Apogee), 온습도센서(SHT35 방수형), 유량센서, 수위레벨센서, 수위릴레이센서 를 설치해서 동시 모니터링을 진행할 예정이다.\n이번에 특별히 훈훈농장 강철훈 대표가 시연용 하드웨어 구성에 큰 도움을 주었다. 역시 이제 스마트팜을 구축하는 농부는 백공이 되어야 한다.\n좁은 공간에 개별 밸브 제어를 사용자가 원하는 조합에 따라 언제든지 바꾸고 조절할 수 있음을 시연하기 위해 직수 밸브를 제외하고 별도로 펌프당 4개 밸브, 2개 밸브로 분리해서 설치하였다.\n분수 호스 사이로 토양 측정값 변화를 모니터링하기 위해서 센서 설치할 장소를 삽으로 파고 센서를 묻을 예정이다. 토양은 특히 측정값 변동이 심해서 이를 기반으로 제어하는 것은 연구가 더 필요해서, 대체 지표를 선정해서 이번 시스템 개발에 반영했다. 이번 시스템 개발 및 내년 실증 작업을 통해서 현장에 직접 적용 가능한 스마트팜 시스템이 될 수 있도록 하고자 한다.",
      "content_length": 830
    },
    {
      "id": "223256723157",
      "title": "2023.11.05 : 입식재배용 양액기 자체 제작 테스트",
      "date": "2023. 11. 6. 7:04",
      "content": "입식 재배용 양액기를 자체 개발하여 제작중에 있다. 이번에 제작한 양액기를 현장에서 테스트하기 위해서 현장 설치하고 이를 상추 재배에 적용하고자 한다.\n기존에 있던 10mm 점적 테이프를 다 제거하고 다시 5mm 라인형 테이프로 교환하고자 한다.\n기존에 설치된 점적테이프 중 1/5 정도 제거했는데도 쓰레기가 많이 발생한다. 농사를 지으면서 농업용 부자재 쓰레기 처리가 심각함을 다시 한번 느끼고 있다.",
      "content_length": 225
    },
    {
      "id": "223278726485",
      "title": "2023.11.28 : 제주농업기술원 시험포장 스마트팜/CCTV 설치",
      "date": "2023. 11. 30. 8:17",
      "content": "제주농업기술원 시험포장에 스마트팜/CCTV를 추가 설치하기로 하였다. 거의 2주간에 걸쳐 인터넷 망 설치, 전기 배선 공사 등의 기반 설치 공사를 진행한다고 많은 시간을 보냈다. 스마트팜 설치에 있어서 소프트웨어 개발도 중요하지만, 농장 환경에 맞는 통신, 전기 시설을 구축하는 것이 쉽지가 않다. 그래도 이렇게 우리가 가진 기술들이 하나씩 확장되어 가는 것에 보람을 느낀다.\n제주농업기술원 시험포장에 설치될 환경 측정함, 구동기 제어함... 이제 체계가 잡혀가면서 조립 및 제품 제작이 용이해 지고 있다.\n동부디지털 농업 연구회 회원인 훈훈농장 대표, 강철훈 사장과 함께 인터넷 선 설치 작업을 진행하고 있다. 최근에 강대표와 나는 전기 설비를 위한 전기 기능사 자격증을 취득하였다. 이제 본격적인 설치 작업을 위해 필요한 면허도 취득할 예정이다.\n제주도는 바람이 많이 부는 곳이라, 이렇게 안전하게 와이어 설치하고 랜선을 함께 연결하고 있다.\n하우스 내부에 전기 배선을 추가하기 위해서 요비선 작업을 강대표와 함께 하고 있다. 스마트팜 설치 및 유지 보수 작업은 농업 전문가가 해야 한다. 자기 농장에 맞는 설비 구축 및 유지/보수가 꼭 필요하기 때문이다.\n제주농업기술원 김현수 연구사와 2년 전부터 테스트 해 왔던 4번 하우스,, 이곳에 또다시 CCTV와 스마트팜 장치를 업그레이드 설치 작업을 진행하고 있다.",
      "content_length": 680
    },
    {
      "id": "223231311385",
      "title": "2023.10.08 : 점적 관수 시설 정비",
      "date": "2023. 10. 8. 19:26",
      "content": "국산 점적 테이프를 점적 관수 설비에 사용했는데, 두께가 얇아서 여름 고온에 터지는 문제가 발생하였다. 이를 해결하고자 수입 제품을 사용하니깐 기존 국산 점적 테이프 밸브가 누수되는 문제가 발생함.. 아~~~ 쉬운게 없다. 왜 농업용 부품들은 다 부실한 건지??????\n점적테이프 밸브 누수 발생\n재생\n39\n좋아요\n0\n00:09\n\n접기/펴기\n점적테이프 교체에 따른 누수 발생\n그래서 우레판(파란색) 방수띠가 삽입된 새로운 부품을 구해서 테스트를 진행하였다. 다행히 누수 문제를 해결하였다. 가격은 좀 더 비싸지만 그래도 이런 부품이 있어서 다행이다.\n그리고 맘꽃가든에서는 도사트론(음수투압) 방식으로 관수용 비료를 혼합해서 주고 있는데, 이번에 5톤 비료액이 다 소진되어서 추가로 관주용 비료를 희석해서 채우는 작업을 진행했다.\n거의 2달 가까이 사용을 했는데, 새로이 채우는 작업 진행하다보니 쉽지가 않다.. 오늘 하루도 상추와 장비와 열심히 투쟁을 하고 있다.",
      "content_length": 483
    },
    {
      "id": "223230565064",
      "title": "2023.10.07 : 파종, 육묘, 정식 재배",
      "date": "2023. 10. 7. 14:57",
      "content": "연휴의 시작과 함께 농장에 와서 파종, 육묘, 정식 작업을 진행했다. 다양한 상추 재배를 위해서 작물 종류를 5개 이상 늘리다 보니깐 해야할 일들이 더 많아지고 있다. 약 4주전에 파종했던 로메인이 이렇게 잘 크고 있다. 약 1주 뒤면 수확이 가능할 것 같다. 이렇게 여러번 반복하다 보니 기존에 보이지 않던 좀 더 깊이있게 작물 생육 상태를 확인하고 배울 수 있는 것 같다.\n추가로 2주 전에 육묘했던 로메인이 정식을 기다리고 있다. 2~3일 내로 정식을 진행할 예정이다.\n그리고 다시 버터헤드 파종 작업 실시,,,,, 로메인이나 탑그린처럼 코팅 씨앗이 아니다 보니, 하나씩 하나씩 포기 상추 씨앗을 105구 육묘 포트에 넣고 있다. 이제는 나름 요령이 생겨서 1시간에 12 포트 정도는 작업 가능하다. 이제 작물 재배가 손에 익어 간다.",
      "content_length": 414
    },
    {
      "id": "223228001509",
      "title": "2023.10.03 : 청주 농가 스마트팜 조립 및 테스트 실시",
      "date": "2023. 10. 4. 16:49",
      "content": "블로그를 통해서 청주 청년 귀농인이 직접 맘꽃가든에서 개발한 스마트팜을 조립하고 농장에 설치하기 위해서 추석 연휴동안에 제주도를 방문하였다. 약 2일에 걸쳐서 실증 농장 방문 및 시스템 구성에 대한 교육을 실시하고 직접 제어 보드를 조립, 등록, 테스트 과정을 진행하였다. 전국 단위로 서비스를 확장할 기회를 가지게 되었다. 구성은 구동기 제어함 2세트(개폐기용, 순환팬용), 환경 측정함 1세트를 구성해서 테스트를 한 다음에 문제가 없다면 농가에서 직접 현장에 설치할 예정이다.\n농장주께서는 직접 농장 관리를 하기 위해서는 스마트팜 구성 하드웨어와 소프트웨어를 직접 다 다룰 수 있어야 한다고 생각했고, 이에 맘꽃가든이 진행해 왔던 과정에 공감하셔서 이렇게 방문과 주문을 해 주셨다. 스마트팜 기반으로 지속 가능한 농업 환경을 구축하고자 하는 청년 농업인들이 점점 더 많아짐으로서 우리 농업은 발전할 수 있을 것이다.\n그리고 이번에 제주농업기술원 시범 포장에 설치할 제품을 조립하기 위해서 제주ICT 협동조합 소속 조합원도 함께 참여해서 향후 조립/설치 방향에 대해서 의논하고 함께 작업하였다. 연휴 마지막까지 이렇게 스마트팜 발전에 노력하는 농업인들이 있기에 맘꽃가든은 하루하루 최선을 다한다.",
      "content_length": 614
    },
    {
      "id": "223251829040",
      "title": "2023.10.30 : 시설원예연구소 방지웅 박사 방문",
      "date": "2023. 10. 31. 18:54",
      "content": "차세대 오픈소스 기반의 스마트팜 시스템을 개발하고 계시는 시설원예연구소 방지웅 박사님이 맘꽃가든과 제주농업기술원을 방문하셨다. 대한민국 스마트팜 개발 방향을 전환하기 위해서 함양에 있는 국립원예특작과학원 시설원예연구소에서 불철주야 시스템 구축을 위해 노력하고 계시는데, \"저비용\", \"저개발\", \"신시장\" 개척을 위해 최근에 오픈소스 기반의 스마트팜 플랫폼을 개발을 완료하고 이를 출시하기 위한 준비를 하고 계신다. 다행히 제주농업기술원과 맘꽃가든이 개발하고 있는 스마트팜 시스템에도 순차적으로 적용하기 위한 방안을 협의하고 추진하기로 하였다.\n스마트팜 개발과 더불어 이를 농업 현장에 적용하기 위해서 제주ICT협동조합 오길원 조합장도 함께 하기 위해서 현장에 모여 시설하우스 관련 내용들을 협의하였다. 이렇게 스마트팜 기술 개발은 끊임없이 이루어 질 것이고, 농민들이 편안하게 농사를 짓는 그날을 위해 많은 사람들이 현장에서 노력중인 것을 알아야 한다.",
      "content_length": 478
    },
    {
      "id": "223246381981",
      "title": "2023.10.25 : 제주농업기술원 스마트팜 납품 보드 제작 및 수정",
      "date": "2023. 10. 25. 17:27",
      "content": "제주농업기술원 납품용 스마트팜 구동기 제어 보드와 환경 측정 센서 보드를 추가 제작 및 수정하기 위해서 PCB 제작 협력업체인 하이브리드 정밀을 방문하였다. 대학 선배님이신 대표님은 해당 분야 박사님으로서 항상 기술 개발에 대한 자문을 받고 있다. 이번에도 현장 설치 엔지니어들이 어떻게 하면 쉽게 구동기와 센서를 농가에 맞게 등록, 수정 관리할 수 있을지에 대한 제품 개발 방향을 함께 의논하는 자리를 가졌다. 또한 양액기 제어 및 국가 표준 검정에 있어서 수정 보완 내용을 협의하였다.",
      "content_length": 273
    },
    {
      "id": "223243452057",
      "title": "2023.10.22 : 양액 관수 탱크 설치 및 5cm 점적 테이프 테스트",
      "date": "2023. 10. 22. 18:16",
      "content": "일요일 아침 일찍 부터 양액 관수 탱크를 설치하고 5cm 점적 테이프 테스트를 위해서 기존 10cm 간격 점적 테이프 교체 작업을 수행하였다. 농사보다는 시설 관리업자로 일하는 게 더 많다. 그래도 꾸준히 작물 재배하고 시설 개선하고 상품 출하하는 과정을 반복하고 있다. 누군가 전문가가 되기 위해서 20,000시간 이상을 보내야 한다고 했는데, 스마트팜 전문가는 40,000시간 이상을 보내야 할 것 같다.\n이번에 새로 구매한 5cm 간격 점적 테이프를 설치 테스트 하였다. 예상보다 드립량이 많아서 대 만족이다. 이제 일부 물이 골고루 공급되지 않는 문제는 해결될 것 같다. 이번에 구매한 것은 LINE형이고 추후에 CHIP형 제품도 구매할 생각이다.\n5cm 간격 LINE형 점적 테이프 관수 테스트\n재생\n32\n좋아요\n0\n00:14\n\n접기/펴기\n5cm 간격 LINE형 점적 테이프 관수 테스트\n그렇게 관수 시설 개선 작업하고 상추 수확은 총 20박스.. 오전에 9박스는 김녕 농협으로 출하하고 오후에 수확한 11박스는 제주시 농협으로 출하 하였다. 이렇게 하루 하루를 농업과 보낼 수 있음에 감사하다.",
      "content_length": 562
    },
    {
      "id": "223238725949",
      "title": "2023.10.16 : 양액기 배관 및 유량, pH, EC 센서 모듈 재설치",
      "date": "2023. 10. 17. 8:10",
      "content": "한국농업기술진흥원 지원으로 양액기 개발을 진행하고 있다. 올해 안으로 시제품 제작을 완료하고 이에 대한 국가 검정을 진행하고자 한다. 상추 재배와 더불어 장기적으로 양액재배 기술을 확보하는 것이 중요하다고 생각해서 시제품 제작에 나서고 있다. 양액이 순환되는 구조로 만들어서 가압식 펌프 하나로 제어하는 양액기를 개발하고 있다.\n신규로 개발한 양액기 전용 보드에 pH, EC 센서 데이터 변환기와 연결하고 데이터 수신 여부를 확인하고 있다. 매일 전선 짜르고 압착하고 다시 끼워서 결과 확인하는 작업을 반복하고 있다.\n그리고 제주농업기술원 요청으로 저렴한 중국산 유량센서를 구매했다. 기존 농가들이 유량센서 가격이 너무 비싸다는 불만이 많아서 이를 대체하기 위한 제품을 찾고 있었는데, 다행히 괜찮은 제품을 찾은 것 같다. 이번에 구매한 유량센서도 RS-485통신 테스트를 완료하고 이에 대한 설치를 진행하고 있다. 스마트팜은 절대로 쉬운 일이 아니다. 농업, 기계, 전기, 메카트로닉스을 다 알고 접근해야 한다. 이에 대한 기술은 점점 더 발전해 나갈 것이고, 맘꽃가든이 이를 보여주고자 한다.",
      "content_length": 557
    },
    {
      "id": "223237690272",
      "title": "2023.10.15 : 폐기하는 상추가 점점 늘어간다.",
      "date": "2023. 10. 16. 6:47",
      "content": "상추 재배를 하면서 이제 품질을 높이는 과정에 직면해 있다. 재배만 되면 끝난 것이라 생각했는데, 이제 상추의 품질이 눈에 들어온다. 파종, 육묘, 정식, 재배, 수확, 판매라는 기본 프로세스는 어느 정도 자리를 잡아 가는데, 소비자는 좀 더 높은 품질의 상추를 원하고 있다. 이게 진정 농부의 기술일 것이다. 그래서 인지 수확해서 판매하는 상추보다 폐기하는 상추가 점점 늘어간다. 품질을 올리고자 미리 좋지 않는 잎들은 제거하고, 추대된 상추들도 폐기하면서 작물 재배에 집중할 수 있는 환경을 만들고 있다.\n이렇게 폐기하는 상추들은 일단 농장 밖에 두고 있는데, 이를 유기질 비료로 재사용할 수 있는 방법을 추후에 찾아야 할 것 같다.\n그래도 신품종 재배도 계속 진행되고 있고, 이를 통해 재배 작물의 다양성도 확보하고자 한다.\n폐기한 로메인 상추 자리에 다시 심기위한 로메인이 자라고 있다. 재배 기간을 최소화해서 단위면적 당 수확면적을 높이는 것도 잘 진행되는 것 같다.\n내가 꿈꿔왔던, 작물 폐기와 수확인 순차적으로 자연스럽게 이어질 수 있는 농장이 되고 있다.",
      "content_length": 542
    },
    {
      "id": "223234882386",
      "title": "2023.10.12 : 제주농업기술원 시험포장 납품용 분전함 제작",
      "date": "2023. 10. 12. 18:01",
      "content": "제주농업기술원 시험포장 23개소에 설치할 분전함 제작을 시작하였다. 관수 기능을 슬라워 시스템과 연동해서 원격, 시간, 토양센서제어 등의 기능을 탑재, 테스트 할 예정이다. 이렇게 공식적으로 제주농업기술원에 납품하기까지 3년이라는 시간을 연구, 개발, 테스트하는데 보냈다. 이제 제주도에 클라우드형 스마트팜을 개발, 보급하기 위한 긴 여정에 하나의 발자국을 남기는 날이 왔으므로, 오늘도 열심히 하루를 보낸다.\n버마드 밸브 제어 기능에 맞춰서 배선 구조는 최대한 단순화 시키고 있다. 바로 연결하고 소프트웨어 업데이트 해서 모바일로 구성 테스트까지 완료했다.",
      "content_length": 312
    },
    {
      "id": "222975934467",
      "title": "2023.01.05 : 공공기상데이터 기반 공기순환팬 저전력화 시스템 실증 농장 설치",
      "date": "2023. 1. 5. 19:45",
      "content": "남원 정시철 농장 설치",
      "content_length": 12
    },
    {
      "id": "222974740744",
      "title": "2023.01.04 : 한국농업기술진흥원 강신호 본부장님 방문",
      "date": "2023. 1. 4. 15:38",
      "content": "2021년 입식재배시설 개발이 본격적으로 진행될 때부터 관심을 가져주시고 격려해 주시던 한국농업기술진흥원 벤처창업본부 관계자 분들이 방문해 주셨다. 특히 강신호 본부장님은 매년마다 사업진행 상황도 체크해 주시고, 문자로 응원해 주시곤 했는데 바쁜 제주 일정에도 연락을 주셔서 이렇게 기념사진을 촬영하게 되었다. 올해는 매출을 많이 올려서 수익 모델이 만들어지기를 바란다고 하시는데 대표로서 큰 책임감을 느낀다.^^; 이경원 팀장님과 윤영욱센터장님도 간만에 오셔서 이전보다 많이 발전했다고 하시니 힘이 난다. 스타트업 업체로서 새로운 길을 개척하는 것이 힘들고 버거워도 격려해 주시고 응원해 주시는 분들이 계셔서 올 한해도 진행형!!!!",
      "content_length": 355
    },
    {
      "id": "223000292007",
      "title": "2023.01.31 : 제주동부농업기술센터 기술보급과 방문",
      "date": "2023. 1. 31. 13:12",
      "content": "제주동부농업기술센터 기술보급과 김승현과장님과 김녕리 이용안 전 이장님께서 갑작스러운 서리피해 농가들이 많이 발생해서 입식재배시설 점검할 겸 방문해 주셨다. 다행히 날씨가 풀려서 상추가 금방 회복을 했는데, 그래도 농사가 쉽지 않음을 또 배운다.",
      "content_length": 136
    },
    {
      "id": "222997457289",
      "title": "2023.01.27 : 애월 키위 시설 농가 환경 정보 수집 장치 점검",
      "date": "2023. 1. 28. 19:18",
      "content": "2022년 제주농업기술원 감귤아열대과 공동 연구과제로 설치했던 키위 시설 농가 환경 정보 수집 장치 점검 차 방문을 하였다. 키위 수확은 대부분 11월 이전에 완료하는데 전정까지 마무리한 뒤라 그런지 농장들이 싸늘하다. 키위하우스는 감귤에 비해서 온습도 관리에 신경을 덜 써도 되고 인력도 적게 투입되는 작물이라 제주도에서 감귤하우스에서 키위로 전환하는 농가가 늘고 있다.",
      "content_length": 208
    },
    {
      "id": "222996307012",
      "title": "2023.01.27 : 연일 계속되는 한파에도 무사히 상추 수확 완료",
      "date": "2023. 1. 27. 19:30",
      "content": "연일에 계속되는 한파에 상추 가격이 많이 올랐다. 열심히 따야 한다. 일손은 없는데 주문은 많다. TT; 어쩔 수 없이 농장에서 반나절 정도 수확을 하였다. 다행히 상추가 동해를 입지 않고 잘 버티고 있어서 수확을 잘 진행하였다. 수확하기 전 상추 모습....\n수확 이후의 상추 모습.... 올해 봄 부터는 양면 비닐을 덮어서 재배할 예정이다.\n상품성은 역쉬 로메인 상추가 좋은 듯하다. 재배도 잘 되고... 점점 더 청상추 보다는 로메인으로 전환해야 겠다는 확신이 든다.\n계속 되는 한파에 내일도 수확 작업을 해야 하는데 날씨가 걱정이다. 농사는 쉬운게 없다!!!!! 입식재배라도 하니깐 그나마 추운 날씨에도 작업이 가능하다.",
      "content_length": 351
    },
    {
      "id": "222993979210",
      "title": "2022.03.28 : 동부자립형스마트팜 연구회 회원 조천 유인농원 양수기 모터 수리",
      "date": "2023. 1. 25. 18:35",
      "content": "[과거기록] 동부자립형스마트팜연구회 회원이신 조천 유인농원의 양수기가 파손되었다. 작동 시 소음이 너무 심해서 파손된 것으로 의심을 했는데, 내부를 분해해 보니, 베어링을 포함한 프로펠러가 아래처럼 파손되었다.\n참고로 농업에 사용되는 양수기 모터는 대부분 380V 3상 모터인데, 결선 방법은 Y결선과 델타 결선이 있다. 보통의 경우는 Y결선이다. 4,5,6번은 묶어주고 1,2,3번을 R,S,T에 연결하게 되는데 자세한 내용은 농업용 전기 교육을 받아야 한다.\n동일한 제품(을지 7.5마력 일체형)으로 구입했다.\n기존에 과부하로 인해 문제가 되었던 인입호스를 새 제품으로 교환하는 과정을 작업했다. 기본 호스 굵기가 60A 이상이라서 작업하기가 너무 어려웠다. 스마트팜은 이렇게 제어 자체가 문제가 아니라 개별 농장에 맞게 설치/유지/보수하는게 어렵다.",
      "content_length": 422
    },
    {
      "id": "222993947164",
      "title": "2022.03.24 : 황금콩밭 단호박 육묘장 육묘 결과",
      "date": "2023. 1. 25. 18:14",
      "content": "[과거기록] 지난 3월 초에 황금콩밭의 임병준 사장님께서 단호박 육묘장을 세우고 육묘를 마친 뒤 딱 3주 뒤에 다시 방문했다. 아래의 사진은 3월 2일 경에 육묘를 마친 상태다.\n3월 24일 경에 발아 및 육묘가 잘 되었는데, 계속 야간 온도를 맞추기 위해서 대포(? 전기 온풍기)를 가동했다고 하신다. 결론은 3단은 안되고 2단으로 하면 좋을 듯하다. 제일 아래 육묘 베드는 바닥으로 부터 60cm 전후, 그리고 두번째 베드는 140cm 전후에 설치하면 단호박 다단 육묘는 문제 없다는 결론...\n바닥에 너무 붙이면 전기 온풍기의 가온에 의해서 바닥쪽 육묘들이 빨리 성장하거나 상토가 마르는 경향 발생, 그리고 베드 사이 간격은 80cm 전후이면 채광에 상관없이 재배 가능한 것으로 확인되었다.\n끊임없이 연구하시고 시도해 보시는 연구회 회원분들이 정말 대단하시다. 특히 연구회 초대 회장이셨던 임병준 사장님의 열정이 느껴졌다.",
      "content_length": 463
    },
    {
      "id": "222989861817",
      "title": "2023.01.20 : 가변형 고설 베드 증설 작업 70% 완료 및 다구형 포트 입고",
      "date": "2023. 1. 20. 17:20",
      "content": "2월말까지 가변형 고설 재배 배드 증설 작업을 마무리 하기 위해서 노력중이다. 현재 70% 정도 작업이 완료되었다. 특히 가변형 프레임은 거의 조립이 완료되어서 다른 부자재들과 조립하는 과정이 남아있다. 2월달에도 부지런히 작업하면 봄부터 500평 규모에서 38,000주 상추 재배가 시작될 수 있을 것 같다.\n증설되는 가변형 고설재배 베드에 놓여질 다구형 포트도 입고 되었다. 물량은 1900세트인데, 이중에 일부는 다른 농가에서 시험하겠다고 해서 전달해 드렸다. 이번에 증설되는 물량으로 20,000주 정도 추가 재배가 가능할 것 같다. 설날이 다가오는것 보다 상추를 다 심을 날이 기다려진다.",
      "content_length": 334
    },
    {
      "id": "222972956648",
      "title": "2023.01.02 : 공공기상데이터, AWS, 온습도 데이터 동일 시계열 조회 방안 협의",
      "date": "2023. 1. 2. 18:53",
      "content": "맘꽃가든 시무식 겸 올 한해 주요한 개발 사항 중에 하나인 센서 데이터 동일 시계열 조회 방안에 대하여 협의하다. 간만에 다들 농장이 아닌 사무실에 모여서 IT 개발자 모드로 일하는 중...",
      "content_length": 106
    },
    {
      "id": "222988124417",
      "title": "2023.01.18 : 농장 현장용 실시간 알람 경광등 제어 모듈 10세트 제작",
      "date": "2023. 1. 18. 19:28",
      "content": "간만에 사무실이 제어모듈 세트 제작한다고 정신이 없다. 농민이 설정한 농장의 환경이 특정한 조건이 되면 서버에서 사용자 알람을 앱이나 웹에서 제공하는 기능과 별도로 경광등 또는 소리로 알려주는 기능을 개발했다. 그래서 샘플로 10세트 제작해서 맘꽃가든을 포함한 6개 농장에 시범 설치할 예정이다. 그래서 아침부터 제어모듈 조립한다고 사무실에 정신이 없다. 이제 센서랑 제어모듈 제작은 우리 맘대로 가능하다.",
      "content_length": 227
    },
    {
      "id": "222987972717",
      "title": "2023.01.17 : 제주 신촌 상추 재배 농가 방문",
      "date": "2023. 1. 18. 16:38",
      "content": "제주 신촌에 위치한 800평 규모의 상추 재배 농가를 방문하였다. 조대현 농장주(정림농장)께서 우리가 개발하고 있는 입식 재배 시설에 대해서 관심이 많으셔서 직접 맘꽃가든을 지인 농민들과 함께 방문한 적이 있었다. 그 때 본인 농장 초대를 해주셔서 전화를 드렸는데, 기꺼이 오라고 해서 직원들과 김녕 실증농장에서 사무실로 돌아가는 길에 방문을 하였다. 정림농장 대표이신 조대현 농장주께서는 20년 이상 상추를 재배하고 계시면서 새농민상도 수상하신 상추 재배 전문가이시다. 같이 상추 재배하고 제주시 농협에 납품하는 입장에서 동병상련의 동지애도 느끼고 20년 이상 농업기술을 개척해오신 농업 선배님으로서 존경심도 생기는 시간이었다. 특히 잎이 두껍고 품질이 좋은 여름용 상추 품종을 겨울에 재배해서 납품하는 기술을 가지고 계시는데, 존경할 뿐이다. 그리고 제주도에서 드문 층고 개폐 방식 하우스를 설치하셔서 여름 시기에도 온도 관리가 훨씬 쉽다고 하신다.\n이렇게 농업현장에서 농민들과 만나고 의견을 나누면서 더욱더 스마트팜은 \"작물재배\", \"재배시설\", \"시설제어\"가 함께 되어야 한다는 사실이다.",
      "content_length": 557
    },
    {
      "id": "222986878756",
      "title": "2023.01.17 : 공기순환팬 저전력화 연구용 하우스 구역 분리",
      "date": "2023. 1. 17. 14:15",
      "content": "시설하우스 내부 공기순환팬 구동 시간 단축을 목표를 제어알고리즘을 개발 중에 있는데, 이에 대한 실증을 위해서 구역 분리가 필요하다. 아침에 직원들과 비닐커튼으로 구역을 분리하였는데, 하우스 온도가 따뜻해 짐을 느낀다. 역시 제주도에서는 이중 보온 커튼만 있어도 난방 필요없이 작물 재배가 가능할 것 같다. 경험피셜....",
      "content_length": 180
    },
    {
      "id": "222986869115",
      "title": "2023.01.16 : 영농후계자 방문 및 입식재배 상담",
      "date": "2023. 1. 17. 14:04",
      "content": "구좌지역내 농민들의 방문이 계속 되고 있다. 오늘은 김녕리 전이장님과 영농후계자께서 방문하셔서 입식 재배에 대해서 상담을 하고 가셨다.... 김녕리 전이장님은 현재 1500평 정도의 깻잎과 상추를 재배하고 계신데, 고령화 및 좌식 농업의 문제로 점점 재배 농가가 줄고 있다고 걱정하시면서 직접 영농후계자를 데리고 오셨다. 노지형 밭작물 이랑 토경 시설 원예 사업은 위기에 있음을 현장에서 직접 느끼게 된다.",
      "content_length": 227
    },
    {
      "id": "222984235970",
      "title": "2023.01.13 : 제주농업기술원 밭작물 연구단지 노지 생육 조사용 무선인터넷 연결 방안 협의",
      "date": "2023. 1. 14. 17:42",
      "content": "제주도내 농업 시설중에 작년에 준공이 완료된 밭작물 연구단지를 방문했다. 스마트팜 연구과제를 지속적으로 함께 했던 김현수 연구사, 김동균 연구사와 실시간 노지 생육 상태를 조사하기 위해서 무선인터넷 연결 방안에 대해서 협의했다. 연구단지가 최근에 구축되어서 시설 중심부에 인터넷 라우터가 있는데, 노지 포장까지는 거리가 멀어서 PoE 모듈을 넣어서 최대한 거리를 뽑아도 될런지 판단이 되지 않았다. LTE 모뎀을 사용하면 위치에 제한을 받지 않지만, 광랜에 비해서 데이터 사용량 제한과 연결 불안정 문제가 있어서 생육 조사 시 문제가 될 가능성이 있을 것 같다. 다만 최근에 데이터 무제한 서비스도 있다고 하니깐 검토해 봐야 할 듯 하다. 노지 스마프팜은 관수제어나 생육 환경 모니터링만 하면 되는데 시설 스마트팜에 비해서 통신, 전기 인프라구축이 힘들다.",
      "content_length": 423
    },
    {
      "id": "222983119830",
      "title": "2023.01.13 : 한국농업기술진흥원 공공 R&D 지원 사업 참여 및 입식 재배 시설 견학 방문",
      "date": "2023. 1. 13. 11:17",
      "content": "2023년 새해 부터 너무 많은 일들이 있어서 블로그 글을 올릴 수 있는 상황이 되지 못했다. 이번 주에는 한국농업기술진흥원에서 진행하는 공공 R&D 지원 사업 참여 위해 전 직원들과 함께 사업 계획서 작성에 많은 시간을 보냈다. 이제 직원들과 함께 사업 계획서 작성도 하고, 이제 어엿한 스마트팜 개발 회사로 자리를 잡아 가는 것 같다. 이번 사업 참여 아이템은 관수 제어 부분이다.\n그리고 맘꽃가든이 개발한 입식 재배 시설에 관심을 가지고 있는 농가에서 방문해서 견학을 하고 싶다고 하셔서 농장 견학 가기 전에 담소를 나누는 시간을 가졌다.",
      "content_length": 304
    },
    {
      "id": "222983095828",
      "title": "2022.03.03 : 제주농업기술원 5번 실증 포장 테스트 제품 설치",
      "date": "2023. 1. 13. 10:51",
      "content": "[과거기록]제주농업기술원에는 다양한 작물 재배를 위한 실증 포장을 가지고 있다. 그 중에서 저비용 스마트팜 개발하면서 5번 실증 포장에 간단한 ESP32 제어 모듈과 온습도 환경 측정 모듈을 설치하였다. 점점 단순해 지는 MC 모듈 구성으로 스마트팜 제품 테스트를 완료하였다. 스마트팜의 핵심은 80% 소프트웨어, 20% 하드웨어 이다. 슬라워 시스템에서 장치 등록하고 바로 원격제어가 가능!!!!",
      "content_length": 222
    },
    {
      "id": "222983090282",
      "title": "2022.03.02 : 제주동부자립형스마트팜 연구회 황금콩밭 단호박 육묘장",
      "date": "2023. 1. 13. 10:45",
      "content": "[과거기록]제주동부자립형스마트팜 연구회 회원이신 황금콩밭 임병준 사장님께서 단호박 육묘장을 다단 베드로 만든 현장을 방문했다. 육묘장 지원 사업을 받아서 육묘장을 지으신 뒤에 직접 하우스 기자재를 구매해서 시설을 꾸미셨다고 한다. 약 한달정도 걸려서 진행되었는데 정말 대단하시다.\n원격 관수 제어는 슬라워 시스템을 사용하시는데, 그외 관련 설비는 직접 다 하셨다.\n이제 농사를 짓기 위해서는 농민이 직접 재배 시설을 세팅하거나 신규로 제작하지 않으면 안되는 시기가 도래한 것 같다. 다만 재배 결과로 확인해 보면 3단 보다는 2단 재배가 가장 적당한 다단 베드 구성으로 확인되었다.",
      "content_length": 325
    },
    {
      "id": "222950772568",
      "title": "2022.12.09 : 순환팬 저전력화 5번째 실증 농가 사전 방문",
      "date": "2022. 12. 9. 15:01",
      "content": "서귀포시 남원리에 위치한 농가에 구동기 통신노드 설치하기 전에 사전방문하였다. 그리고 WIFI 신호 확장기 및 외부기상대도 전달하고 왔다. 설치는 직접 하시는 걸로~~~~~~~\n현재 새한테크 제어함이랑 수직형 교반기를 사용하고 계시는데 슬라워 기반의 원격 제어 및 저전력화 순환팬 기능을 사용할 예정이다. 12월 말에 설치 끝내고 내년부터 구동 예정이다. 이제 실증 5개 농장 모집은 다 되었다..",
      "content_length": 222
    },
    {
      "id": "222950770704",
      "title": "2022.12.09 : 연구회 회원들과 제주동부농업기술센터 농촌지도사업 성과보고회 참여",
      "date": "2022. 12. 9. 14:58",
      "content": "제주동부농업기술센터에서 코로나로 인해 중단했던 농촌지도사업 성과보고회를 개최했다. 자립형 스마트팜 임원진 분들과 함께 참여했다. 김경익소장님의 인사말을 시작으로 2022년 추진 실적과 2023년 추진계획에 대해서 보고를 들었다. 밭작물팀의 고보성팀장님이 큰 상을 받으신 것도 다들 축하해 드렸다. 그런데 참가자분들의 평균 연령이 의외로 많이 높았다. 우리 스마트팜 회원분들이 젊은 축에 속했다. 마지막 토론 시간에도 농촌 사회의 고령화와 청년 농업인 유입 방안이 계속 언급되었다. --; 쉽지 않은 문제다. 청년들은 힘든일을 하지 않으려고 하는데, 규모있는 농장에 매칭만 한다고 될 일이 아닌 것을 농민이 스스로 문제제기를 하고 있다.\n우리 자립형스마트팜 연구회 창설이 성과 내용으로 올라왔다. 열심히 활동해야 겠다. 그리고 우리가 청년 농업인이다.",
      "content_length": 419
    },
    {
      "id": "222950207089",
      "title": "2022.12.08 : 스마트팜 ICT기자재 국가표준확산 사업 우수 기업 선정 기념 사진",
      "date": "2022. 12. 8. 22:02",
      "content": "2022년 5월부터 진행했던 스마트팜 ICT 기자재 국가표준 확산 지원 사업을 마무리했다. 스마트팜 국가표준 중에 KS X 3267 구동기 통신 노드, KS X 3268 메타데이터 국가표준을 적용하였다. 천측창 개폐기와 순환팬 제어와 관련된 구동기 통신 노드에 국가 표준 RS 485 레지스트리 맵 적용하였다. 다행히 연초 부터 설계 했던 하드웨어와 소프트웨어를 잘 적용해서 계획대로 잘 마무리 했다.\n그리고 제주 농업기술원과 자립형 스마트팜 연구회 4개 농가에 실증도 잘 완료하였다.\n이렇게 한해를 마치면서 감사하게도 지원 사업 성과보고회에서 우수기업으로 선정되었고 한국농업기술진흥원 안호근 원장님과 기념사진을 찍게 되었다.",
      "content_length": 350
    },
    {
      "id": "222949883797",
      "title": "2022.12.08 : 슬라워 모바일 앱 농장별 센서 알람 기능 개선 회의",
      "date": "2022. 12. 8. 17:38",
      "content": "슬라워 모바일 앱 농장별 센서 알람 기능을 개발한 뒤 개별 센서별 상한값, 하한값 설정에 따른 사용자 알람을 보내고 사후처리방안에 대한 방안 협의를 진행했다. 시설하우스 내부 온도가 높아서 사용자가 앱으로 알람을 받고 난 뒤에 하우스 온도가 바로 내려가지 않는 경우가 많기 때문에 5분 단위로 알람을 계속 받게 되면 사용자에게 스트레스가 될 수 있다. 그렇다고 한번 알람주고 추가 알람을 주지 않으면 문제가 더 커질수 있다. 이를 해결하기 위해 알람에 추가 옵션을 제공하기로 했다.\n추가 옵션은 해당 알람 발생 이후에 1시간, 3시간, 6시간, 12시간, 1일 알람 받지 않는 기능을 제공하기로 했다.\n해당 기능에 대해서 스마트팜 연구회 회원인 오동규 총무, 콩깍지농원 김성훈 대표, 박대리, 심팀장 이랑 같이 협의 했다.\n항상 프로그램 개발은 구현보다는 설계가 더 시간이 많이 걸린다. 제대로 된 설계가 이루어지지 않으면 사후 수정 보안에 시간이 더 많이 걸린다.",
      "content_length": 484
    },
    {
      "id": "222949080696",
      "title": "2022.12.06 : 제주ICT협동조합 회원 농가 관수제어 및 순환팬 저전력화 제어",
      "date": "2022. 12. 7. 19:20",
      "content": "제주ICT협동조합 회원 김영종 농가에 관수제어 모듈을 설치하기로 하였다. 밸브 3개에 펌프 1개를 제어하기로 하고 8채널 SSR 모듈이 내장된 보드를 제공했다. 농장주가 워낙 경력이 많은 실력자라 제어함만 설치하고 프로그램만 업로드 했다. 나머지는 농장주가 알아서 한다.\n이제 자립형 스마트팜이 제대로 된 모습을 보이는 것 같다. 스마트팜 개발 업체는 최소비용의 하드웨어와 소프트웨어만 제공하고\n나머지는 농민이 설치/유지/보수할 수 있는 시스템....\n김영종 농장주가 기존 시스템에서 필요한 제어선들을 직접 분리하고 있다.\n맘꽃가든은 단순하게 제어함만 설치!!!!! 야호 멋지다...\n그리고 순환팬 제어 시스템 설치 농가로 이동해서 원격/수동 전환 모듈을 추가 설치완료 하였다.\n이제 공공기상 데이터와 연동되어 만들어진 10분 단위 스케쥴러에 따라 자동으로 순환팬이 작동될 수 있다.",
      "content_length": 438
    },
    {
      "id": "222948995619",
      "title": "2022.12.07 : 제주고등학교 실습 교육 협의 및 프로그래머 방문",
      "date": "2022. 12. 7. 17:55",
      "content": "내년부터 제주고등학교에서 재학생 대상으로 실습교육을 하기로 하였다. 함께 교육 프로그램에 참여할 김성훈 이사님과 함께 제주고등학교 식물공장 시설을 확인했다. 블루베리 전정작업을 하고 계시던 김범준 사무국장님과 조일환 박사님께서 시설 설명 및 운영 프로그램 관련 설명을 해주셨다. 다단베드로 이루어진 식물공장은 현재 2,000개 정도 엽채류 재배가 가능한데, 운영할 인력이 없어서 고민이라고 하신다.\n국내 최고의 농업기술을 가지신 분들하고 이렇게 좋은 시설들에서 배울 수 있다면 좋을텐데, 학생들의 반응은 아직 그렇게 높지 않다고 하신다. --;\n우리가 풀어야 할 숙제는 학생의 관심 유도!!!!! 제일 어려울 거라고 하신다. ^^;\n식물공장에 사용될 양액시설들.. 원액통과 교반통들이 잘 배열되어 있다.\n그리고 조일환 박사님이 응애천적을 보여주셨다. 현재 제주고등학교 재배실습장은 천적으로만 병해충 관리하고 계시고, 약제는 전혀 쓰지 않고 있다고 하신다. 대단하시다.\n그리고 스마트팜에 관심을 가진 젊은 프로그래머가 방문해서 이런 저런 스마트팜 개발에 대한 얘기를 나누었다.",
      "content_length": 545
    },
    {
      "id": "222947373688",
      "title": "2019.05.27 : 실습교육장 자재 설치",
      "date": "2022. 12. 6. 9:20",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222947373423",
      "title": "2019.11.11 : 음수투약방식 관수 시설 물통 배치",
      "date": "2022. 12. 6. 9:19",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222947373057",
      "title": "2021.03.14 : 조천 유인농장 관수 시설 현황",
      "date": "2022. 12. 6. 9:19",
      "content": "제주동부농업기술센터 김승현 과장님의 소개로 조천 유인농장 관수 시설을 슬라워 시스템으로 전환하기로 하였다. 농장주께서 제주 유명약국 대표 약사님이신데, 주중에 약국 업무 때문에 농장 관리가 힘들다고 하셔서 원격으로 펌프와 밸브를 제어할 수 있도록 만들어 달라고 하셨다. 문제는 펌프 1대에 밸브는 4개.. 그리고 펌프와 밸브 사이의 거리가 150m 이상이다. 그리고 물탱크와 펌프의 길이는 20m 정도이다.\n그래서 7.5마력 삼상 을지 일체형 펌프를 사용하고 계신다.\n그래서 펌프가 작동할 때 밸브는 하나씩 열려야 하는데, 그 시퀀스를 맞추는 게 문제이다. 그리고 밸브와 펌프 사이의 거리가 너무 멀어서 원격 제어 위한 WIFI 신호를 연결하는게 쉽지가 않을 것 같다.\n그래서 제어함을 2개 제작하기로 하였다. 펌프제어함 2채널 1개, 밸브제어함 4채널1개... 그리고 WIFI 신호는 확장기를 통해서 두 군데에서 신호를 제공하는 것으로 하였다.\n그리고 밸브와 펌프간의 작동 시퀀스는 슬라워 시스템에서 제어하는 것으로 진행되었다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 574
    },
    {
      "id": "222946977999",
      "title": "2022.12.05 : KCTV 가변형 입식재배 시설 기술 소개",
      "date": "2022. 12. 5. 19:07",
      "content": "[영농정보] 상추농사도 쉽게…영농 혁신기술 도입\n농가 고령화와 고된 노동으로 요즘 상추농가가 많이 줄어들고 있습니다. 수익은 높은 편이지만 오랜시간 불편하게 앉아서 수확을 해야하기 때문에 기피 작물이 된건데요.제주의 한 스마트팜...\nwww.kctvjeju.com\nKCTV 영농 혁신 기술로 소개",
      "content_length": 165
    },
    {
      "id": "222946677751",
      "title": "2022.12.05 : 순환팬 저전력화 현장 실증 시작",
      "date": "2022. 12. 5. 14:04",
      "content": "순환팬 저전력화 현장 실증 시작... 콩깍지 농원, 리버티필드 농장",
      "content_length": 37
    },
    {
      "id": "222945563956",
      "title": "2022.12.04 : 제주ICT협동조합 농가 관수 제어 및 순환팬 자동/수동 전환 모듈 제작",
      "date": "2022. 12. 4. 13:01",
      "content": "제주ICT협동조합 조합원 농가에 설치할 관수 제어함과 순환팬 자동/수동 전환 모듈을 제작하고 있다.\n3개의 버마드 관수 밸브를 제어할건데, 8채널 릴레이를 온보드(OnBoard)화 해서 그런지 선이 엄청 단순해 졌다.\n이번에 ICT기자재 지원사업을 통해서 테스트하고 개선한 게 많은 도움이 된다.\n기술은 단순화하는게 제일 어렵다. 1.0SQ 파란색 선을 김녕 실증농장에 두고 오는 바람에 전체 연결을 다 마무리 하지 못했다.\n그래서 차주에 바로 설치해서 운영이 가능할 것 같다.\n그리고 또다른 회원 농가에서 실증할 순환팬 자동 제어 시스템의 자동/수동 전환 모듈을 제작하였다. 그 농가의 경우에는 수동, 기존 스마트팜 시스템, 슬라워... 이렇게 3개 시스템으로 전환 스위치를 만들어야 해서 아예 순환팬 작동 전원을 분리하는 3단 스위치랑, MC 제어 모듈을 적용하였다.\n스마트팜 시스템은 단순한데, 현장 적용이 너무 어렵다. 소프트웨어 개발하기도 힘든데, 현장 적용도 다 다르니깐,,,\n핸폰 앱만 개발해서 바로 사용할 수는 없을까? ㅋㅋㅋ\n파란색 1.0SQ 연선이 없어서 마무리는 내일해야 할 듯하다. --; 자재랑 공구를 사무실, 김녕실증농장, 연구회/협동조합 회원농가에 왔다 갔다하면서 설치하다보니 관리가 너무 힘들다.",
      "content_length": 629
    },
    {
      "id": "222970875774",
      "title": "2022.12.31 : 스마트팜 전문가가 백공이 되어야 하는 이유",
      "date": "2022. 12. 31. 11:19",
      "content": "스마트팜 기술을 개발하면서 작물재배, 재배시설, 시설제어를 융합하는 과정이 필요함을 매일 느끼고 있다. 농업용 시설 자재는 워낙 다양하고 품질이 제각각이다 보니깐 어디서 사고가 발생할지 모른다. 그러한 환경을 자동 제어한다는 것이 쉬운 일인가? 연속된 한파 이후에 날씨가 풀리다 보니깐 약한 관수용 자재가 파손되는 일이 발생하고 있다. ㅎㅎ\n접적 관수 T피팅 파손\n재생\n22\n좋아요\n0\n00:08\n\n접기/펴기\n접적 관수 T피팅 파손\n점적 관수 T피팅 파손\n재생\n14\n좋아요\n0\n00:05\n\n접기/펴기\n점적 관수 T피팅 파손\n이런 경우에 농민은 직접 보수를 해야 한다. 하지만 이런 일을 겪어보지 않은 초보 귀농인들은 여유 부품을 준비하지 못하는 경우가 많고 농자재상이 가까이 있지 않으면 낭패를 당하기 쉽다. 그래서 초보 귀농인들은 초기에 과도한 시설 투자하는 것에 신중을 기해야 한다.\n이제 스마트팜 전문가로서 백공의 길을 가고 있는 나에게는 이런 관수자재를 교체하는 것은 쉬운 일지만 누구나 쉽고 편하게 작물을 재배하게 하는 길은 결코 쉽지 않다. 오늘도 하나씩 하나씩 작물 재배하면서 2022년 마무리 한다.",
      "content_length": 567
    },
    {
      "id": "222969570892",
      "title": "2022.12.29 : 온도센서 릴레이 기반 천측창 개폐기 제어 시대가 저물어 간다.",
      "date": "2022. 12. 29. 20:21",
      "content": "제주시에서 거래하는 하우스 자재 업체를 방문했는데, 고장난 천측창 개폐기 제어함을 보게 되었다. 고장난 개폐기 제어함을 보니 이제 전기 릴레이 기반 제어 시대가 저물어 가지 않을까 한다.\n그리고 개페기 작동에 필요한 고용량의 24V트랜스.. ㅎㅎ",
      "content_length": 137
    },
    {
      "id": "222969502283",
      "title": "2022.12.29 : Flutter 로그인 유지, 공공기상데이터 조회 기능 및 공기순환팬 저전력 제어함 제작",
      "date": "2022. 12. 29. 18:31",
      "content": "카카오 OAuth 기능 개발 적용 이후 개별 농장 제어 시 부부가 각자 핸드폰에서 하나의 아이디로 로그인하기가 불편하다고 하셔서 로그인 유지 기능을 새롭게 접목했다. 그리고 사용자 설정에 따라서 공공 기상 데이터를 조회(현재값, 기간 설정 그래프)하고 경우에 따라서는 알람이 발생할 수 있는 기능을 개발 적용하였다.\n그리고 저전력화 모듈을 적용하기 위해 하드웨어를 구성하였다. 원격/기존 제어 전환 스위치를 포함해도 릴레이 1채널만 제어하면 되는 경우라 하드웨어가 단순해 졌다.\n기술이 발전함에 따라 점점 더 단순해 지는 모듈을 개발 적용이 가능할 듯.....",
      "content_length": 313
    },
    {
      "id": "222968245329",
      "title": "2021.04.28 : 동부자립형스마트팜 연구회 현장 실습용 제어함 제작",
      "date": "2022. 12. 28. 15:53",
      "content": "동부자립형스마트팜 연구회 현장 실습용 제어함 5종을 제작하였다.",
      "content_length": 35
    },
    {
      "id": "222966863702",
      "title": "2021.04.21 : 제주농업기술원 저비용 스마트팜 설치 작업",
      "date": "2022. 12. 27. 9:02",
      "content": "[과거기록] 제주농업기술원 저비용 스마트팜 실증을 위해서 4번 실증 포장에 하드웨어 설치 작업을 진행했다. 기존의 스마트팜 시스템에서 전원을 분리한 뒤 전원차단함과 제어함을 분리해서 원격 제어 및 환경 측정 실증을 진행했다.\n관수 밸브도 김현수 연구사와 함께 추가로 밸콘 50A 모듈을 구입해서 원격 제어 테스트를 진행했다. 스마트팜을 구축하기 위해서 농민들은 백공이 되어야 한다. 관수 시설 설치, 유지/보수도 직접해야 한다.",
      "content_length": 239
    },
    {
      "id": "222966860358",
      "title": "2021.04.14 : 동부자립형 스마트팜연구회 야간 교육",
      "date": "2022. 12. 27. 8:57",
      "content": "[과거기록] 동부자립형스마트팜연구회 회원분들과 함께 지금까지 구성했던 제어 보드를 기반으로 슬라워 시스템에 접속해서 각자 제어하는 실습을 진행했다. 슬라워 시스템에 등록된 개별 농장/사용자 정보를 기반으로 로그인 한 뒤 개별 제어함을 핸드폰으로 제어하는 교육을 실시했다.\n그리고 황금콩밭 임병준 사장님께서 밧데리 기반의 전동분무기 제품에 대해서 궁금해 하셔서 농자재 마트에서 해당 펌프 사양을 확인했다.",
      "content_length": 225
    },
    {
      "id": "222966856950",
      "title": "2021.04.07 : 제주농업기술원 저비용 스마트팜 하드웨어 조립",
      "date": "2022. 12. 27. 8:50",
      "content": "[과거기록] 제주농업기술원 김현수 연구사와 함께 ESP32 보드를 이용한 저비용 스마트팜 하드웨어 조립을 진행했다. 제어 시스템은 Apache 웹서버에 php 기반으로 화면 제공한 시스템을 구성하기로 하였다. 그래서 DB의 명령 정보를 ESP32가 읽어서 작동하고 제어하는 것으로 목표로 한다. 그리고 동일한 서버에 환경 측정 데이터도 실시간으로 저장하기로 하였다.\n그리고 기존에 많이 쓰던 버마드 관수 밸브 대신에 밸콘의 전동형 관수 밸브를 설치해서 제어하는 것을 테스트 함.",
      "content_length": 267
    },
    {
      "id": "222965182193",
      "title": "2022.12.25 : 크리스마스 고설 베드 증설 작업 실시",
      "date": "2022. 12. 25. 17:02",
      "content": "오늘도 농장와서 고설베드 증설 작업 공정 60% 진행 완료.. 1월 말이면 450평 기준으로 38,000주 재배가 시작된다.. 기대된다..",
      "content_length": 77
    },
    {
      "id": "222965180588",
      "title": "2022.12.23 : 한국생산기술연구원 제주본부 사업 설명회 참석",
      "date": "2022. 12. 25. 16:59",
      "content": "메종글래드 호텔에서 한국생산기술연구원 제주본부 사업 설명회 참석하다. 엽채류 재배 기술이 안정화되면 기능성 작물을 재배할 예정이다. 천천히 하나씩 만들어 가다보면 건강기능식품 가공까지 진출하지 않을까? 10년 뒤의 맘꽃가든을 위해서 하나씩 하나씩 진행한다.",
      "content_length": 143
    },
    {
      "id": "222965179477",
      "title": "2022.08.21 : 표선면 가시리 키위 재배 농가 방문",
      "date": "2022. 12. 25. 16:57",
      "content": "[과거기록] 제주농업기술원 의뢰로 표선면 가시리 키위 재배 농가를 방문.. 형제가 3000평 정도의 키위 하우스 운영중. 기존 개폐시스템을 원격제어로 바꾸려고 함. 하우스가 워낙 길어서 천창 개폐기 작동 시에 비닐이 일정하게 올라가지 않는다고 한다. 매번 체크를 한다고.. --; 하우스 설계가 잘못되어서 개폐기함도 두개로 분리 설치되어서 어떻게 통합해야? ㅎㅎ",
      "content_length": 202
    },
    {
      "id": "222962917907",
      "title": "2021.05.13 : 동부자립형스마트팜 연구회 회원 농가 관수 원격 제어",
      "date": "2022. 12. 22. 19:08",
      "content": "[과거기록] ESP8266 제어 보드 기반으로 밸브 2종, 펌프2종 총 4개의 릴레이 채널을 제어하는 시스템을 설치하다. 자세히 보면 보드가 보이지 않을 정도로 기존 전기 제어 시스템에 릴레이 신호만 주는 것으로 테스트를 시작했다.\n중요한 것은 펌프 ON/OFF와 밸브 OPEN/CLOSE가 유기적으로 맞아야 한다는 것... 즉 펌프가 작동되기 전에 항상 밸브는 열려있어야 하고, 펌프가 꺼지고 나면 밸브가 잠겨야 한다.\n물론 MC의 A, B 접점을 이용한 전기적 회로 구성을 통해서 구현할 수 있지만, 1대 펌프, 다수 밸브 일경우에는 복잡하다. 이를 소프트웨어로만 밸브 스케쥴을 통해서 제어될 수 있도록 하는게 이번 테스트의 핵심 목표이다.\n이를 구현하기 위해서 Spring Framework의 Scheduler 기능을 사용했는데, 해당 Task의 Start, End Thread가 맞지 않아서 고생을 했다.\n다행히 회원 농가가 항상 작동 여부 및 오류를 체크해 줘서 큰 사고없이 테스트가 진행되었다.\n결과는 80% 성공이다. 중간에 밸브 안 열렸는데, 펌프 작동해서 오류가 발생했다. 이렇게 하면서 잡아가는 거지..\n아래 그림처럼 기존의 수동 스위치 방식을 원격 스케쥴 관수 전용 프로그램으로 제어하는 형태로 바꿨다. 이번 작업을 하면서 스마트팜은 하드웨어 구성보다 소프트웨어 사용자 친화적이어야하며 신뢰성이 훨씬 중요함을 느낀다.",
      "content_length": 692
    },
    {
      "id": "222962910373",
      "title": "2022.09.11 : 슬라워 현장 실증용 구동기 제어함 제작",
      "date": "2022. 12. 22. 18:56",
      "content": "[과거기록] 슬라워 현장 실증용 구동기 제어함 제작 : 5개 농가 중 3개 농가 설치를 완료하고 추가 2개 농가용 제어함 제작..\n제작은 주요 부품 배치 부터....",
      "content_length": 92
    },
    {
      "id": "222962052838",
      "title": "2022.08.28 : 다단육묘베드 LED 시간 제어 방법",
      "date": "2022. 12. 21. 19:40",
      "content": "[과거기록] 총 5기의 다단육묘베드를 만들었다. 한번에 배치될 수 있는 105구 육묘판 기준으로 300개를 설치할 수 있다. 모종 개수로 따지면 31,500개를 별도의 육묘장 없이 파종할 수 있다. 맘꽃가든 입식재배 시설에 총 38,000개의 상추를 정식할 수 있기 때문에 작물을 재배하면서 한번에 육묘할 수 있는 시설로는 충분하다. 저면관수 형태라 작물 생육에도 크게 문제가 되지 않았다. 다만 다단베드의 단점으로서 일사량 부족을 보강하기 위해 식물전용 LED를 설치했다. 기존 식물공장 설치 대수에 비해서는 1/2 정도 밖에 되지 않지만 아직도 LED 가격이 비싸고(더 올라감? --;) 햇빛이 완전히 차단된 공간이 아니기 때문에 베드당 4개씩 설치했다.\n청상추, 로메인, 청경채 대부분의 엽채류 파종 및 육묘에 있어서 크게 지장은 없었다. 다만 온도가 맞지 않을 경우 발아 및 성장에 문제가 있다.\n이는 냉난방 시설 비용만 일부 추가하면 문제가 없을 것 같다.\n여기에서 LED 제어를 원격제어로 할 것인가? Timer 제어로 할것인가를 고민하다가 결국 Timer 제어로 배선을 구성했다. 물론 이전에 원격제어 테스트는 다 완료했지만 아무래도 LED On/Off 제어는 변동사항이 많지 않을 것 같아서 기존 전기 제어 Timer를 이용해서 제어했다.\n다만 베드별로 적용/여부를 결정할 2단 스위치를 달았다. 스마트팜에 있어서 제어영역은 끝이 없다. 인공지능/빅데이터를 이용하고 싶으면 높은 설치 비용을 적용하면 된다. 하지만 다단육묘베드에 냉난방 설치할 비용도 없는데, 육묘용 인공지능/빅데이터 시스템을 구성하는 것은 우리 농업 실정에 맞지 않다. 농업인이 재배하는 작물 및 시스템에 맞는 적절한 하드웨어 구성을 하는 것이 꼭 필요할 것 같다.\n3달 가까지 육묘를 계속 테스트하고 있지만 식물 LED 적용은 크게 문제가 되지 않았고, 파종 이후 암발아를 적용하거나, 육묘 시 최저/최고 온도를 유지하는 장치를 추가 설치 보완해야 할 것 같다. 내년에 상추 팔아서 돈벌며 설치할 시설이 너무 많다. ^^;",
      "content_length": 1011
    },
    {
      "id": "222961227753",
      "title": "2022.12.20 : 슬라워 데이터 EPIS 연계 테스트",
      "date": "2022. 12. 20. 21:25",
      "content": "슬라워 시스템에 대한 국가표준검정을 완료하고 스마트팜코리아 장치 등록을 진행하고 있다. 정부 인증 스마트팜 장치가 되기 위해서는 스마트팜코리아에 업체 및 장비 등록을 완료하여야 한다. 관련 자료 및 시스템 개발을 완료하고 심팀장과 함께 EPIS(농촌진흥청 빅데이터 수집 시스템) 연계 테스트 결과에 대한 회의를 했다. 일단 XML 기반의 SOAP 기술을 사용하여 규격서에 맞는 장치 운영 로그나 센서 측정 데이터를 서버로 전달하면 된다. 사실 최근에는 Restful API 기반으로 구동되는 서비스가 많은데, 일단 SOAP 기능을 적용해야 해서 간단하게 테스트하고 작업을 완료하였다.\nSOAPURL를 이용하여 간단하게 샘플 데이터 전송 방법을 확인했고, Spring Framework 해당 Controller를 개발 적용해서 2분 간격(스마트팜코리아규정)으로 Scheduler 서비스를 통해 데이터를 전달하게 했다.\n데이터 전송 구조는 아래와 같다. 슬라워 시스템에서 SOAP 서비스를 구동하지 않아도 되며, EPIS시스템의 SOAP를 호출해서 데이터 전송 결과를 받기만 하면 된다. 기본적으로 Device에서 슬라워 시스템으로 장치구동명령/상태, 센서측정값을 JSON으로 던지는데, 이를 다시 슬라워에서 EPIS에 데이터를 보내기 위해서는 XML 파일 형식으로 변환해야 해서 별도의 파싱 통해 바인딩 시키는 것이 필요하다. 이 부분만 Controller에서 신경써야 될 부분인 것 같다.\n농정원 EPIS 담당자와 확인한 결과 데이터가 잘 올라온다고 확인하고 이렇게 농정원 ICT 정보서비스연계는 마무리 될 것 같다.",
      "content_length": 793
    },
    {
      "id": "222960380223",
      "title": "2022.06.12 : RS485 토양센서 및 텐시오미터 구매",
      "date": "2022. 12. 19. 22:26",
      "content": "[과거기록] 토양 온습도를 측정하는 미래센서(WT1000A)를 연초에 대량 구매해서 설치했는데, 우여곡절이 너무 많았다. 결론적으로 가격과 품질면에서 만족스럽지 못했다. 지반 구성이 워낙 다양한 제주도 지형에서 토양센서를 이용해 재배환경 및 생육 상태를 분석하는게 쉽지가 않다. 그래서 이번에 저가형 중국산 토양센서를 구매해서 테스트하기로 했다. 국내 모 대기업 스마트팜에서 사용하는 토양센서와 동일한 모델로 알고 있어서 구매했다. 출력 결과는 RS485 MODBUS로 토양 온도, 습도, EC, PH가 순차적으로 출력되어 나온다.\n온도, 습도, EC 결과값은 좋은데, PH값이 안맞다. 일부 센서는 결과값이 나오고, 일부 센서는 안 나온다. 아무래도 RS485 통신 모듈 특성을 타는 것 같다.\n제주농업기술원에서 토양의 수분량 보다는 수분장력에 대한 분석이 더 필요하다고 텐시오미터 구입을 요청해서 추가 구입하였다. 주기적으로 물을 공급해야 하는데, 추후에 설치 내용에 대한 상세 글을 올릴겠다.\n수분장력을 원격으로 측정하는 텐시오미터를 내년에 구입할까 한다. 대당 백만원이 넘는데,,, --;",
      "content_length": 557
    },
    {
      "id": "222958907198",
      "title": "2022.12.8 : 동복리 다단재배베드 설치 농가 방문",
      "date": "2022. 12. 18. 13:50",
      "content": "제주 농업 마이스터 대학 출신이신 김보균 사장님께서 동복리에 다단재배베드를 설치하시고 시설 설치 자문을 요청하셔서 직접 농가를 방문하였다. 하우스도 직접 지으시고 3단으로 재배 베드도 직접 설치하셨다고 하신다. 열정이 대단하시다.\n방문하는 현장에서 지금은 퇴직하신 이용철 제주도 보건복지여성 국장님도 함께 만나서 아이디어를 실현하는 방안에 대한 얘기도 나누었다.\n이런 분들을 만나면서 하루 하루를 헛되이 보낼 수 없음을 느낀다. 나에게 너무 젊고 할일이 많다고 하시니.... ^^;\n이번에 제작한 다구형포트를 드렸는데, 이렇게 설치하셔서 재배를 해 보시겠다고 하신다. 추가 주문을 할 때 사장님께 전달할 물량도 주문해야 할 것 같다.\n직접 용접으로 제작 설치하셨다고 하신다. 내가 바라던, 농민 스스로 설치, 유지/보수가 가능한 재배 시스템 구축이 멀지 않음을 느낀다.",
      "content_length": 430
    },
    {
      "id": "222957701204",
      "title": "2022.04.12 : 일사량 센서 apogee sp-110-ss 구입 및 측정 모듈 제작",
      "date": "2022. 12. 16. 19:51",
      "content": "[과거기록]제주농업기술원 감귤아열대연구과 공동 연구 과제로 애월 지역 3개 키위 농가의 온도, 습도, 일사량을 측정하기로 하였다. 일반적인 조도 센서가 아닌 일사량을 측정하기 위해서 apogee sp-110-ss 모델을 구입했다. Self-powered 타입이라서 별도의 전원은 필요치 않지만, 측정 결과가 analog voltage로 나오는 데 이를 증폭해야 그나마 결과값이 나올 수 있어서 측정 전압 증폭 모듈을 개발해서 연결시켰다.\n센서들마다 측정 신뢰도도 문제지만 데이터 취득 방법도 달라서 다 맞춰주기가 쉽지 않다. 특히 보정(Calibration.....) 지적할려면 끝이 없는 부분이다.... 좋은 센서 쓰면 당연히 신뢰도가 높지만 싸고 신뢰도 높은 센서를 찾는게 일이다..^^;\n데이터 취득해서 서버로 데이터 보내는 것은 너무 잘된다.",
      "content_length": 419
    },
    {
      "id": "222957695667",
      "title": "2022.04.01 : 맘꽃가든 제주대학교 창업보육센터 입주 기록",
      "date": "2022. 12. 16. 19:42",
      "content": "[과거기록] 제주대학교 창업기업 입주 평가에서 우수한 성적(2등)을 받아서 한라산 전망이 있는 4층에 입주하게 되었다. 16평형인데, 외부 베란다까지 있어서 저렴한 비용에 사무실로 쓰기에는 딱 안성맞춤이다. 4명이서 자리를 만들고 의자도 배치하고 세팅하는데 2주가 걸린 것 같다.\n입주하기 전 상태다.... 무엇보다도 전망도 좋고 밝아서 직원들이 좋아한다.\n회사 명패도 제작해서 달았다. 직접 제작함.. ^^; 1만원도 안 들었다.\n사무실 가구 배치뿐만 아니라, 가구 배치도 직접 다 제작함.\n김녕에 있던 자재들을 하나씩 옮기면서 세팅을 하고 있다.\n사무실 세팅 이후에 첫 외부인 방문 및 미팅... 이제 어엿한 사무실 역할을 하고 있다.",
      "content_length": 357
    },
    {
      "id": "222956713419",
      "title": "2022.12.15 : 동계 시즌 청상추 로메인 수확",
      "date": "2022. 12. 15. 20:01",
      "content": "어제의 추운 날씨에도 별탈없이 잘 지나가고 오늘은 하우스 내부 온도가 20도를 넘어갔다. 다행히 청상추, 로메인 수확도 필요해서 김팀장을 포함한 개발자들이 상추 수확에 시간을 보내고 있다. 박대리는 재배에 들어간 뒤 2달이 넘도록 노트북을 켜지도 못한다고 하소연을 했다. ^^;\n그래도 스마트팜 개발자라면 작물 재배가 더 중요하다는 것을 공감하고 있기에 누구보다도 열심히 작물 재배에 나서고 있다.\n박대리가 수확해서 가지런히 놓여진 상추박스.. 이제 수확/포장 전문가가 되었다. 언젠가 본인의 농장을 운영하고 싶다고 하는데, 잘 공부하고 준비해 가기를 바란다.",
      "content_length": 313
    },
    {
      "id": "222956710822",
      "title": "[공지] 2022.12.15 : 동부 디지털 농업 연구회 활동 및 스마트팜 ICT 기자재 국가표준 확산 홍보영상 (Feat. 한국농업기술진흥원, 제주농업기술원)",
      "date": "2022. 12. 15. 19:57",
      "content": "2022년 맘꽃가든과 동부 디지털 농업 연구회 활동 홍보 영상을 찍었는데, 그 결과가 나왔다. 한국농업기술진흥원에서 진행했던 2022년 스마트팜 ICT기자재 국가표준 확산 지원 사업에서 우수기업으로 선정되고 활동에 대한 평가가 좋아서, 동부 디지털 농업 연구회 분들과 함께 홍보 동영상을 찍었다. 내가 스마트팜을 시작하면서 가지게 되었던 목표, 즉 청장년 세대의 지속적인 농업 활동 실현이 가까워 지고 있는 것 같다.\n(1) 스마트팜 개발은 작물 재배, 재배 시설, 시설 제어가 함께 되어야 한다.\n(2) 스마트팜 사용자인 농민이 직접 구매, 설치, 유지/보수가 되어야 한다.\n스마트팜이 냉장고처럼 전원만 꽂으면 작동되는 날이 오기 위해서는 개별 농장이 사전에 준비가 되어 있어야 하는데, 내가 봐온 농장 중에 똑같은 농장은 단 한군데도 없었다. 사용자를 포함해서 장치를 설치/관리해야 하는 경우의 수가 너무 많다. 이래서 세계 최고의 IT 업체를 가진 대한민국이 아직 스마트팜을 확산/보급하지 못하고 있다.\n언젠가 농민이 편하게 구매하고, 설치, 유지/보수하는 날이 오기를 희망하며, 하루 하루 도전한다.\n맘꽃가든_동부자립형스마트팜 연구회 홍보영상\n재생\n48\n좋아요\n0\n02:11\n\n접기/펴기\n맘꽃가든_동부자립형스마트팜 연구회, 2022년 스마트팜 ICT기자재 국가표준 확산 지원사업 자료",
      "content_length": 666
    },
    {
      "id": "222955834322",
      "title": "2022.09.16 : 동부 자립형 스마트팜 연구회 전기 기초 기술 교육",
      "date": "2022. 12. 14. 22:09",
      "content": "[과거기록] 제주ICT협동조합 교육장에서 실시된 동부자립형스마트팜 연구회 전기 기초 교육",
      "content_length": 49
    },
    {
      "id": "222955829565",
      "title": "2022.08.27 : 하절기 청상추 파종 및 발아",
      "date": "2022. 12. 14. 22:02",
      "content": "[과거기록] 지난 여름 하절기 청상추 파종 및 육묘 베드 발아 기록",
      "content_length": 37
    },
    {
      "id": "222954814471",
      "title": "2022.12.13 : 가변형 입식재배베드 확장 작업 실시",
      "date": "2022. 12. 13. 20:39",
      "content": "외부 활동이 잦아지면서 잠시 중단했던 가변형 입식재배베드 확장 작업을 진행했다. 김팀장이랑 진행하고 있는데, 기존에 가지고 있던 부품을 가지고 고정부 영역은 작업을 다 끝냈고, 이제는 가변부 프레임을 설치하고 있다. 예상 기간은 둘이서 작업하면 1달 이내에 끝날 수 있을 것 같은데, 주문한 부품 도착 시기와 연말 행사로 좀 더 시간이 걸리지 않을까 한다.\n가변부에 15A 파이프를 놓아서 조립을 하나씩 진행하고 있다. 내년 여름, 450평 실증포장에 35,000주 상추를 정식/수확 하는걸 목표로 차근차근 진행하고 있다.",
      "content_length": 292
    },
    {
      "id": "222954811139",
      "title": "2022.03.05 : 슬라워 전용 보드 제작 기록",
      "date": "2022. 12. 13. 20:34",
      "content": "[과거기록] ESP32와 아두이노 메가 기반으로 다단육묘베드와 밸브를 제어했는데, 배선 등의 문제가 많아서 슬라워 전용 보드를 제작하였다. 아래의 보드는 2020년 부터 테스트 해 왔던 보드들이다. 아두이노 IDE 기반으로 프로그램을 짜서 이런 저런 센서 측정 및 제어 로직을 파악하는데 많은 도움이 되었다.\n이번에 별도로 온습도센서, 감우센서, 일사량센서, 토양온습도 센서 등 다양한 센서 데이터를 받을 수 있는 환경 측정용 보드를 제작했다. 디지털, 아날로그 둘 다 지원이 가능하게 했다.\n그리고 릴레이와 모터드라이브를 제어할 수 있도록 16채널 제어보드도 제작하였다. 테스트 결과 작동은 잘된다. 그리고 선 연결도 깔끔해졌다.\n스마트팜에 있어서 중요한 것은 이제 하드웨어보다는 소프트웨어...\nWAS 서버의 역할이 제일 중요할 듯....",
      "content_length": 415
    },
    {
      "id": "222953595603",
      "title": "2022.12.12 : 청년 연구사/퇴임 연구관 만남 자리 (제주고등학교 재배실습장)",
      "date": "2022. 12. 12. 18:59",
      "content": "2020년 부터 함께 공동연구해 왔던 김현수 연구사와 함께 제주고등학교 재배실습장을 방문했다. 조일환 박사님과 김범준 사무국장님을 소개드릴 겸 해서 만남의 자리를 만들었다. 청년 연구사와 퇴임 연구관의 만남 자리라 나름 걱정은 되었는데, 스마트팜이라는 주제로 심도깊은 얘기를 나눌 수 있어서 어떻게 시간이 지나갔는지도 모르겠다.\n핸드폰으로 원격 제어/환경 측정만을 가지고 스마트팜이라 할수 없고, 빅데이터/인공지능도 작물 재배/생체 분석 없이 의미가 없다는 것에 다들 공감을 하였다. 특히 시설하우스 작물 재배가 보편화 되는 상황에서는 작물 생육에 필요한 최소의 에너지(난방/냉방)를 투입할 수 있는 적정 기술이 제일 필요하지 않겠냐고 조언을 해주셨다. 스마트팜 기술이 적용할 수 있는 영역이 기대도 높고 넓지만, 막상 최적화된 적정 기술은 아직 만들어지지 못하고 있는 것이다.\n입식재배, 원격제어, 환경측정은 완성을 했는데, 이제 작물 생육에 필요한 최적화된 에너지를 투입하는 적정기술연구 과제를 시작해야 한다.\n자연을 다루는 일은 시간이 오래 걸린다. 그래도 한걸음씩 한걸음씩 나아가다보면 오늘 만남의 자리와 같이 청장년 세대가 함께 어우러져 우리나라 농업의 미래를 개척해 나아갈 것이다.",
      "content_length": 611
    },
    {
      "id": "222952330475",
      "title": "2022.12.11 : 입식재배 시설 YTN 전국방송 타다 (Feat. 제주동부농업기술센터)",
      "date": "2022. 12. 11. 13:52",
      "content": "일요일 아침부터 지인들에게 여러 통의 전화가 왔다. 심지어 아내의 지인들이 아내한테 남편이 방송에 나오고 있다고....... 제주동부농업기술센터 김정우 지도사와 함께 KCTV 방송을 찍고 나서 따로 연락을 받지 못했는데, YTN 전국 방송에 나오고 있다는 것이다. 저녁 늦게까지 여러번 나온 것 같아서 많은 분들이 연락을 주셨는데, 감사드린다.\n동영상에 달려 있는 여러 댓글들을 보면서 여러 생각을 한다. 용접했다고 스마트팜이냐? 레일에 바퀴달아서 움직이는 게 무슨 특허냐? 시설비 많이 들어서 상추재배하면 무슨 소용이 있느냐 등등.... ^^; 다 공감하는 얘기다.\n나도 다른 누군가가 레일 위에 바퀴달고 용접만 해서 시설을 만들었다면 특허 낼 일도 없고, 스마트팜이 아니라고 말할 것이다.\n이렇게 짧은 시간에 방송 나와서 모든 걸 다 설명할 수는 없을 것이다. 여하튼 다들 관심을 가져 주시는 것만으로도 너무 감사드린다.\nhttps://youtu.be/qBUpBisZxXU",
      "content_length": 490
    },
    {
      "id": "222951819289",
      "title": "2022.12.10 : 동부 자립형 스마트팜 연구회 회원/소프트웨어 개발자 방문",
      "date": "2022. 12. 10. 19:31",
      "content": "주말인데도 맘꽃가든에 방문하시는 분들이 많이 생겼다. 동부자립형스마트팜 연구회 회원이신 채희용 사장님, 심인보 사장님, 그리고 지인분이 먼저 오셔서 간만에 얼굴도 뵙고 담소도 나누고 있었다. 세분다 스마트팜에 관심이 많으셔서 이런 저런 얘기를 나누고 있는데....\n일전에 약속했던 제주도에 거주하고 있는 임창진 대표를 포함한 개발자분들이 방문을 하셨다. 국제학교 부근에 지인분께서 부지를 제공해서 시설하우스를 짓고 스마트팜을 운영해 보고자 하는데, 자문을 구하고 싶다고 방문하셨다. 이런 저런 개발 얘기를 나누다 보니, 옛날 추억도 많이 난다.\n개발자는 소프트웨어 개발만 해야된다는 게 공감대!!!!... 농사는 다른 세상이다!!!!",
      "content_length": 354
    },
    {
      "id": "222942879848",
      "title": "2022.12.01 : 슬라워 모바일 앱 알람 기능 완성",
      "date": "2022. 12. 1. 7:55",
      "content": "SpringFramework 기반에서 개발된 슬라워 시스템의 모바일 앱 알람 기능이 완성되었다. 앱 자체는 하이브리드 개발 시스템인 플러터(Flutter)를 사용하였다. 다음에 기회가 되면 상세히 내용을 적을 것이다.\n동부자립형스마트팜 회원분들한테는 앱 설치를 해드렸다. 클라우드형 스마트팜 이라서 AWS에서 운영되고 있으며 기본적인 환경 데이터 모니터링 및 장치 제어는 다 가능하다.\n이번에 Firebase 기반의 Token 형태로 개별농장 사용자에게 알람이 전달되는 기능을 완성하고 배포하였다.\n알람이 사용자에게 전달되는 과정은 3가지이다.\n1. 등록하신 장치중 서버에 등록만 되어 있고 사용하지 않거나 실제로 사용 중이신 장치인 경우에 문제가 발생된 장치를 체크하여 장치이름 리스트가 알람으로 전송된다.\n2. 센서 데이터가 30분간 데이터가 갱신되지 않을 경우, 알람이 발송된다.\n3. 알람설정된 센서의 측정치가 상한값 또는 하한값을 넘을 경우, 알람이 발송된다.\n이 세가지 경우만 해도 농장 운영에 크게 문제가 없을 것으로 판단된다. 물론 CCTV와 외부기상대 설치를 권장한다. 가격도 저렴하고 농민들이 스스로 접근이 가능하다.",
      "content_length": 579
    },
    {
      "id": "222943305917",
      "title": "2022.12.01 : KCTV 상추 재배시설 촬영(차주 월요일 정규 뉴스 방송)",
      "date": "2022. 12. 1. 16:44",
      "content": "제주동부농업기술센터 김정우 지도사와 함께 제주 동부 지역 상추 재배 현황 및 입식재배시설 소개 관련 촬영을 진행하였다.\n근래에 들어서 계속 맘꽃가든에서 개발한 가변형 입식재배시설에 대한 관심이 높아지고 있다. 기존 고정형 대비 1.5배 재배 면적이 늘어나는 것을 직접 현장에서 확인하신 분들이 많아지다보니 착실히 기술 개발에 매진해야 함을 느낀다.\n제주동부농업기술센터 밭작물팀의 김정우 지도사가 열심히 제주 동부지역 상추 재배 농가 현황을 얘기하고 있다.\n기존 재배면적이 농촌인구고령화와 연작피해등으로 50% 이상 감소했다는 얘기에 다들 걱정을 한다.\n장모님이 입식재배로 수확, 포장하고 있는 장면을 촬영하고 있다.\n맘꽃가든이 생각하는 농업 방식에 대해서 인터뷰하고 있다. 청장년 세대의 지속적인 농업 활동 환경 구축을 목표로 하고 있기에 입식재배와 저비용 스마트팜 시스템 구축은 꼭 필요하다.",
      "content_length": 444
    },
    {
      "id": "222943141060",
      "title": "2019.05.25 : 실습교육장 이구형 수도꼭지 구매 및 의자 배치",
      "date": "2022. 12. 1. 13:56",
      "content": "실습교육장에 사용될 이구형 수도꼭지와 수전부품을 구매하다. 이제 수도시설 및 씽크대 부품 교체정도는 충분히 가능하다.\n실습교육장 시설에 빔프로젝트 시설, 의자, 실습용 테이블이 다 갖춰지고 조명도 잘 작동된다.\n스마트팜 개발을 위한 자재를 하나씩 하나씩 채워가고 있다. 스마트팜 기술 개발이 어려운 일이 아닌데, 기술 개발자와 사용자 농민과의 눈높이가 너무 차이가 크다. 어떠한 이유인지 알수 있으나, 이를 해결하기에는 많은 시간이 필요할 듯 하다.\n그래도 한국인은 대단하기에 바뀌어 갈 것이다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 331
    },
    {
      "id": "222943140097",
      "title": "2019.12.13 : 입식 재배 시설 펄라이트, 상토, 점적테이프 배치",
      "date": "2022. 12. 1. 13:55",
      "content": "작물은 없고 계속 시설 작업만 하고 있다. 펄라이트, 상토, 점적테이프 배치하고 보니 뿌듯하다. 상토만을 사용할 경우에는 하중이 커지고, 펄라이트만 사용하면 함수능력이 떨어져서 자주 관수해야 한다. 이를 해결하기 위해서 하부에 펄라이트 두고 상부는 상토를 놓는 것이 좋다. 분무수경은 흙을 사용하지 않아서 좋지만 10분 간격으로 미스트 분무를 해야하고 뿌리에서 떨어지는 부유물에 노즐이 잘 막히는 문제점이 있어서 관리가 많이 필요하다. 다들 나에게 왜 분무수경을 하지 않는냐고 물어보면, 나는 식물은 흙에서 자라야 한다고 말한다. 햇빛받고 좋은 토양에서 자란 작물이 훨씬 더 건강하다. 그리고 작물 제약없이 입식재배시설을 갖추기 위해서는 결국은 흙을 사용해야 한다. 딸기, 토마토, 파프리카 모두 배지를 사용한다. 다만 네덜란드와 같은 유럽에서는 담수경 형태의 엽채류 재배를 많이 하고 있지만, 시설비용이 높다.\n이러한 장단점을 극복하고자 농민들이 쉽게 구할 수 있는 상토를 재활용하고, 기존 관수 시설을 사용하면서 입식재배가 가능한 형태로 고민한 것이 가변형 입식 재배 시설이다.\n하나씩 하나씩 개선해 간다면 맘꽃가든 농장을 푸른 엽채류로 채우는 그날이 올것이다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 650
    },
    {
      "id": "222943139673",
      "title": "2019.11.07 : 제주 동부 지역 농민 대상 교육 의자 배치",
      "date": "2022. 12. 1. 13:54",
      "content": "제주 동부 지역 농민 대상 교육을 위해 의자를 배치하였다. 배치하고 보니깐 체험 농장이 되어 버렸다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 110
    },
    {
      "id": "222943138743",
      "title": "2021.03.10 : 제주동부농업기술센터 분무시설 수리",
      "date": "2022. 12. 1. 13:53",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222924091399",
      "title": "2019.07.30 : 제주동부농업기술센터 양액 시스템 견학",
      "date": "2022. 11. 9. 12:01",
      "content": "제주동부농업기술센터 김승현 과장님의 도움으로 구좌읍 관내 농가가 직접 만든 양액시스템 현장을 방문하였다. 타이머 기반의 릴레이를 사용해서 자작해서 운영중이라고 하신다. 오이 재배 농가이신데, 역쉬나 농사는 힘들다고 하신다.\n자작 양액기를 본 뒤에 동부농업기술센터에 설치된 양액시스템을 견학갔다 왔다. 우성하이텍 제품으로 기억하는데, A통, B통, C통을 포함한 양액 배합 및 관수를 시간 기준으로 할 수 있도록 구성되어 있다. 가격은 일단 ???만원을 넘어간다. 펌프 가격이랑 제어 시스템을 포함한 가격이니깐 당연한 것일수도...",
      "content_length": 296
    },
    {
      "id": "222924089069",
      "title": "2020.07.20 : 자립형 스마트팜 연구회 5차 교육",
      "date": "2022. 11. 9. 11:58",
      "content": "자립형 스마트팜 연구회 5차 교육",
      "content_length": 18
    },
    {
      "id": "222924087816",
      "title": "2019.06.05 : 다단 베드 목재 재활용",
      "date": "2022. 11. 9. 11:57",
      "content": "",
      "content_length": 0
    },
    {
      "id": "222924086204",
      "title": "2019.04.28 : 농업용 삼상 전기 설치 및 보수 작업",
      "date": "2022. 11. 9. 11:55",
      "content": "농업용 삼상 전기 설치 및 보수 작업",
      "content_length": 20
    },
    {
      "id": "222924084936",
      "title": "2020.01.08 : 다단육묘베드 겨울 파종/발아 테스트",
      "date": "2022. 11. 9. 11:54",
      "content": "다단 육묘 베드에 간단한 난방을 하고 겨울 파종/발아가 가능한지 테스트를 실시하다.",
      "content_length": 46
    },
    {
      "id": "222923654385",
      "title": "2019.07.08 : 제주ICT협동조합 - 제주도내 토마토 농가 방문",
      "date": "2022. 11. 8. 21:45",
      "content": "제주ICT협동조합 멤버들과 제주도내 토마토 농가를 방문했다. 유기농 토마토를 생산하면서 관내 학교 급식등에 농산물을 공급하는 농가이다.\n시설 규모나 관리가 잘 되어 있음을 알게 되었다.\n제주도내에서 유일하게 PRIVA 제품을 사용하고 계시는 농가이다. 정부 지원은 없지만 제품에 대한 신뢰성 때문에 선택했다고 하신다. 기본 패키지 가격 구성이 후덜덜하다. 다만 웹 기반의 제품 구성과 네델란드 본사 서버와의 데이터 연동 등에서 만족할 부분이 많다고 하신다. 직접 제품의 구조와 특징에 대해서 설명해 주신 대표님의 모습이 열의에 차 있다.\n이 농장은 특히 토마토 재배를 위해서 난방 구성에 심여를 많이 기울이신 것 같다. 특히 난방 파이프 공사를 직접 하셨다고 하는데, 농부가 되려면\n정말 백공이 되어야 할 듯 하다.\n여기 아래 그림에 있는 것이 직접 용접해서 공사를 진행하신 난방 시스템이다.\n다양한 스마트팜 설비 제품들... 역쉬 전기 세팅은 잘해야 될 것 같다. 아래 선들이 어지럽게 놓여있다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #ICT협동조합 #제주ICT협동조합 #토마토 #토마토농장 #유기농토마토",
      "content_length": 596
    },
    {
      "id": "222923649628",
      "title": "2020.07.17 : 제주동부농업기술센터 스마트팜 기자재 전시",
      "date": "2022. 11. 8. 21:40",
      "content": "제주동부농업기술센터 스마트팜 기자재를 새롭게 세팅했다고 하셔서 김승현과장님과 함께 제품 구경을 했다. 반딧불이 제품으로 다양한 센서를 볼 수 있다. 하지만 전시된 제품을 현장에 적용하는 것은 또 다른 문제이다. 특히 제품 구성에 있어서 소프트웨어 적인 부분이 없다. 센서들의 가격도 너무 비싸다.\n기상대를 비롯한 여러 제품을 저비용으로 구성할 수 있는 방법이 있는데, 안타까운 부분이 많다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #제주동부농업기술센터",
      "content_length": 284
    },
    {
      "id": "222923648554",
      "title": "2019.05.27 : 가변형 고설재배 베드 상토 침하",
      "date": "2022. 11. 8. 21:39",
      "content": "또다시 상토가 내려 앉았다. 한번에 될리가 없지.. ^^; 하부 보강없이 급한 맘에 상토를 옮겨는데 바로 침하가 되었다.\n방법을 찾아야 할 듯하다. 여러가지 아이디어가 있는데, 하나씩 하나씩 테스트 해보면 될 듯하다.\n하우스도 직접 지었는데, 이정도 쯤이야!!!\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 200
    },
    {
      "id": "222923647732",
      "title": "2019.04.24 : 교육장 선반 제작",
      "date": "2022. 11. 8. 21:38",
      "content": "교육장에 그늘막을 설치했다. 하우스의 온도가 올라가다보니 작업하기가 힘들어서 그늘막을 설치했다. 그리고 하나씩 방부목으로 칸막이를 설치했다.\n선반의 폭을 하부로 내려갈 수록 좁게 만들기 위해서 트러스 구조를 적용하였다. 효과는 만점이다.\n트러스 구조가 거의 완성이 되어 간다. 알바를 하러 온 재현이가 즐거운 표정을 짓고 있다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #트러스",
      "content_length": 242
    },
    {
      "id": "222923646447",
      "title": "2019.12.17 : 다단 육묘 베드 발아 시작",
      "date": "2022. 11. 8. 21:37",
      "content": "다단 육묘 베드를 제작해서 몇개 포트에 상추랑 파 등을 넣고 발아를 시켰는데, 발아는 되었다.\n그런데 상태가 좋지 않다. 이제 겨울로 접어드는 시기라 작물이 제대로 성장할 수 있을 지 모르겠다. 그래도 아두이노 메가 보드를 이용해서 원격 제어 하는 걸 테스트하기에는 더할나위 없이 좋은 것 같다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #아두이노 #원격제어 #클라우드 #자립형스마트팜 #육묘베드 #다단육묘베드 #LED #식물LED #상추 #파 #파종 #발아",
      "content_length": 266
    },
    {
      "id": "222923608045",
      "title": "2022.11.08 : 연구회 농가 기상대 설치",
      "date": "2022. 11. 8. 20:55",
      "content": "연구회 회원이신 \"제주로의농부여행\" 농장에 기상대 설치하다. 이제 기상대 설치는 스마트팜 기자재 설치 중에 제일 쉬운 듯 하다. 제품은 Ambient weather WS-2902C 제품이다. 2019년 부터 구매해서 맘꽃가든 농장에 2대 설치해서 검정을 진행했다. 제주도 지역에는 지인들의 부탁으로 15대 이상 설치를 진행했는데, 한대만 외부기상 온도 측정 이상으로 문제가 되었다. 지금 개발자 API도 제공해서 농장별 기상대 데이터 취득하는데 최고인듯 하다. 이 데이터로 10분마다 동기화 프로세스를 개발해서 \"슬라워\"로 데이터를 받고 있다. 빅데이터 수집은 쉬운데 어떻게 쓸지는 고민해야 한다.\n앱도 잘되고, 데이터 취합도 잘되고, 신뢰성도 높고 가격도 저렴하다. 연구 활동에 있어서 기상대 설치가 잘되니깐 맘이 즐겁다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #제주로의농부여행 #슬라워 #AWS #WS-2902C #빅데이터",
      "content_length": 495
    },
    {
      "id": "222923600646",
      "title": "2022.11.08 : 원격/수동 전환모듈 설치(스마트팜 표준 검정 이유)",
      "date": "2022. 11. 8. 20:46",
      "content": "콩깍지 농원에 클라우드형 스마트팜 \"슬라워\"와 연동된 순환팬 제어 시스템을 설치하고 무사히 테스트를 마쳤다.\n그런데 기존에 쓰고 있던 제품을 버릴 수는 없을까 같아서 원격제어장치가 작동되지 않을 때 사용할 수 있도록 원격/수동 전환 모듈을\n설치하고자 하는데, 고민이 많다. 기존 제품은 5채널 릴레이가 분리되어 설치되어 있다. 농장주 이신 김성훈 형님은 굳이 5채널을\n따로 돌리지 않고 한꺼번에 구동한다고 하셔서 우리는 1채널로 구성을 했는데 어떻게 해야 되나 싶다.\n1채널 원격과 5채널 수동을 전환 모듈로 설치하고자 하니깐 고민이 많다.\n농업현장에 스마트팜 보급에 있어서 가장 큰 문제점은 농장마다 상황이 다르다는 것!!!!!!\n냉장고 처럼 220V 전원에 연결만 해서 사용할 수 있다면 얼마나 좋을까?\n아마도 불가능하다. 그래서 스마트팜 표준 검정이 필수가 아닐지????\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #콩깍지농원 #슬라워 #순환팬제어",
      "content_length": 507
    },
    {
      "id": "222922342720",
      "title": "2019.04.18 : 시설하우스 분전함 조립",
      "date": "2022. 11. 7. 14:57",
      "content": "100평 정도의 하우스를 직접 짓고 작업장 및 교육실습장으로 사용할 데크 설치를 시작하다. 제주도 내려와서 배운 각관 용접 실력으로 바닥도 세팅하고 했는데, 이제서야 전기 작업을 시작하다. 3D 설계 모델링 할 때만 봤던 3상4선 MCCB랑 ERCB 등등... 전기도 단상에서 삼상으로 바꾸고, 스피드바를 이용해서 분전함 조립도 진행..\n하우스 중간에 인터넷 wifi 서비스를 제공하기 위해서 무선통신함(왼쪽)도 만들다. 개폐기 제어하기 위한 변압기 모듈은 안마의자에서 분리한 변압기를 사용하였다. 다시 직류로 변환하기 위한 다이오드 설치까지... 스마트팜은 분전함 만들다 보면 완성되는 듯.. ㅎㅎ\n바닥 작업에 거의 한달을 보낸 것 같다. 바닥 밑으로 전선이랑 통신 케이블까지 다 설치 했는데, 이제서야 자리를 잡아 가는 듯..\n스마트팜 설치에 있어서 50% 이상은 전기랑 통신, 심지어 CCTV 라인 설치까지 해야 한다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #분전함 #MCCB #ERCB #다이오드 #CCTV",
      "content_length": 544
    },
    {
      "id": "222922341527",
      "title": "2019.06.11 : 폴리텍대학 스마트팜 테스트 시설, 아두이노 기반",
      "date": "2022. 11. 7. 14:56",
      "content": "폴리텍대학에서 컨테이너에서 식물재배하기 위해서 아두이노 기반으로 다단 재배 시설을 구성하셨다고 함. 다들 끊임없이 도전한다. 묘삼재배한다고 테스트 시작했던 시절이 생각난다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #연구회 #스마트팜연구회",
      "content_length": 164
    },
    {
      "id": "222922340367",
      "title": "2019.05.09 : 정가네 밥상 스마트팜 시설 견학",
      "date": "2022. 11. 7. 14:55",
      "content": "제주도 스마트팜 검색하면 나오는 정가네 밥상 스마트팜... 식물공장 형태인데, 식당에서 사용할 쌈채소류를 재배하기 위해서 설치하셨다고 한다.\n비용이 만만치 않으셨을텐데, 제주도에서 이런 시설을 볼 수 있다니 좋다.\n다양한 종류의 쌈채소를 재배 가능한데, 유지 보수가 어떨지 궁금하다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #정가네밥상",
      "content_length": 210
    },
    {
      "id": "222922334361",
      "title": "2019.11.11 : 다단 육묘 베드 LED 설치",
      "date": "2022. 11. 7. 14:49",
      "content": "스마트팜을 하면서 LED를 사용한 식물공장을 많이 봤는데, LED 기반의 재배는 아무래도 제약이 있을 것 같다..\n그래서 시설 면적 대비 재배 면적 효율을 위해서 다단 육묘 베드는 효과적일 것 같아서 다단 육묘 베드를 제작해서 설치하였다.\n식물 재배용 LED를 구입해서 색깔별로 배열(R3, B1)한 제품을 설치했는데, 관련 자료를 찾아보니\n이제는 자외선 영역의 빛이 더 중요하다고 한다. 결국은 가시광선 영역과 자외선 영역까지 다 들어와야 한다는 것!!!!\n그래도 점점 기술이 좋아지고 있으니깐 기대해 보자.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #LED #식물LED #육묘\n#육묘배드 #다단배드",
      "content_length": 367
    },
    {
      "id": "222922331698",
      "title": "2019.04.17 : 작업장 및 실습장 데크 바닥 작업",
      "date": "2022. 11. 7. 14:46",
      "content": "작업장 및 실습장 데크 바닥 작업 수행.. 방부목 사이즈는 되도록이면 큰 사이즈로 나중에 후회할 수 있음. 그리고 우드스테인은 꼭 칠해야 한다.\n길게 보고 가기로 마음먹었으니, 하나씩 하나씩 진행중!!! 언제 바닥을 데크목으로 완성할까 했는데 하다가 보니 어느덧 바닥을 다 채웠다. 이 바닥밑으로 전선이랑 통신선이 다 깔려있다는 것은 나만이 아는 비밀.. 스마트팜 구성의 시작은 설계다!!!! 설계하지 않고 진행하면 꼭 후회한다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #연구회 #스마트팜연구회 #하우스",
      "content_length": 313
    },
    {
      "id": "222922329843",
      "title": "2020.07.16 : 제주동부농업기술센터 관수 스마트팜 교육",
      "date": "2022. 11. 7. 14:44",
      "content": "제주로의 농부여행 유도균 사장님, 황금콩밭 임병준 사장님, 해뜰팬션 채희용 사장님, 이경환 사장님,,, 다들 열의가 대단하시다.\n제주동부농업기술센터에서 지원을 해서 우리 연구회 분들과 아두이노메가 제품을 가지고 관수 스마트팜 시스템을 만들기에 도전하다.\n아두이노 메가를 가지고 연구회 회원분들이랑 관수 제어하기 위해서 늦은 밤에 모여서 교육을 했다. 늦은 시간에 센터에 우리만 남았네..\n아두이노 메가는 프로그램하기에 제약사항이 너무 많다. 그리고 더 좋은 제품이 나왔다.\n그것은 ESP8266 이다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #연구회 #스마트팜연구회",
      "content_length": 348
    },
    {
      "id": "222922328189",
      "title": "2019.06.05 : 맘꽃가든 스마트팜 교육 자료 첫 시리즈",
      "date": "2022. 11. 7. 14:43",
      "content": "제주동부농업기술센터에서 지원을 해서 스마트팜 교육 자료 첫 시리즈를 만들다. 자료를 만들 때 고통은 정말 싫다!!!!!!\n기존에 이와 관련된 유사 내용이 많아서 만들 때 효과가 있을까 싶었는데, 역쉬나 별로다. 학생을 위한 교육 키트로서는 적합한데, 농민들이 사용하기에는 부족하다.\n디자인 하는게 너무 어렵다. 색깔 배치라 폰트, 문구까지... 영어로 표현하는 것은 더 힘든 것 같다.\n아두이노 키트 기반의 물주기 첫자료.. 친환경 농업도 생각했는데, 친환경 농업과 스마트팜을 연결하려면 시설비가 많이 든다. ㅎㅎ\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #연구회 #스마트팜연구회\n#아두이노 #교육 #체험 #체험키트 #맘꽃가든",
      "content_length": 381
    },
    {
      "id": "222922324434",
      "title": "2019.05.03 : 수평 이동식 고설 베드 1구역 완성",
      "date": "2022. 11. 7. 14:39",
      "content": "여러번의 시도와 장시간의 용접 끝에 수평 이동식 고설베드 1구역 완성하고 상토를 채웠다.\n기존에 있던 농업용 자재를 최대한 사용해서 설치하고 용접 부위에 방청제도 뿌렸다. 구조적인 안정감은 확보한듯\n그리고 양액재배 위해서 물통도 세팅함.. 물통 가격도 후덜덜하다. 제주도에는 한 업체밖에 없는걸로 아는데, 그 업체는 재료를 폐플라스틱을 사용한다. 돈을 많이 벌것 같다. 돈 버는 재주가 없다.\n시설면적 대비 재배면적 극대화를 위해서 수평 이동식 고설 베드를 설계하고 첫번째 구역을 완성하다. 이제 상토가 무너지는 경우는 없을 것 같다. 이제 양액 배합 시스템도 만들어야 한다. 음수투약기 도사트론을 어떻게 조립할까 하는 새로운 설계 숙제가 생겼다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #방청제 #양액 #양액재배 #음수투약기 #도사트론",
      "content_length": 444
    },
    {
      "id": "222921115879",
      "title": "2022.11.03 : 서귀포 남원 스마트팜 설치",
      "date": "2022. 11. 6. 9:00",
      "content": "제주 ICT 협동조합 조합장 오길원 대표의 배또롱 농장과 김석재 대표 농장에 수분부족량을 측정할 수 있는 온습도 측정 센서와 순환팬 제어 모듈을 설치함.\n다들 스마트팜에 베테랑 분들이라서 설치도 쉽고, 테스트도 쉽게 마무리 되었다.\n하우스 감귤 재배 농가인 김석재 대표 농장, 추석 전후로 수확이 완료되어서 감귤이 없음 ^^;\n백엽상과 연결된 온습도 환경 측정 센서함\n측정 테스트 및 분전함 설치를 함께 하니, 쉽게 업무가 마무리 된다. 스마트팜 기술의 50%는 전기를 아는 것...\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #제주ICT협동조합 #수분부족량 #온습도 #온습도센서 #순환팬 #순환팬제어모듈",
      "content_length": 368
    },
    {
      "id": "222920401772",
      "title": "2018.11.10: 관수 제어보드 개발 시작",
      "date": "2022. 11. 5. 12:27",
      "content": "관수 제어 보드 개발 시작 모습 : 맘꽃가든 진입로를 따라서 관수 라인을 설치하고 이를 ESP8266 보드로 제어하기 위한 작업을 실시하다.\n소프트웨어 개발자의 한 \"하드웨어 경험 부족\"을 해결하기 위해서 직접 하드웨어 설치하는 즐거움을 한껏 가진다.\n어디가 엉성한데, 선 연결과 기본 코드만을 가지고 제어하는 것을 테스트 하다.\n그런데 아주 잘된다...!!!! 역쉬 4차 산업혁명이 다가오고 있다.\n집에서 간단하게 웹페이지 만들어서 테스트... 밸콘 밸브가 너무 잘 돌아간다. 기쁘다.\n밸브제어 테스트\n재생\n7\n좋아요\n0\n01:06\n\n접기/펴기\n최초 밸브제어 테스트\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #하드웨어 #관수 #관수제어 #ESP8266 #밸브제어 #밸콘",
      "content_length": 406
    },
    {
      "id": "222920399224",
      "title": "2019.05.12 : 베드의 상토가 하중을 견디지 못함",
      "date": "2022. 11. 5. 12:22",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222919381464",
      "title": "2019.01.02 : 입식 재배 시설 개발",
      "date": "2022. 11. 4. 11:17",
      "content": "제주 동부 지역 강소농 업체분들과 함께 입식 재배 시설 개발 내용을 함께 리뷰하다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #강소농",
      "content_length": 105
    },
    {
      "id": "222919369237",
      "title": "[공지] 2022.10.02 : 로메인 / 버터헤드 / 청상추 판매 시작",
      "date": "2022. 11. 4. 11:03",
      "content": "맘꽃가든 입식 재배 시설에서 로메인 / 버터헤드 / 청상추 재배를 하고 판매를 시작하였습니다.\n제주시 농협 공판장 판매, 음식점 납품, 로컬푸드 매장 판매도 하게 되었는데, 쉬운게 없는 것 같습니다.\n4Kg 박스 한상자 채우는데 왜 이렇게 시간이 오래걸리는지 ? ㅎㅎ\n한걸음씩 한걸음씩 입식재배기반 클라우드형 스마트팜을 잘 만들어 가겠습니다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #상추 #청상추 #로메인 #로메인상추 #버터헤드 #버터헤드상추 #공판장 #음식점 #로컬푸드",
      "content_length": 296
    },
    {
      "id": "222942592064",
      "title": "2022.11.18 : 제주ICT협동조합 순환팬 자동제어 전환 스위치 설치(추가작업필요)",
      "date": "2022. 11. 30. 21:23",
      "content": "공공기상데이터를 기반으로 순환팬 운영 스케쥴러를 생성/제어하는 프로그램 개발이 거의 완료되어 제주ICT협동조합 오길원 조합장 농장에 설치하였다. 하지만 기존에 순환팬 제어 시스템과 연동하는 문제로 전환 스위치를 설치해야 하는데, 딱 맘에 드는 연결이 되지 못하고 있다.\n기존 제어함에서 보면 단상 MC에 기존 스마트팜 릴레이 신호와 수동 스위치 조작 신호 전환 스위치가 연결되어 있다. 수동으로 전환되면 온도센서에 의해서 작동된다. 여기에 슬라워 시스템 제어까지 연결하면 3가지 경우가 성립해서 4단 스위치를 달아야 하는데, 어떻게 해야 되나 원점에서 다시 고민하고 있다. 단상MC전원을 제어할건지, 단상MC 제어 전원을 제어할건지...\n항상 기존 시스템 구동은 살리면서 슬라워 시스템을 연동시키는게 제일 문제다. 그렇다고 기존 시스템을 없애고 하기도 그렇고...\n스마트팜도 전환기 시대다.. 전환기 시대에 있는 사람이 제일 어려운듯...",
      "content_length": 469
    },
    {
      "id": "222942589453",
      "title": "2022.11.17 : 위험하게 시설하우스 외부에 노출된채로 설치된 개폐기/순환팬 제어함",
      "date": "2022. 11. 30. 21:20",
      "content": "제주도에서 스마트팜 기술을 개발/설치하면서 여러가지 현장을 봤지만 이렇게 아예 시설하우스 외부에 노출된 채로 개폐기/순환팬 제어함을 설치한 것은 처음 봤다. ^^;\n스마트팜 기술을 개발하면서 전문가들이 매번 나오는 지적사항 중에 하나가 플라스틱 분전함 대신 단단한 철제함을 사용해야 되고, 전용실이 있어야 된다고 했는데, 아마도 이 모습을 보면 다들 한마디 할 듯하다.\n스마트팜 설치에 있어서 전기 안전은 정말 중요하다. 제발 이 농장주 분이 전기에 대해서 잘 아시고 관리를 잘 하시는 분이었으면 좋겠다.\n농사를 짓다보면 자재 관리도 하기 힘들만큼 시간이 없다는 것은 알지만, 이렇게 외부에 설치하는 것은 경계해야 될 것 같다.",
      "content_length": 351
    },
    {
      "id": "222918562293",
      "title": "2020.06.29 : 제주동부농업기술센터 관계자 방문/교육",
      "date": "2022. 11. 3. 14:35",
      "content": "입식 재배 시설 기반의 스마트팜 교육장을 만들기 위해서 3개월 이상을 보냈다. 한땀 한땀 혼자서 직접 다 만들기 시작했는데, 이제서야 성과를 보게 되었다. 의자랑 장비를 세팅하는데 나름 설계 노하우를 적용하였는데, 보람을 느낀다.\n여러분들에게 설명을 한다는 게 쉽지는 않다.\n#맘꽃가든 #제주동부농업기술센터 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #스마트팜교육#강의장",
      "content_length": 224
    },
    {
      "id": "222918561796",
      "title": "2020.04.28 : 자립형 스마트팜 연구회 농가 관수시설 현장 확인",
      "date": "2022. 11. 3. 14:35",
      "content": "제주 동부 구좌 지역의 강소농 농가 모임에서 시작된 자립형 스마트팜 연구회.. 제주농업기술원, 황금콩밭, 제주로의 농부여행, 리버티필드, 검은땅, 해뜰팬션 회원으로 모아서 스터리를 시작하다.\n블루베리를 재배하시는 리버티 필드의 50A 관수 라인\n시설하우스에서 밭작물을 재배하시는 블랙그라운드 농장의 관수형 펌프 및 50A 관수 라인\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #스마트팜교육 #배관 #펌프 #황금콩밭",
      "content_length": 252
    },
    {
      "id": "222918560277",
      "title": "2020.02.03 : 전기-코딩으로 뭉친 농민(3회차)",
      "date": "2022. 11. 3. 14:33",
      "content": "전기-코딩으로 뭉친 농민(3회차)\n아두이노 교육 실시\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #스마트팜교육 # 아두이노",
      "content_length": 89
    },
    {
      "id": "222918559476",
      "title": "2020.01.13 : 추운 날씨에 하우스 교육장에서 연구회 (2회차)",
      "date": "2022. 11. 3. 14:32",
      "content": "추운 날씨에 하우스 교육장에서 연구회 (2회차)\n날씨는 더 추워지는데 참가해 주신 회원님들 대단하심..\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #스마트팜교육 # 아두이노",
      "content_length": 117
    },
    {
      "id": "222918557876",
      "title": "2020.01.06 : 자립형 스마트팜 연구회 시작 (1회차)",
      "date": "2022. 11. 3. 14:31",
      "content": "추운 날씨에도 불구하고 노트북을 켜고 관수 라인을 만들고 밸브를 설치하다. 김현수(제주농업기술원) 연구사, 임병준(황금콩밭) 대표, 심인보(리버티필드) 대표, 이경환 대표, 채희용(해뜰팬션) 대표, 유도균(제주로의 농부여행) 개별 노트북을 가져 오셔서 아두이노 IDE 설치 실시\n추운 날 모인 여러분들!!!! 아두이노 IDE 설치, 노트북 세팅, 기본 회로 보드\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #스마트팜연구회 # 아두이노 #제주로의 농부여행#황금콩밭 #제주농업기술원",
      "content_length": 288
    },
    {
      "id": "222941480691",
      "title": "2022.11.29 : 입식 재배 시설 확장 천막지 설치",
      "date": "2022. 11. 29. 17:35",
      "content": "약 250평 규모의 추가 입식재배시설 확장 공사가 진행되고 있다. 자재가격이 많이 올라서 현재는 기존에 가지고 있었던 파이프 자재를 이용해서 조립 작업을 하고 있다. 내년 2월 확장 완료를 목표로 진행하고 있는데, 만약에 작업이 다 완료되면 아마도 21개 구역에서 로메인과 청상추 재배가 이루어질 것 같다. 그렇게 되면 700평 규모의 고설재배베드 면적의 효과가 나올 것 같다.\n매일 4Kg 상추 최소 20박스, 최대 30박스 출하를 목표로 재배 공간 구축을 진행하고 있다. 현재까지 재배 실증을 통해서 충분히 가능할 것으로 판단된다. 내년 여름을 기대한다.\n오늘은 고정부에 천막지를 설치하였다. 천막지는 시설하우스 설치시 사용되는 천막지다. 기본적으로 베드의 길이가 12m 기준이라서 8개 베드를 구성하는데 사용될 수 있다.\n김팀장과 함께 천막지를 올리고 15A 파이프에 클립을 꽂아서 설치 완료\n하부 천막지 설치는 물이 잘 빠질수 있도록 하나씩 펼치면서 끼운다.\n이렇게 또 하나의 작업을 마친다.",
      "content_length": 503
    },
    {
      "id": "222941348143",
      "title": "2019.12.11 : 고설베드 하중 줄이기 -> 점적테이프, 펄라이트, 상토 배분",
      "date": "2022. 11. 29. 15:22",
      "content": "가변형 고설재배베드를 만들면서 분무수경 방식이 아닌 상토 기반의 점적테이프 관수 방식을 적용하면서 가장 문제가 되는 것은 하중 문제이다.\n이를 해결하기 위해서 바닥에 펄라이트를 깔기로 했다. 최소한 20%이상의 펄라이트를 깔고자 검은 천막지 위에 방충망을 짤라서 깔았다.\n그 위에 상토를 깔고 점적테이프를 설치했다. 관수를 했을 때를 상상하면 얼마나 다시 무거워질지 걱정이 된다.\n그렇게도 무모한 짓인지 알지만 고설베드가 하중을 견딜 수 있는지 체크해야 한다.\n무사하기를 기원한다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 323
    },
    {
      "id": "222941347173",
      "title": "2019.05.23 : 삼상전기 사용전점검필증, 실습교육장 완료",
      "date": "2022. 11. 29. 15:21",
      "content": "본격적인 스마트팜 개발을 위해 기존에 설치했던 단상 전기를 삼상 전기로 변경하고 실습교육장 및 재배시설을 만들고 있다. 그래서 삼상전기를 인입하고 메인 전원함을 스피드바를 조립해서 구성한 뒤 전기를 배분하였다.\n오늘 전기안전 담당하시는 분이 오셔서 점검하시고 필증을 붙여주시고 가셨다. 이제 농장 관리에 있어서 전기 관리는 핵심이다.\n재배 작물 세척을 위한 세척용 씽크대도 들어와서 설치 완료했다.\n조명까지 설치가 다 잘 된 것 같다. 이제 시작이다.. 매일 매일 시작이다. 끝도 없이 일만하는 시작이다!!!! ㅋㅋ\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 342
    },
    {
      "id": "222941346663",
      "title": "2020.02.02 : 유인줄 설치",
      "date": "2022. 11. 29. 15:20",
      "content": "육지의 모농가를 방문했는데 유인줄 설치가 진행 중이다. 하나씩 잘라서 묶어둠..\n유인줄은 과채류나 과실류 재배에서는 필수인데, 다 농민들의 피와 땀이다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 139
    },
    {
      "id": "222941345435",
      "title": "2021.03.09 : KEYES ESP32 제어보드 기반 천창 개폐기 제어",
      "date": "2022. 11. 29. 15:19",
      "content": "KEYES ESP32 제어보드 기반 천창 개폐기 제어 하드웨어 설치\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 91
    },
    {
      "id": "222940648245",
      "title": "2022.11.28 : 한국생활개선강진군연합회 & 강진군농업기술센터 단체 방문",
      "date": "2022. 11. 28. 20:04",
      "content": "강진군농업기술센터 분들과 한국생활개선강진군연합회 여성회원 30여명이 오늘 맘꽃가든을 방문했다. 강진군수 사모님도 직접 오셔서 맘꽃가든이 진행하고 있는 작물재배, 재배시설, 시설제어 연구/개발 활동을 견학하셨다. 특히 다른 단체들보다 입식 재배 시설과 상추 재배에 대해서 관심을 많이 가져주시고 질문도 많이 해주셔서 유익한 시간이었다. 특히 마지막에 다들 꼭 성공하시기를 바란다고 하셨다.\n클라우드형 스마트팜 시험장비를 보여드렸는데, 진진한 눈빛으로 보시고 질문도 많이 하셔서 정말 즐거운 시간이었다.\n이 많은 인원들이 김녕에 와서 맘꽃가든을 견학했다는 것에 뿌듯함을 느낀다.\n강진군 농업기술센터 박민철 인력육성팀장님께서 간단하게 맘꽃가든이 걸어온 길에 대해서 설명을 해주셨다. 다들 서서 상추 재배하는 모습에 신기해 하신다.\n오늘은 맘꽃가든이 여성 농민으로 가득찬 날이다. 점점 더 많은 사람들이 관심을 가져주시는 그날을 위해서...",
      "content_length": 466
    },
    {
      "id": "222940353712",
      "title": "2019.12.04 : 제주동부농업기술센터 고설 베드 및 엽채류 재배 실증 하우스",
      "date": "2022. 11. 28. 15:04",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222940351908",
      "title": "2019.05.22 : 실습 교육장 씽크대, 작업대 입고 및 설치",
      "date": "2022. 11. 28. 15:02",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222940347399",
      "title": "2021.03.08 : 스마트팜 연구회 회원 농가 관수 시설 개선 방안 확인",
      "date": "2022. 11. 28. 14:58",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222940344515",
      "title": "2020.01.28 : 다단육묘베드 겨울철 식물 성장 LED 기반 재배 테스트",
      "date": "2022. 11. 28. 14:55",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222939506962",
      "title": "2022.11.27 : 입식재배시설 확장 -> 가변부 조립, 용접부 그라인드, 방청제 살포",
      "date": "2022. 11. 27. 18:54",
      "content": "입식재배시설 작업을 시작해서 하나씩 작업을 완료해 가고 있다. 고정부 파이프와 각관 조립을 완료하고 용접부 그라인드 작업을 김팀장이 진행하고 있다. 청상추 수확, 주문 받고 배달/판매까지 하는 상황이라 쉽지가 않다. 그래서 아예 일요일에 나와서 작업을 하고 있다.\n250평 규모의 확장되는 입식재배시설 부문..각종 자재가 바닥에 널려있다. 하나씩 조립하다 보면 정리가 될 것 같다.\n가변부 조립을 하고 있다. 가변부 조립도 쉽게 할 수 있는 부품을 제작했는데, 아직도 부족하다. 판금 또는 프레스 금형을 제작해야 할 것 같은데, 개발비용이 부족하다. 몇가지 부품만 추가 설계, 제작을 하게 되면 농민들도 쉽게 조립 가능한 입식재배시설이 될 수 있는데, 아직 제작비용이 부족해서 진행을 못하고 있다.\n기존 시설하우스 자재와 맘꽃가든에서 개발한 자재들을 조립해서 가변부 프레임 조립을 완료하고 있다.\n가변부 조립은 용접을 100% 제거하고 조립피스로 제작이 가능하도록 만들었다. 이제 하나씩 진행하면 될 듯.",
      "content_length": 506
    },
    {
      "id": "222938246882",
      "title": "2019.10.29 : ESP8266 및 아두이노 메가보드 -> 다단육묘베드 LED 원격제어",
      "date": "2022. 11. 25. 21:32",
      "content": "원격제어 위해 ESP8266 보드와 아두이노 메가 보드를 이용해서 다단육묘베드의 LED, 배수밸브, 입수펌프 등을 제어하는 것으로 구성하였다. 릴레이와 모터 드라이브 제어를 하는데 크게 문제가 없다. 그리고 아두이노 메가보드는 pH센서의 아날로그 측정값을 받아서 서버로 전달하는 용도로 제작해서 운용하였다. 잘된다!!!\n이제는 하드웨어보다는 소프트웨어가 중요하다. MCU보드 중에서 ESP시리즈가 가성비 짱이다!!!!\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 287
    },
    {
      "id": "222938246525",
      "title": "2019.12.02 : 고설베드 관수 라인 연결 작업",
      "date": "2022. 11. 25. 21:32",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222938245983",
      "title": "2019.05.21 : 교육 실습장 LED조명 설치",
      "date": "2022. 11. 25. 21:31",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222938245746",
      "title": "2021.03.06 : 제주농업기술원 시험재배포장 외부 기상대 설치",
      "date": "2022. 11. 25. 21:31",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222938245266",
      "title": "2020.01.27 : 김해대동 겨울 부추 재배 농가 방문",
      "date": "2022. 11. 25. 21:30",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222938153811",
      "title": "2022.11.25 : 제주농업기술원 김현수 연구사, 김동균 연구사 방문",
      "date": "2022. 11. 25. 18:58",
      "content": "",
      "content_length": 0
    },
    {
      "id": "222937358005",
      "title": "2022-11-24 : 제주동부농업기술센터 시험포장 개폐기 교체",
      "date": "2022. 11. 24. 19:46",
      "content": "제주동부농업기술센터에서 이용하는 시험포장 개폐기가 고장나서 교체 작업을 했다. 기존에 우성하이텍 제품을 설치해서 사용하고 있었는데\n담당 지도사께서 새로운 제품으로 교체해 보기를 원해서 청오 사이버캅2제품으로 교체했다. 시설 하우스에서 개폐기가 작동되지 않으면 고온 피해가 발생할 수 있기 때문에 항상 관리를 잘해야 한다.\n물홈 위에서 쪼그려서 작업을 하다보니 다리가 아프곤 했는데, 이제는 아무렇지 않다. 백공의 힘이다.\n천창과 측창은 롤러 가이드 구조가 다르다. 이 부분은 다음에 기회가 되면 설명을 하고자 한다.\n대부분의 개폐기 제어함은 24V 변압기, 직류변환 다이오드, 마그네틱커넥터, 퓨즈가 있다.\n여기서 제일 문제가 되는 것은 퓨즈... 퓨즈는 항상 여유분을 가지고 있어야 한다.\n이런 퓨즈없이 제어하는 방법은 모터드라이브를 쓰면 된다.. 점점 바뀔 듯...",
      "content_length": 430
    },
    {
      "id": "222937357144",
      "title": "2022-11-24 : 구좌읍 세화리 청상추 재배 농가 방문",
      "date": "2022. 11. 24. 19:44",
      "content": "구좌읍 세화리에 있는 청상추 재배 농가를 방문했다. 600평 규모의 시설하우스에서 토경으로 재배를 하고 계신다.\n사모님 혼자서 수확한다는 말씀에 나랑 박대리가 경외감을 표했다.\n1동당 16줄의 상추를 심고 간격은 20cm 이상이다. 여름에는 주로 깻잎을 재배하시는데, 겨울에는 연작피해로 깻잎 성장이 좋지 않아서 윤작의 개념으로 상추를 재배한다고 하신다.\n상추 수확 후에 포장하는 방법에 대해서 설명을 해주셨다.",
      "content_length": 230
    },
    {
      "id": "222937356505",
      "title": "2022-11-24 : 제주고등학교 재배 실습장",
      "date": "2022. 11. 24. 19:43",
      "content": "국립원예특작과학원 시설원예연구소 소장으로 퇴직하신 조일환 박사님의 초정으로 제주고등학교 재배 실습장을 방문하였다. 350평 규모의 고설 재배 딸기 시설을 견학했다. 설향 품종 재배를 하시는데, 품질이 너무 좋다. 확실히 조일환 박사님의 농업 지식을 접목하니깐 시설하우스 기자재 설치 및 운영이 일반 농민이 따라갈 수 있는 수준이 아니다. 함께 하시는 분도 농업 분야의 베테랑이라고 하시는데, 배울 부분이 많은 것 같다.\n이번에 여름과 겨울의 근권온도 관리 방안, 특히 적용온도와 시간에 대해서 중요한 정보를 주셨는데, 내년 여름부터 꼭 적용할 예정이다.\n토마토 재배 시설 및 양액 시설.. 여기는 네타핌 제품을 사용하고 있었다.\n그리고 설치 이후에 운영을 기다리고 있는 수직형 식물공장..\n고등학교 재배 실습장으로서는 국내 최고의 시설을 본 것 같다. 다시 고등학교를 다니고 싶다는 생각이 들었다.\n전체 구축 비용은 많았지만 이렇게 좋은 시설이 미래 농업인을 위한 교육에 활용된다면 가치가 있을 것 같다.\n대한민국에는 대단한 분들이 많다는 것을 새삼 느끼게 된다.",
      "content_length": 539
    },
    {
      "id": "222935874384",
      "title": "2022-11-22 : 구좌 세화 깻잎, 상추 재배 전문가 방문/자문",
      "date": "2022. 11. 23. 7:15",
      "content": "구좌지역에서 맘꽃가든 재배 시설을 보기 위해서 찾아오시는 분들이 많아지고 있다. 오늘은 특히 구좌읍 세화에서 깻잎, 상추 재배를 전문으로 하시는 전문가께서 방문/자문을 받았다. 이전에 1500평 정도의 시설하우스에서 쌈채소를 재배하셨는데, 지금은 500평 정도만 운영하시고\n키위로 재배를 전환한다고 하신다. 아무래도 앉아서 작업하면서 몸에도 안 좋고, 가격변동도 심해서 계속 유지하기가 힘들다고 하신다.\n갈수록 나이드신 분들이 농사를 포기하고 계셔서 젊은 사람이 입식재배 시설로 쌈채소에 도전한다면 희망이 있을거라고 격려해 주셨다.\n아무래도 현재 농민들을 만나면 가장 많이 하는 얘기가 가격변동, 좌식재배, 농업인구 고령화 이다.\n어느 누가 힘든 농업 환경에 와서 도전을 하지 않을거라고....\n그래서 자녀분들한테 농업을 물려주기 위해서라도 과수쪽으로 바꾸고 있다고 하시는 말씀에 많은 생각을 하게 된다.\n젊은 농업인을 꿈꾸며 열심히 스마트팜 개발을 하면서 작물 재배를 하고 있는 박대리가 우리 농장의 롤모델인 것 같다.\n그리고 3구역에 심었던 청경채가 너무 잘 자라고 있다. 이전에 심었던 청상추를 폐기하고 상토 재사용을 테스트 하기 위해서 청경채를 심었는데, 잘 자라고 있어서 뿌듯하다. 그런데 계속 따뜻해진 날씨로 청경채 가격이 좋지 않다. 작물재배기술을 확보하고 나면 다시 홍보/판매라는 도전을 해야 한다.",
      "content_length": 679
    },
    {
      "id": "222936319179",
      "title": "2022.11.23 : 외부기상대 설치 및 자동/수동 전환 모듈 개선 작업",
      "date": "2022. 11. 23. 16:49",
      "content": "제주ICT협동조합 김석재 회원 농가에 전달했던 외부기상대가 무사히 설치되었다는 연락을 받았다. 항상 시설하우스 물홈 지지대 설치를 했는데, 김석재 사장은 직접 안테나 지지대를 구입해서 외부 기상대 설치를 하고 단말기 설정도 완료했다.\n앞서가는 스마트팜 농업인의 모습을 보여줘서 대단하다는 생각이 든다. 현재의 농업인은 백가지 기술을 가진 백공이 되어야 한다. 농사를 잘 짓는 것은 기본이고 각종 스마트팜 기자재를 잘 다루고 설정할 수 있어야 한다. 그런 의미에서 보면 스마트팜 연구회 활성화 및 참여는 꼭 필요하다.\n공기순환팬 제어를 위해서 설치한 구동기 통신 노드 옆에 자동/수동 전환 모듈도 김석재 사장이 직접 구성해서 설치했다.\n나보고 걱정하지 말고 가라고 했는데, 걱정하지 않아도 될 정도로 구성해 줘서 너무 기분이 좋다.\n간단한 스위치 조작으로 구동기 통신 모듈이 작동 되지 않을 때 수동으로 조작이 가능해 졌다.\n다양한 현장에서의 실증 및 적용은 스마트팜 개발의 필수요건이다.",
      "content_length": 496
    },
    {
      "id": "222936317670",
      "title": "2022.11.23 : 농정원 농업인 교육사업 성과 공유 대회",
      "date": "2022. 11. 23. 16:48",
      "content": "2022년 농정원에서 진행했던 농업인 교육사업 성과 교육대회에 우수사례로 선정되어서 아침부터 뱅기타고 제주에서 세종시까지 출장을 갔다.\n전국 150여개의 교육활동 중에서 13개 우수 사례로 선정되어 농정원상을 확보하였는데, 농림수산식품부 장관상을 주는 3개팀 선정 대회에\n참여를 하게 되었다. 10분 정도의 발표이지만 2022년 한해 동안 열심히 활동했던 동부자립형스마트팜연구회 회원을 대표해서 발표하는 자리라서 긴장된 마음으로 참여를 했다.\n그런데 도착해서 경쟁 교육 단체들을 보니, 쟁쟁한 곳이 한 두군데가 아니다. 정말 다들 열심히 활동을 하고 있다. 특히 청년 농업인들의 활동이 눈에 뛴다. 잘 발표를 하고 왔는데, 최종 결과가 궁금해 진다.",
      "content_length": 363
    },
    {
      "id": "222936316611",
      "title": "2022.11.23 : 청상추, 로메인 9박스 수확 및 납품",
      "date": "2022. 11. 23. 16:47",
      "content": "세종시에 발표를 위해 출장을 가 있는 동안에, 직원들이 청상추, 로메인 9박스를 수확/포장하였다. 납품은 농협공판장과 음식점 등에 납품될 예정이다. 요즈음 계속 날씨가 좋아서 상추, 로메인 가격이 좋지 않다. 수확한 기쁨도 잠시,,, 실망이 더 크다.\n어제 방문하셨던 분의 말씀이 아직 가슴에 남아있다. 꾸준하게 재배, 수확, 판매해야 한다고....\n일희일비하지 말아야 한다고...\n농협공판장에도 출하했다. 가격은 ???? ^^;\n박대리가 지속적으로 구매해 주시는 음식점에 한박스를 두고 왔다. 항상 감사한 마음으로 전달해 드리고 있다.",
      "content_length": 300
    },
    {
      "id": "222935427118",
      "title": "2019.11.28 : 관수 밸브 설치",
      "date": "2022. 11. 22. 17:04",
      "content": "입식재배시설에는 보통 점적테이프가 설치된다. 베드위에 몇개의 포트를 배열하는 지에 따라 설치되는 밸브수가 달라진다. 처음 개발할 때 되도록이면 많은 수량을 재배하기 위해 밸브를 많이 설치하고자 했는데 그것보다는 작물 재배 특성에 맞게 정하면 된다. 그 특징은 청경채 6구, 로메인4구, 청상추3구 정도면 딱 좋다. 그리고 점적관련 부품 가격은 생각보다 싸다.. 다 깔아도 철재프레임 가격보다는 싸다..\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 278
    },
    {
      "id": "222935426760",
      "title": "2019.11.27 : 입식재배 베드",
      "date": "2022. 11. 22. 17:03",
      "content": "연동형 시설 하우스를 직접 조립 설치하면서 2개동에 입식재배베드 구축을 테스트로 만들었다. 그리고 이제 점적 부품까지 조립 진행중!!!\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 129
    },
    {
      "id": "222935425998",
      "title": "2019.05.20 : 교육 실습장 씽크대 및 조명 시설 설치",
      "date": "2022. 11. 22. 17:03",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222935336193",
      "title": "2022.11.22 : 한국방송통신대학교 농학과 농장 견학",
      "date": "2022. 11. 22. 15:32",
      "content": "금일 오후에 한국방송통신대학교 농학과 학우분들이 농장 견학을 오셨다. 재학중인 학생분들과 이를 인솔하는 대학원 박사, 석사, 소장님이 같이 방문하셔서 농업에 관한 얘기를 나눴다. 농학과를 졸업한 선배로서 후배분들한테 좋은 모습을 보이고 싶은데 아직도 고군분투 중인 모습만을 보여서 죄송한 맘이 든다. 그래도 스마트팜에 있어서 작물재배, 재배시설, 시설제어가 함께 되어야 함을 느끼게 해 준 시간인 것 같아서 좋았다.\n맘꽃가든에서 개발한 슬라워 시스템의 구조 및 특징을 설명드렸다. 아두이노와 같은 교육용 수준이 아니라 실제 농업현장에서 사용되는 센서와 농업장치를 보여드리고 제어하는 것을 알려드렸다.\n농업을 단순한 1차산업으로 생각하는 시기는 지났다.\n이제 농업은 6차산업으로 생각하는 시기도 지났다. 농업 생산, 가공, 디지털 제어를 함께 할 수 있어야 한다.",
      "content_length": 426
    },
    {
      "id": "222934088493",
      "title": "2021.06.25 : 입식재배시설 및 복합제어 스마트팜 특허",
      "date": "2022. 11. 21. 9:52",
      "content": "3년 동안 입식재배시설 및 복합제어 스마트팜 기술을 개발하면서 등록한 특허증.. 뿌듯하다.\n고설재배 포트 특허\n복합 제어 스마트팜 특허",
      "content_length": 75
    },
    {
      "id": "222934002021",
      "title": "2022.11.19 : 로메인 정식, 스마트팜 시스템 개선, 청상추 폐기",
      "date": "2022. 11. 21. 6:44",
      "content": "맘꽃가든이 지향하는 작물재배와 스마트팜 개발을 함께 수행하는 날이다. ㅎㅎ;\n드디어 기존에 있던 청상추를 폐기하고 로메인 정식을 했다. 김팀장이 열심히 정식하고 있다.\n옆밭에서 일하고 계시는 어머니들의 모습을 보면서 농업 질환의 90%가 근골격계 질환이라는 이유를 알 것 같다.\n이 와중에 박대리가 열심히 블로그 수정도 하고 최근에 개발하고 있는 플러터 기반 웹시스템도 같이 확인했다.\n두개를 동시에 할려고 하는데, 쉽지가 같다.\n버려진 청상추들이다. 옆 밭에서 양파 심는 일을 하시는 어머니들이 우리 농장 구경을 하고 싶다고 하신다.\n언제든지 오셔서 보시라고 했는데, 다들 반장 눈치를 보시고 못오신다. 점심 시간 때라도 보셨는지 모르겠다.",
      "content_length": 359
    },
    {
      "id": "222934608714",
      "title": "[공지] 2022.11.21 : 제주ICT협동조합 회원 김석재 농장 순환팬 원격 제어 테스트",
      "date": "2022. 11. 21. 19:19",
      "content": "제주ICT협동조합 전기강사이신 김석재 회원 농장에 순환팬 원격제어 시스템을 설치하다. 공공기상데이터와 연동해서 순환팬 가동 시간을\n사용자 설정 및 기상정보에 따라 작동 스케쥴이 일단위로 갱신되는 로직을 개발 적용하였다.\n단순하게 원격 제어 및 환경 측정은 이미 끝난 상태라 인공지능까지는 아니더라도 무상으로 제공되는 공공기상데이터를 활용해서 순환팬 가동 시간을 조금이라도 줄일 수 있는 방법을 찾아서 현장 실증이 진행중이다.\n제주ICT협동조합 회원농가에서 작업할 때는 항상 맘이 편하다. 기본적인 스마트팜 설치 및 작동 구조에 대한 이해가 깊고, 전기 및 시설 설비에 대해서는 나보다 실력이 좋아서 작업 시간도 빠르고 안심하고 테스트 검정이 가능하다.\n듬직한 김석재 회원의 뒷모습.. 제주도 스마트팜 관련 전기 분야에 있어서는 제주도 최고 베테랑이고, 외부 강의도 자주 나가시는 프로농사꾼이다.\n스마트팜 현장 설치에 있어서 공구 90%가 전기 관련 공구이며, 나머지는 프로그램 업로드 및 테스트를 위한 노트북 등이 있다.\n순환팬 원격 제어 테스트\n재생\n20\n좋아요\n0\n00:23\n\n접기/펴기\n김석재 농장 순환팬 원격 제어 테스트",
      "content_length": 575
    },
    {
      "id": "222934381857",
      "title": "2019.10.25 : 음수투약방식 관수 시설 물통 배치",
      "date": "2022. 11. 21. 15:20",
      "content": "음수투약뱡식 관수 시설 제작을 위해 하부 프레임 조립을 끝내고 물통을 구입해서 배치하였다. 총 6개의 1톤 크기 약제통을 사용할 예정이며, 하부에는 자연낙수에 의해 교반이 되도록 600리터 교반용 물통을 2개 배치했다.\n직수를 이용해서 자동 교반이 되기 위해서 외부에 들어오는 직수가 약통 사이를 관통할 수 있도록 설계했다.\n기존에 사용되던 릴레이 알람 제품을 구해서 내부 구조를 확인하다. 단순한다.\n접지를 포함한 릴레이가 배열되어 있다. 다만 프로그래밍 할 수 없다. ^^;\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 321
    },
    {
      "id": "222934379306",
      "title": "2019.11.15 : 고설베드 하부 커버로 천막지 설치",
      "date": "2022. 11. 21. 15:17",
      "content": "가변형 고설 베드를 만들면서 기존 하우스 자재를 최대한 활용하려고 한다. 새로운 부품을 설계, 제작하는 것도 필요하지만 기존 부품을 적용한다면 농민들이 쉽게 설치/유지/보수가 가능할 것이다. 그래서 시설하우스 하단부 천막지를 하부 커버로 선택하였다. 보통 폭은 1m 정도이고 길이는 100m 정도라서 충분히 사용될 수 있고 오랫동안 물에 노출되어도 부식되지 않는다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 258
    },
    {
      "id": "222934377646",
      "title": "2019.05.17 : 다단육묘베드 프레임 페인트 칠",
      "date": "2022. 11. 21. 15:15",
      "content": "다단육묘베드 프레임을 25mm 각관을 사용해서 용접으로 제작하였다. 각관 용접부위는 쉽게 부식되므로 스프레이형 방청제를 발랐는데 추가로 페인트 칠을 하였다. 굳이 할 필요가 없는데 이전에 집 수리를 하다가 남겨둔 친환경 페인트를 사용했다.\n작업할 때 제일 귀찮은 게 페인트 칠이다. 내한테 안 맞다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 221
    },
    {
      "id": "222934376678",
      "title": "2021.03.05 : 제주동부농업기술센터 시설하우스 개폐기 교체",
      "date": "2022. 11. 21. 15:14",
      "content": "제주동부농업기술센터에서 연락이 와서 급하게 시설하우스 개폐기를 교체하였다. 우성하이텍 제품인데, DC24V 전기 공급은 정상인데 개폐기만 작동되지 않아서 개폐기를 교체하였다.\n시설하우스 운영을 위해서는 꼭 테스트 기기를 구입해야 한다. 시설하우스 외부에 설치된 개폐기는 감전의 위험 때문에 DC24V에 작동되지만 작동에 필요한 전류량이 높아서 수리할 때 항상 주위를 기울어야 한다.\n차단기를 내려서 전선을 분리하거나, 개폐기에 분배되는 터미널을 테스트 기기를 통해서 전압을 확인하면 고장 원인을 잘 찾을 수 있다.\n기존 제품을 제거하고 새 제품으로 교환하였다. 교환 시 비닐이 풀릴 수 있으니깐 개폐 파이프를 다 풀어버리거나 고정한 뒤 교체한다.\n그리고 추가로 우성하이텍 양액기 교반통에서 약하게 양액이 흘러나와서 별도의 파이트를 조립해서 설치하였다. 농사짓는 엔지니어는 일이 많다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 492
    },
    {
      "id": "222932252291",
      "title": "2022.11.18 : 청상추 폐기하고 로메인 상추 정식",
      "date": "2022. 11. 18. 18:36",
      "content": "올해 8월말에 파종하고 재배를 시작했던 권농 청상추를 폐기하고 로메인 상추 정식을 했다.\n로메인 상추는 10월 초경에 파종을 했는데, 아래처럼 건강하게 잘 자라주었다.\n항상 작물은 햇빛을 받아야한다. 햇빛을 받지 못한 육묘는 힘이 없다.\n다구형 포트에서 잘 키웠던 청상추 뿌리 모습, 특히 흰색 비닐을 덮었던 곳은 뿌리의 발육 상태가 굉장히 좋다.\n정리하고 난 이후의 베드 상태, 아쉽다.",
      "content_length": 217
    },
    {
      "id": "222932158702",
      "title": "2019.10.24 : 아두이노 기반 학생용 교육 스마트팜 매뉴얼 제작",
      "date": "2022. 11. 18. 16:47",
      "content": "제주테크노파크 지원으로 자립형 스마트팜 매뉴얼을 제작하다. 아두이노 기반의 학생용 교육 매뉴얼을 제작하였다.\n친환경 개념과 아두이노 개념을 함께 표현했는데, 부족하다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 147
    },
    {
      "id": "222932157611",
      "title": "2021.03.04 : 제주농업기술원 외부 기상대 설치 및 데이터 수집 장치 확인 :",
      "date": "2022. 11. 18. 16:46",
      "content": "제주특별자치도 농업기술원 4번 하우스에 외부 기상대를 설치하였다. Ambient Weather Network 제품으로 국내에 설치된 곳이 몇군데 안 되는데, 맘꽃가든에 2대 설치해서 검증한 뒤 제주농업기술원에 설치함..\n설치는 그렇게 어렵지 않은데, 하우스 고정하는 것이 힘들다.\n기존에 사용하던 기상대 제품. Campbell 제품을 사용했다. 원리는 다 똑같고, 가격은 비싸다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 266
    },
    {
      "id": "222932155494",
      "title": "2019.11.06 : 입식재배시설 1구역 프레임 완성",
      "date": "2022. 11. 18. 16:44",
      "content": "가변형 고설 재배 베드 설계 이후에 시제품 제작하면서 1구역 프레임이 완성",
      "content_length": 41
    },
    {
      "id": "222932130394",
      "title": "2020.01.20 : LED 기반 다단육묘베드 발아 상태",
      "date": "2022. 11. 18. 16:18",
      "content": "식물재배용 LED 기반 다단육묘베드 발아 상태\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 79
    },
    {
      "id": "222931241352",
      "title": "2019.10.04 : ESP8266 기반 온습도 측정기(몰리어다이어그램)",
      "date": "2022. 11. 17. 16:21",
      "content": "ESP8266 기반 온습도 측정기(몰리어다이어그램) 모델 확인. 제주농업기술원 교육 참가\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 103
    },
    {
      "id": "222931235966",
      "title": "2019.07.16 : 고설베드 하부지지용 철판 설치",
      "date": "2022. 11. 17. 16:16",
      "content": "고설베드 하부지지용 철판 설치",
      "content_length": 16
    },
    {
      "id": "222931233564",
      "title": "2020.01.19 : 식물 LED 기반 다단 육묘 베드 현황",
      "date": "2022. 11. 17. 16:13",
      "content": "식물 LED 기반 다단 육묘 베드 현황\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 75
    },
    {
      "id": "222930491965",
      "title": "2022.11.16 : 한국농업기술진흥원 지원 우수사례 연구회 인터뷰 및 촬영",
      "date": "2022. 11. 16. 19:04",
      "content": "한국농업기술진흥원에서 추진하는 스마트팜 표준화 사업을 추진하면서 실증농가로 활동했던 연구회 회원분들과 인터뷰 및 촬영을 했다. 우수사례로 선정되어서 청장상 후보에도 올랐는데, 좋은 기회가 될 것 같다.\n김성훈, 강경옥(콩깍지농원), 우시영, 임병준(황금콩밭), 유도균(제주로의농부여행), 좌석훈(유인농원), 이경환, 오동규(채소점빵) 참석한\n모든 분들께 감사드린다.\n무엇보다도 부족한 맘꽃가든을 믿고 함께 해주시는 연구회 분들에게 감사드린다. 농민은 일이 너무 많고 힘들다.\n청장년 세대의 지속적인 농업활동이 이어지기 위해서는 실제 농민들의 삶이 바뀔 수 있도록 기술이 바뀌어야 한다.\n이전 회장님으로 활동하신 임병준 사장님이 인터뷰를 하고 계신다. 항상 솔선수범해서 공부하시고 노력해 주신다. 오늘도 수확하는 와중에 함께 해주셨다. 그래도 카메라 앞이라 긴장을 많이 하신 듯하다. 나도 인터뷰를 했지만 방송 출연은 옆에서 지켜보는 게 제일 좋다.\n실증 농장을 제공해주신 김성훈 형님... 항상 새로운 시도에 주저함이 없으시다.\n우리의 든든한 젊은 청년 농부, 우시영 사장.. 왜소해 보이는 모습의 반전은 추진력 짱이고 냉철한 자세를 항상 가지고 있다.\n주변에서 기대를 많이 하는 청년 농부이다.",
      "content_length": 613
    },
    {
      "id": "222928983645",
      "title": "2022.11.15 : 맘꽃가든 회사 소개서 제작 (한국농업기술진흥원 지원)",
      "date": "2022. 11. 15. 6:55",
      "content": "한국농업기술진흥원의 지원을 받아서 청장년 세대의 지속적인 농업 활동을 위해서 입식 재배 시설 기반 클라우드형 스마트팜을 개발하고 있는 맘꽃가든의 회사 소개서를 제작하다.\n8페이지에 걸쳐서 약 3년 동안 만들어 왔던 기술들을 소개하는 자료를 만들었다.\n항상 뭔가를 제작하면 누군가에게 평가를 받는다. 이번 회사 소개서에 대해서도 이런 얘기, 저런 얘기를 듣지만 세상에 없는 뭔가를 만든다는 창조의 기쁨은 항상 존재한다.\n끊임없이 도전하다보면 대한민국 농업 발전에 하나의 흔적은 남길 수 있을 듯하다.\nNext image",
      "content_length": 289
    },
    {
      "id": "222929637941",
      "title": "2022.11.15 : 제주도 IoT 개발자 연대 모임(?)",
      "date": "2022. 11. 15. 20:43",
      "content": "제주감귤박람회에서 우연한 만남을 가지게 된 엠솔루션의 김성훈 이사님 사무실을 방문하게 되었다. 3X6미터 컨테이너에서 정말 많은 일들을 하고 계셨다. IoT장치 개발에 필요한 모든 기자재와 솔루션을 다 가지고 계신 것 같다.\n기본적인 하드웨어 및 펌웨어 개발뿐만 아니라 3D CAD 기반의 제품 설계까지 가능하신 분을 제주도에서 만나고 같이 교류할 수 있음에 큰 행복을 느낀다. 항상 제주에 있으면서 인프라와 리소스 부족을 느낄 때 육지로 가고 싶다는 생각을 했는데, 좀 더 일찍 이런 분을 만나지 못했을까 하는 아쉬움을 가지게 된다.\n누군가에게 어지러운 창고일지 모르나, 나처럼 뼈속까지 엔지니어의 피가 흐르는 사람에게는 열정의 장소로 보인다. 기념사진 촬영까지 하게 되었다.\n오늘은 직접 맘꽃가든도 방문해 주셔서 스마트팜 개발 현황도 얘기드리고, 작물 재배 등의 어려움도 설명드렸다.\n가시는 글에 청상추 한묶음도 챙겨드렸는데, 이런 것들이 제주도에 있는 개발자들만이 나눌 수 있는 기쁨이 아닐까 한다.",
      "content_length": 506
    },
    {
      "id": "222929181463",
      "title": "2019.09.29 : 제주첨단과학단지 아쿠아포닉스 식물공장",
      "date": "2022. 11. 15. 11:56",
      "content": "제주첨단과학단지에 새롭게 카카오, 만나CEA, JDC가 함께 투자해서 2000평 규모의 아쿠아포닉스 식물공장을 설립했다. 첨단과학단지 방문 때 마다 작업하는 상황을 지켜보았는데, 이제 준공이 완료되고 작물을 재배하는 것 같다.\n내부에 각종 설비, 특히 정화조, 필터, 펌프, 수조,,,, 온갖 장비들이 갖추어져 있다.\n고설 베드위에 작물 재배하는 모습을 보니 대단하다는 생각을 했다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 268
    },
    {
      "id": "222929180969",
      "title": "2019.09.27 : 도사트론 음수투약 방식 관수시설 제작",
      "date": "2022. 11. 15. 11:56",
      "content": "6개의 양액통을 기반으로 한 도사트론(음수투약방식) 관수 시설 제작이 진행되고 있다. 바닥에서 올리기 위한 프레임제작은 완료하고 기본적인 물통들을 구입해서 배치하였다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 147
    },
    {
      "id": "222929180745",
      "title": "2019.09.26 : 식물공장 인성테크 전시장 방문 및 제품 견학",
      "date": "2022. 11. 15. 11:56",
      "content": "경기도 소재 식물공장 설비 제품 개발 업체 인성테크 전시장\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 86
    },
    {
      "id": "222929180170",
      "title": "2019.07.04 : 맘꽃가든 1차 테스트 실습장 구축 완료",
      "date": "2022. 11. 15. 11:55",
      "content": "실증장 구축 완료.. 피와 땀이.... TT; 하우스 작업할 때 떨어질 뻔 한적도 많고....\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 106
    },
    {
      "id": "222929179747",
      "title": "2019.06.16 : 고설재배베드 돌미나리 재배 테스트",
      "date": "2022. 11. 15. 11:55",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222929178440",
      "title": "2020.10.28 : 인플럭스 시계열 데이터 베이스 설치 (황금콩밭)",
      "date": "2022. 11. 15. 11:53",
      "content": "인플럭스 시계열 데이터 베이스 테스트 설치\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 77
    },
    {
      "id": "222929177607",
      "title": "2019.05.03 : 교육실습장 이동식 빔프로젝트 설치",
      "date": "2022. 11. 15. 11:52",
      "content": "교육 실습장 이동식 빔 프로젝트 설치 : 잘 활용하고 있다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 87
    },
    {
      "id": "222929177175",
      "title": "2019.05.02 : PROPLC 모듈 기반 릴레이 제어 테스트",
      "date": "2022. 11. 15. 11:51",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 53
    },
    {
      "id": "222929176899",
      "title": "2019.05.01 : 맘꽃가든 교육 실습장 거치대 색칠 & 바닥 작업",
      "date": "2022. 11. 15. 11:51",
      "content": "맘꽃가든 교육 실습장 거치대 색칠 & 바닥 작업\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜",
      "content_length": 80
    },
    {
      "id": "222929174848",
      "title": "2020.01.14 : 다단육묘베드 비타민채 파종",
      "date": "2022. 11. 15. 11:49",
      "content": "#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #파종",
      "content_length": 57
    },
    {
      "id": "222929174353",
      "title": "2020.01.13 : 다단육묘베드 비타민채 파종",
      "date": "2022. 11. 15. 11:48",
      "content": "다단육묘베드 비타민채 파종\n2020.01.11\n2020.01.11\n2020.01.12\n2020.01.12\n2020.01.13\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #파종",
      "content_length": 127
    },
    {
      "id": "222928079892",
      "title": "2022.11.13 : 로메인 육묘 광합성 활동 증대",
      "date": "2022. 11. 14. 9:06",
      "content": "작물 재배에 있어서 시작은 파종과 육묘이다. 파종은 파종시기와 발아온도를 맞추면 되지지만 육묘 과정은 생각보다 시간이 길다.\n육묘가 잘 된 개체는 추후 정식이후에도 품질이 상당히 좋다. 그렇기에 육묘에도 신경을 많이 써야 한다.\n그렇지만 육묘를 위해서 넓은 바닥에 두고 관리하게 되면 귀뚜라미의 표적이 되어서 제대로 남아나는 개체가 없다.\n그렇기에 나는 다단육묘베드를 만들어서 물주고 광은 식물 성장 LED를 통해서 보광을 하는데, 아무래도 직접 받은 햇빛의 능력을\n당해낼 수가 없다. 그래서 이번에 다단육묘베드에 있는 로메인 묘종을 밖으로 가지고 나와서 햇빛을 받게 두었다.\n햇빛을 받은 로메인 묘종이 싱그롭다. 파종한 지 2주 정도가 지난 상태이다.\n그리고 다시 날씨가 추워지고 비가 계속 와서 다단육묘베드로 가져왔다. 그래도 햇빛을 받은 개체는 입의 크기나 상태가\n다르다. 힘들겠지만 정식전에는 꼭 햇빛에 노출하는 것이 필요할 듯...\n정식할 자리가 없어서 아직도 다단 육묘 베드에 있는 청상추... 어디에라도 입양을 보내야 할듯.\n파종한 지 10일 정도 지난 로메인 묘종\n파종한지 4일 정도 지난 로메인 묘종... 항상 어린 새끼들을 보는 것은 행복이다. 사진에는 잘 표현되지 않았지만,\n모든 생명을 키우는 재미는 직접 경험해 보는 것에 있다.",
      "content_length": 644
    },
    {
      "id": "222928647285",
      "title": "2022.11.14 : 제주ICT협동조합 스마트 온실 모형 최종 보강 작업",
      "date": "2022. 11. 14. 19:29",
      "content": "제주감귤박람회 전시에 사용되었던 스마트 온실 모형을 제주농업기술원에 납품하기 위해서 제주ICT협동조합 조합원들이 열심히 최종 보강 작업을\n수행하고 있다. 다들 농업인임에도 불구하고 손재주, 열정, 능력이 대단하다. 옆에서 보고 있는데도 잠시도 쉬지 않고 작업하는 모습에서 배울점이\n많다. 특히 핵심 멤버들은 변함이 없다. ^^;\n다들 농사를 직접 짓고, 스마트팜 자재를 다루어 본 경험이 있어서 모형을 만드는데 있어서 표현이 정확하고 구체적이다.\n최종 전시를 위해서 냉각팬까지 직접 수작업으로 설치하고 있다.",
      "content_length": 284
    },
    {
      "id": "222927254598",
      "title": "2022.11.13 : 초보자는 로메인 수확, 숙련자는 청상추 수확",
      "date": "2022. 11. 13. 9:06",
      "content": "일요일 아침부터 로메인, 청상추 수확이 시작되었다. 상추는 매일 매일 잎 수확을 하지 않으면 비상품이 발생한다.\n공판장 판매 가격을 잘못 생각해서 청상추를 많이 심었는데, 현재 청상추 가격이 더 낮다.\n그렇다고 수확을 하지 않으면 안되니깐 간만에 제주도 방문한 처형이 일을 도와주었다.\n처형은 초보자라 로메인 수확하고, 숙련자이신 장모님은 청상추 수확을 진행했다.\n입식재배시설 편하게 일을 하시는데, 손에 흙이 묻어서 작업하기가 쉽지 않다고 하신다.\n숙련자이신 장모님이 초보자인 처형한테 수확한 로메인 담는 방법을 가르쳐 주고 계신다.\n푸른 초원에서 일하는 것 같아서 기분이 좋다고 하시는 처형... 돈 버는 것 보다 이렇게 시설을 만든다고 고생했다고\n격려해 주셔서 기분이 좋다.",
      "content_length": 380
    },
    {
      "id": "222927502110",
      "title": "2022.11.14 : 제주감귤박람회 제품 전시 3일차",
      "date": "2022. 11. 13. 16:51",
      "content": "제주ICT협동조합과 함께 제주감귤박람회 제품 전시 3일차가 되었다. 많은 농민들을 만나서 얘기를 나누지만 스마트팜에 관심을 가지시는 분들은\n주로 청장년층이시다.\n농업에 있어서 지속적인 농업 경영을 위해서는 청장년의 농업 경영 활동 참여가 필수적이다. 그런데 방문객 중에서 고령층 70%이고, 청장년 층은 10%도 안 되는 것 같다.\n그나마 방문하는 가족단위의 체험객이 전부다.\n그래도 농업인과 함께 대화하고 그분들에게 내가 만든 제품을 설명드리고 정보를 나눌 수 있다는 것이 좋다.\n제주ICT협동조합 김영종 조합원이 판매/설치하는 자동관수기 제품이다. 타이머 기반을 작동하는 제품이고 서귀포 지역에\n많이 설치한 신뢰성있는 제품이다. 이런 제품을 잘 사용하는 것도 필요하다. 다만 핸드폰 기반의 원격제어를 원하는 사용자가\n늘다보니 고민이 많다.\n제주도 청장년 농업인의 스마트팜 보급/확산을 위해 노력하고 있는 오길원 조합장이 열심히 스마트팜에 대해서\n설명하고 있다. 이번 제주ICT협동조합은 제주 표준 시설하우스 모형에 스마트팜을 구현해서 전시하였는데,\n반응이 엄청 좋다.\n농민에게 원격으로 시설하우스 구동 기기 제어 방법을 설명하고 있는 오길원 조합장!! 농사를 직접 지으면서\n이러한 연구회를 꾸려가는 모습이 정말 대단하다.",
      "content_length": 629
    },
    {
      "id": "222927398622",
      "title": "2022.11.12 : 입식 재배 시설 확장 및 부품 개선",
      "date": "2022. 11. 13. 14:06",
      "content": "입식 재배 시설 확장 작업을 시작하다. 이를 위해서 부품 개선 작업이 필요해서 부산에 있는 만성코퍼레이션을 방문하였다.\n시설하우스 부품 제작 전문 업체인 만성코퍼레이션의 박정훈 대표님을 만나서 입식 재배 시설 조립 부품 개선 방법에 대해서\n협의했다. 근래 기술적인 협의에 있어서 이렇게 친절하게 응대해 주신 분이 있으시니깐 힘이 난다.\n인간의 창조 및 개선 욕구 열정은 어딜 가나 대단한 것 같다.\n시설 확장 작업을 시작하기 위해서 임팩을 다시 들었다. 두달 내에 완성을 목표로 진행!!!!\n그래도 슬리퍼 신고 작업하니깐 발은 편하다. 발이 갑갑하고 땀 나는게 제일 싫다.. --; 농사 지으면서 느끼는 낙 중에\n하나가 옷이랑 신발을 내 맘대로 입을 수 있다는 거!!!",
      "content_length": 374
    },
    {
      "id": "222926545349",
      "title": "2022.11.12 : 제주ICT협동조합 박람회 공동 전시",
      "date": "2022. 11. 12. 6:24",
      "content": "제주ICT협동조합과 함께 제주감귤박람회 공동 전시 2일차에 참석했다. 오길원조합장이 만들어주신 배너에 작품 전시를 함께 하니깐\n이제 본격적으로 제품을 팔아야 하나 싶기도 하다. 많은 실전 테스트를 하면서 신뢰성을 높였지만 가야될 길이 멀다.\n그리고 드디어 회사 소개서가 나왔따. 200부 제작을 했는데, 생각보다 잘 나온 것 같다.\n입식재배시설 관련 자료도 잘 정리해서 넣었다.",
      "content_length": 211
    },
    {
      "id": "222925748501",
      "title": "2019.04.12 : 맘꽃가든 실증농장 바닥공사",
      "date": "2022. 11. 11. 9:04",
      "content": "맨 처음 하우스를 짓고 난 뒤 스마트팜 테스트 및 입식재배 테스트를 위해서 작업장 및 교육장을 만들었다. 약 25평 규모의 바닥을 방부목 세팅하기 위해서 각관으로 하부 바닥 공사를 시작했다.\n바닥 공사를 하기 전에 다단 육묘 베드나 기타 하수를 빼기 위한 하수관을 매립하였다.\n미니포크레인으로 작업한 하수관 위치를 잘못 잡아서 다시 삽으로 다 파냈다. 설계랑 치수 결정은 항상 중요하다.\n잘못하면 다시 시작하는 게 시간과 노력이 더 많이 든다.\n하수관 작업 뒤에 각관으로 수평을 잡았다. 혼자서 하는 일이 쉽지는 않지만 도전하는 것 자체가 중요하다.\n주요 부위에 전기선이랑 통신선 라인을 다 세팅하였다.\n특히 CD관이 꼬이지 않게 잘 잡아야 추후 확장하거나 작업 수정이 편하게 될 것 같다.\n어느 정도 바닥 공사가 마무리 되었다. 이 작업에 거의 한달을 보냈다.",
      "content_length": 426
    },
    {
      "id": "222925420322",
      "title": "2022.11.10 : 저푸른 초원위에 청상추가 끝없이",
      "date": "2022. 11. 10. 20:25",
      "content": "가변형 입식 재배 시설에서 청상추가 끝없이 자라고 있다. 현재 제주도 날씨가 상추 재배하기에 최적의 환경이라 큰 문제가 없이 잘 자라고 있다.\n그런데 너무 잘 자라서 문제다. 상추의 특성상 끊임없이 상추를 따줘야 하는데, 인력 수급이 문제다.\n그래서 아무래도 점점 로메인 상추 비중을 높여야 할 것 같다.\n로메인 상추 80% : 청상추 20% 정도... 청경채도 잘 자라고 있는데, 가격이 너무 낮다.\n먼곳에서 온 김승구 팀장이 농산물 가격이 너무 낮다고 안타까워 한다. 현재의 농산물 유통 체계 등을 봤을 때\n농민의 삶이 나아질 수 있을지 모르겠다.\n박대리가 수확해서 담은 청상추가 너무 가지런하다. 작물 키우는 애정이 높은 친구라 수확해서 정리하는 것도\n잘하고 있다. 이때까지 담은 청상추 세팅중에 제일 좋은 듯..\n청상추 재배는 줄이는 대신에 어떻게 하면 품질을 높일 수 있을지 고민해야 할 듯하다.",
      "content_length": 450
    },
    {
      "id": "222924944830",
      "title": "2019.09.25 : 경기도 부천 딸기 고설베드 스마트팜 농장 방문",
      "date": "2022. 11. 10. 11:05",
      "content": "경기도 출장길에 모 방송국에서 딸기 체험농장으로 소개된 농장을 방문하다. 경기도 부천 소재 농장인데, 사실 김포공항에 가깝다.\n기본 구조는 벤로형인데, 비닐로 천창을 덮었다고 하시는데, 이 당시에 설비비용이 평당 100만원이다.\n김포공항 근처에 이 넓은 땅을 가지고 있다는 것만해도 부럽다. 딸기 체험 농장 외에도 주말농장 등을 운영해서 가족 단위의 방문객을 유치하려고\n하시는 것 같다.\n딸기 베드에 사용될 상토!!! 양이 엄청나다. 스마트팜과 고설재배를 같이 하기 위해서 시설비용과 각종 농업용 자재 비용이 많이 들어간다. 쉽게 할수 있는 부분이 아니다. 최근에 (2022년 기준) 청년이 스마트팜 사업을 한다면 하면 최대 30억까지 대출해 준다고 한다.\n아직 체험농장 오픈 전이라서 내부 시설을 볼 수 있었다. 기본 시설 구조는 행잉베드 타입이다. 와이어?????\n좋은 지 모르겠다.\n환경 제어 시스템은 마그마 제품을 사용하고 있다. 그린씨에스 제품인데, 국산 스마트팜 제품중에 대표되는 제품인데, 현재 그린플러스가 인수한 걸로 알고 있다.\n체험 농장 시설이라 관리가 너무 좋다.",
      "content_length": 550
    },
    {
      "id": "222924943025",
      "title": "2019.08.05 : 관수용 밸브 밸콘 본사 방문",
      "date": "2022. 11. 10. 11:03",
      "content": "관수용 밸브는 크게 두가지로 나뉠 수 있다. 릴레이 타입의 버마드 제품, 개폐기 타입의 밸콘 제품이다. 버마드 제품은 사용했을 때 릴레이 신호를 계속 유지해야 하는 단점이 있다. 밸콘 타입은 수동 조작과 동일하게 열때, 닫은때 제어 신호를 주기만 하면 된다.\n내구성도 좋고 저전력으로 작동해서 계속 사용하고 있는데, 가격이 높다.\n부산에 있는 밸콘본사를 방문해서 제품 카달로그 및 제품 구경도 했다. 하나의 제품으로 시장을 개척하는 모습에 대단함을 느끼고 배운다.\n볼밸브까지 다양하게 있다. 제어를 하다보니 이제 컨트롤 박스 정도는 아무것도 아닌듯...\n항상 센서랑 결합해서 인간의 목적에 맞게 자동 제어하는 통합 제어 방식이 힘들다.\n사람의 기대치를 맞춰주는 제품을 개발하는 것은 개발자의 난제이다.",
      "content_length": 392
    },
    {
      "id": "222924942310",
      "title": "2020.01.09 : 추운 날씨에 씨앗 파종",
      "date": "2022. 11. 10. 11:02",
      "content": "난방도 없는 추운 날씨에 비닐하우스 안에서 씨앗을 파종하다. 사위 잘못 만난 장모님이 고생이 많다. 파종기를 구입하지 못해서 작은 씨앗을 하나씩 손으로 넣고 있다. 아련한 추억이다.\n작물재배용 LED도 잘 작동하고 있지만, 효과는 없다. 가지런하게 놓은 묘종판을 보니 행복하다. 다만 작물 생육에 효과가 있기 위해서 많이 설치해야 함... 결국 다 돈이다.",
      "content_length": 199
    },
    {
      "id": "222924941541",
      "title": "2020.10.21 : 성산 강정훈 농가 관수 제어 보드 설치",
      "date": "2022. 11. 10. 11:02",
      "content": "자립형 스마트팜 연구회 회원인 강정훈 농가에 50A 관수 밸브 두개를 원격제어하는 관수 제어 보드를 설치했다. ESP8266 보드에 쉴드를 결합하고 모터드라이브로 제어한다.\n초기 제품이랑 하드웨어가 엉성하다. 스마트팜의 핵심은 하드웨어보다는 소프트웨어 있다. 하드웨어는 점점 갈수록 단순해지고 강력해 질것 같다.\nESP시리즈와 같은 MCU보드의 탄생은 제어시스템 변화의 중요한 축이 될 것 같다.\n재배 후 수확중이 생강이 보인다. 스마트팜 개발은 절대적으로 작물재배, 재배시설, 시설제어가 함께 되어야 함을 현장에서 직접 느낀다.\n사용자는 작물과 농민이다. 두 개체를 모두 만족시킬 수 있는 제품을 만드는 게 스마트팜이다.\n현장에서 직접 전기선 피복도 벗기고 간단한 유지보수를 수행한다.\n집에 돌아와서 아들과 라즈베리 파이 기반의 라인트레이서 모듈 세팅을 하다. 좋은 세상이 하루만에 라인트레이서 차량도 제작하다.",
      "content_length": 455
    },
    {
      "id": "222924940974",
      "title": "2020.07.21 : 제주동부농업기술센터 야간 연구회 활동 :",
      "date": "2022. 11. 10. 11:01",
      "content": "제주동부농업기술센터 강의실에서 야간 연구회 활동을 하였다. ESP8266칩이 내장된 아두이노메가 기반의 관수 밸브 제어 시스템이다. 웹서버 구성하고 웹서버에서 개별 농장별로 정보를 받아서 제어할 수 있도록 구성하였다. 열의가 대단함을 연구회 회원분들의 눈빛으로 알수가 있다.\n다들 핸드폰을 작동됨을 확인하고 신기해 하신다. 농민들에게 이러한 시스템을 교육하는 것은 제일 먼저 \"유지보수\" 그리고 \"제품 신뢰성 테스트\", 사용상의 문제점을 알려주는데 있다고 생각된다.",
      "content_length": 260
    },
    {
      "id": "222924939450",
      "title": "2019.04.30 : 중앙 분전함 설치 및 개폐기 DC 24V 교류 변압기 세팅",
      "date": "2022. 11. 10. 10:59",
      "content": "맘꽃가든 실증농장을 세팅하면서 전기 배선에 있어서 고민을 많이 했다. 일단 기존 단상을 삼상으로 변경하고 전신주 작업을 다시 했다.\n전신주 작업은 안전이 제일 문제이고, 접지 작업도 해야 한다. 하우스 입구에 메인 전원함을 세팅한 뒤 아무래도 하우스 내부에 다양한 기기를 설치할 것 같아서 추가로 시설하우스 중앙에 전기를 공급하기 위한 중앙 분전함을 설치했다.\n분전함 설치는 스피트바 제품을 사용하면 어렵지 않게 설치가 가능하다. 그리고 허용전류 기준으로 배선용차단기(MCCB), 누전용차단기(ELCB)를 잘 설치하면 된다. 그리고 중요한 것이 전선 종류와 굵기 설정이다.\n전기 전문가 아니면 이러한 부분을 적용하기는 쉽지 않은데, 하다보면 쉽다. 관련 자료도 인터넷에 많다.\nHIV, VCTF, CV 정도만 이해할 수 있으면 된다. 전선 굵기 1.0SQ, 1.5SQ, 2.5SQ, 4.0SQ, 6.0SQ 등도 이해할 필요가 있다.\nDC 24V를 사용하는 개폐기 제어 위해서 변압기와 다이오드를 구입해서 설치했다. 민웰 SMPS를 사서 테스트를 했는데, 비닐올리는데 역부족이다.\n안전 때문에 DC24V를 사용하지만 전류를 많이 먹는다. 변압기 용량이 엄청나게 커야함.",
      "content_length": 597
    }
  ]
}