{
  "title": "맘꽃가든 스마트팜 구축사례 - 2024년",
  "year": "2024",
  "total_cases": 70,
  "cases": [
    {
      "id": "223600944540",
      "title": "2024.09.28 : 청소년 노지 상추 재배 체험 구역 정비",
      "date": "2024. 9. 29. 21:03",
      "content": "10월에 유독 체험 및 견학 일정이 많이 생겨서 농장 입구 및 주차장 정비에 들어가다..\n청소년 노지 상추 재배 체험 구역도 만들어야 되고 쉴 수가 없네..\n그래도 농업일 하면서 가장 재미난 일이 미니 포크레인 작업이다. 하루가 그냥 간다.\n그래도 항상 상하차 시에는 긴장감 백배!!!!!\n오늘도 무사히 내려서 작업 완료다. 내일까지 작업해서 잘 반납해야 할 듯..\n노지 체험장 정비\n재생\n8\n좋아요\n0\n00:20\n\n노지 체험장 정비",
      "content_length": 242
    },
    {
      "id": "223596749614",
      "title": "2024.09.24 : 기후온난화 인한 고온 피해 확산",
      "date": "2024. 9. 26. 6:13",
      "content": "맘꽃가든 8월달 온도 데이터를 확인해 보니, 하루종일 25도 이하로 내려간 날이 하루도 없다. 역대 최장 70일 이상 열대야가 지속된 것이 데이터로 확인된다.\n일중 온도는 매일 35도에서 38도를 오가고 있었다.\n심지어 다른 감귤 농장 온도 센서를 확인해 보니 43도까지 올라간 기록도 남아있다..\n이런 고온에도 잘 버텨준 감귤들이 정말 대견해 보인다.\n그런데 기후온난화가 심화될수록 시설과수 농사를 10년 이상 지속 가능한 영농 계획으로 유지하는게 쉽지 않다.\n오늘 방문했던 농장주는 이미 추석전에 열과를 제거했는데 추가로 발생하지 않기를 바라고 계신다..\n이제 정말 가을이 와야한다. 낮기온이 좀 더 서늘해 지고 더 이상 태풍도 발생하지 않고 무사히 지나갈 수 있었으면 좋겠다.\n2진수로 단순하게 디지털화된 세상에 아직 자연은 자신을 좀 더 아껴주고 보살펴 달라고 하는 것 같다.\n편리하면서도 작물이 잘 자랄 수 있는 지속가능한 농업 기술은 어디에 있을지??",
      "content_length": 482
    },
    {
      "id": "223594450528",
      "title": "2024.09.23 : 농촌진흥청 축산과학원 관계자 스마트팜 특강",
      "date": "2024. 9. 24. 11:57",
      "content": "농촌진흥청 국립축산과학원 김창한 박사님의 요청으로 제주도 스마트팜 특강을 하는 기회를 가졌다.\n축산 분야에서 나에게 강의 요청이 들어와서 의아해 했는데, 상추키우는 나로서는 양돈도 중요한 사업 파트너이기에 편하게 현재 맘꽃가든이 가진 기술 및 개발현황에 대해 설명드릴 수 있었다.\n축산쪽도 축사관리 측면에서 센서와 구동기를 관리라는 동일한 시스템 구조를 가진 부분이 많아서 인지 즐겁게 얘기하고 의견을 나눌 수 있었다.\n특히 각 지역별 농업기술원 및 농업기술센터 담당자 분들도 계셔서 다양한 기술정보를 교류할 수 있었다..\n스마트팜 시작한 지 이제 4년차.. 농촌진흥청 전문가 분들 모시고 사례 발표할 기회도 생기고...\n내년에 또 이런 기회가 생긴다면 2세대 스마트팜 기능을 시연할 수 있도록 하고자 한다..\n오늘 하루도 알차게!!!!!",
      "content_length": 413
    },
    {
      "id": "223592936272",
      "title": "2024.09.20 : 순환팬 2채널 제어 박스 설치",
      "date": "2024. 9. 23. 9:01",
      "content": "작물재배 들어가면서 5개동에 순환팬 2채널 제어위한 제어함 설치.. 바닥에 공구깔아 놓고, 하드웨어 조립, 소프트웨어 업로드하면 끝!!!",
      "content_length": 76
    },
    {
      "id": "223581262793",
      "title": "2024.09.11 : ICT융합품질 인증 심사",
      "date": "2024. 9. 12. 8:33",
      "content": "이틀동안 ICT융합품질인증 시험 검사를 무사히 마쳤다.. 120페이지에 달하는 시험 항목을 시연하고 항목별로 동영상 촬영 및 결과 이미지 캡쳐등을 통해 해당 시스템 정상 작동여부를 확인하는 작업을 거쳤다.\n모든게 처음하는 일이라 일부 수정 보완 사항이 있었지만, 시험관이 시험 항목 개수 대비 순차적으로 잘 준비하신 것 같다고 평가해 줬다. 최종 결과 평가는 아직 남아 있다.\n매 순간 시험 불가 판정이 나올까봐 노심초사했는데, 이번 시험 준비를 잘 해준 강팀장이 너무 고맙다. 내가 인복이 많은 것 같다.. ^^;\n이제 테스트 항목별로 수정 보완 작업해서 자료 보내고 다시 검토 확정되면,,,, 9월 말 최종 심사 위원회에 자료 전달이 가능할 듯 하다.\n이렇게 또 슬라워 시스템은 업그레이드 된다..\n시험관이 시험 항목별로 페이지 한장씩 넘길 때 마다 긴장감이 몰려온다..\n이틀동안 진행된 시험 과정이 무탈하게 진행되었다. 국가 품질 인증이 어렵다는 걸 다시 배운다.\n잘 준비해준 직원들에게 너무 감사하다.. 이번 추석은 가벼운 맘으로 보낼 수 있을 것 같다.\nICT융합품질 심사\n재생\n8\n좋아요\n0\n00:11\n\nICT융합품질 심사",
      "content_length": 578
    },
    {
      "id": "223578721005",
      "title": "2024.09.10 : ICT융합품질 인증 테스트 준비",
      "date": "2024. 9. 10. 8:46",
      "content": "ICT융합품질인증 시험날이 밝았다... 시험을 앞두고 여러번 시운전 테스트 진행중!!!! 시험관이 직접 현장 시험하겠다고 한다. 다행히 장비들고 시험기관가서 재세팅해야 하는 불편은 없어졌다.\n오늘부터 이틀동안 긴장된 일정을 보낼 것 같다.. 맘꽃가든이 만든 장비가 공공기관 납품위한 성능 시험을 받는다니 기쁘다!!!\n노력한 만큼 좋은 결과가 나오기를...\nICT융합품질 테스트\n재생\n7\n좋아요\n0\n00:05\n\nICT융합품질 테스트",
      "content_length": 240
    },
    {
      "id": "223541873055",
      "title": "2024.08.08 : 🐔 스마트팜 친구",
      "date": "2024. 8. 9. 11:24",
      "content": "어느샌가 현장에 갈 때 마다 닭이 나를 반겨주는 친구가 되어간다. 농장 내 잡초 제거 및 병충해 방제를 위해서 닭을 키우는 농가가 많은데, 암닭이 주인인줄 알고 나에게 다가온다. 외롭지 않은 작업 현장이다.",
      "content_length": 115
    },
    {
      "id": "223539254640",
      "title": "2024.08.06 : 데이터기반 스마트농업확산사업 사용자 설명회",
      "date": "2024. 8. 7. 8:56",
      "content": "농림축산식품부 지원 사업으로 진행중인 데이터기반 스마트농업확산사업 농가 대상으로 스마트팜 시스템 설명회를 개최했다. 한남리 이장님을 비롯한 제주지역 30개 농가 관계자들이 바쁜 농사일정에도 참가해서 클라우드 기반 스마트팜 시스템 사용법 및 개선 사항등을 설명하는 시간을 가졌다.\n아침부터 시연용 장비 챙겨서 남원읍까지 가서 장비 시연 세팅을 하는데, 에어컨도 안켜지고, 인터넷도 안되어서 오늘 설명회가 잘 되려나 했는데 많은 분들의 도움으로 잘 마칠 수 있었다..\n날씨가 너무 더워서 찾아오시는 분들이 있으려나 했는데, 뒷자리까지 다 채워지고 설명회 도중에도 땀흘린 그대로의 모습으로 조심스럽게 찾아오시는 농장주도 계셨다..\n현재의 모습이 100% 완벽할 수 없어도 맘꽃가든의 기술 성장을 기다리는 농업인들이 있다는 것에 감사한다.\n제주농업의 변화와 미래를 위해 오늘도 하루하루를 잘 채워나가리라!!!",
      "content_length": 448
    },
    {
      "id": "223536257754",
      "title": "2024.08.04 : 농업의 변화를 시도하는 사람들",
      "date": "2024. 8. 4. 19:56",
      "content": "즐거운 전화 한 통화!!! 주말이 없는 서귀포 농가 방문 위해 중산간 넘어서 태흥리 방문 중에 전부터 알고 있던 시설하우스 설치 업체 사장님이 연락주셨다.. 내년 스마트팜 사업에 같이 협업했으면 하신다고!!!\n절실한 맘으로 개발해 온 나의 제품을 같이 하자고 연락주시는 시설하우스 관계자분들도 생기고 있다. 더운 날 서귀포 출장 가는 기분이 가벼워진다.\n서귀포 농가 방문해서 스마트팜 설정하고 데이터 분석 방안도 알려드리고.. 확실히 청년 농업인들은 변화를 두려워하지 않는다. 오히려 절실하게 농업이 변화될 수 있도록 도움줘서 감사하다고 한다..\n내 주변에 변화를 시도하는 사람들이 모이고 있다!!!",
      "content_length": 335
    },
    {
      "id": "223567091350",
      "title": "2024.08.29 : 차세대 스마트팜 플랫폼 워크샵 참가",
      "date": "2024. 8. 31. 8:23",
      "content": "농촌진흥청 시설원예연구소에서 추진하고 있는 차세대 스마트팜 플랫폼 아라온실 상용화 드림팀 워크샵에 참여했다. 농업인들에게 보급형 스마트팜 시범 설치 사업 등을 위한 다양한 정보를 받았고, ICT 기반의 진정한 스마트팜 기술이 표준화 되고 보급되지 않을까 ?? 기대해 본다. 해당 사업을 주관하는 방지웅 박사의 노력이 느껴진다.\n이제 \"슬라워\"가 KC마크를 인증을 받은 스마트팜이 될 수 있도록 하나씩 개선 작업을 추진하고자 한다....",
      "content_length": 243
    },
    {
      "id": "223565436754",
      "title": "2024.08.28 : 김제스마트팜혁신밸리, 아름농장 with 제주ICT협동조합",
      "date": "2024. 8. 29. 19:25",
      "content": "차세대 스마트팜 플랫폼 참여기업 대상 워크샵 참석차 대전에 출장 왔다가 김제스마트팜혁신밸리와 아름농장 견학을 다녀옴.. 6,000평 규모의 무빙거터방식의 상추 재배 농장주분과 나눈 진실한 대화는 나에게 많은 가르침을 주셨다. 남이 가지 않은 길을 가는 것은 정말 어려운 일이다. 주변에 이래라 저래라 말만 하는 사람도 많지만, 이렇게 묵묵히 실천해 가면서 자신의 노하우를 아낌없이 공유해 주시고 시련을 극복해 가는 분들이 있기에 하루하루 또 다시 최선을 다한다.",
      "content_length": 258
    },
    {
      "id": "223560786495",
      "title": "2024.08.36 : 차광막 개폐기 설치",
      "date": "2024. 8. 26. 8:10",
      "content": "초여름에 설치했어야 할 차광막 개폐기를 이제서야 설치하고 테스트 실시!!! 시설만감류 농가에 스마트 관수 설치한다고 7,8월 정말 열심히 다녔다. 그러다 보니 맘꽃가든 농장 운영이 많이 소홀해 졌다. 그렇다고 농장이 사라지는 것이 아니니, 또 다시 하나씩 세팅해 가면 될듯..\n그리고 무엇보다도 여름에 열심히 일해서 체중도 5kg 빠지고 이제 다시 몸과 마음을 잘 정비해서 수확의 계절.. 가을을 대비하자..\n차광막 개폐기\n재생\n29\n좋아요\n0\n00:26\n\n차광막 개폐기",
      "content_length": 263
    },
    {
      "id": "223552634066",
      "title": "2024.08.17 : 안정적인 관수 시스템 운영",
      "date": "2024. 8. 19. 8:32",
      "content": "관수 시스템 설치하면서 항상 맘이 쓰이는 곳이 양수기 펌프이다. 열악한 시설 하우스 환경에서 양수기 설치를 농민이 직접하거나, 주위의 기술자에게 부탁하는 경우가 많은데, 관련 배수 파이프를 설치하다보면 안정적인 관수 시스템 운영을 위한 설치가 되지 못하는 경우가 많다.\n이러한 환경에서 양수기 작동과 구역별 밸브가 원할하게 운영되는게 스마트 관수 시스템 핵심 역량이다.\n비싼 가압식 인버터 펌프 쓰면 좋겠지만, 5마력 이상의 고출력 제품은 아직 농민들이 쓰기에는 가격 부담이 너무 크다. 그래서\n기존 모터와 연결된 양수기 기반으로 잘 작동하게 만들려니 전기, 안전, 배수, 설치 위치 등... 변수가 너무 많다...\n오늘도 스마트팜 설치 농가에 와서 운영 현황을 확인하는데 잘 작동되는 소리를 들으니 기분이 좋다.\n양수기 펌프야 무사히 잘 작동되기를 바란다!!!!\n양수기 작동\n재생\n15\n좋아요\n0\n00:11\n\n양수기 작동",
      "content_length": 460
    },
    {
      "id": "223549492255",
      "title": "2024.08.14 : TEROS 토양센서 설치",
      "date": "2024. 8. 16. 8:10",
      "content": "이번에는 토양센서 설치로 땀범벅... 시험포장에 6개의 TEROS 센서 배선 작업 및 데이터 수집기를 설치하다.. 토양센서 기반으로 자동관수하기 위한 연구들이 꾸준하게 진행되고 있다. 이번에 설치한 제품은 외부 안테나형으로 기존보다 1.5배 정도 먼 거리에서도 WIFI 접속 및 데이터 수집이 가능한 제품으로 설치했다.\n그리고, 작업자들이 밟아도 문제가 없도록 CD관에 센서선을 삽입하고 부직포를 다시 덮어주었다.\n이번에도 토양 데이터가 잘 측정되기를 바래본다. 현장 전문 사장은 오늘도 백공이 된 것을 후회한다. ^^;",
      "content_length": 291
    },
    {
      "id": "223544949073",
      "title": "2024.08.10 : 센서 교체 작업",
      "date": "2024. 8. 12. 10:44",
      "content": "센서 데이터 수신 불량 시 카카오톡 점검 알람 발송 기능을 만들었는데, 주말에 센서 불량이 발생하니깐 회사 대표가 하우스 기둥에 매달려 센서 교체 작업을 진행했다. 더운 여름날 하우스 최상부 온도는 45도!!!!!\n40mm 파이프 위에 올라서서 4가닥 전선 연결 작업을 하고 나니깐 옷이 다 젖었다.. ㅎㅎ 그래도 고생했다는 농장주 말 한마디에 기분 좋게 떠난다.",
      "content_length": 203
    },
    {
      "id": "223533027679",
      "title": "2024.07.31 : 농업인 설치팀/스마트팜 개발자 기술 간담회 개최",
      "date": "2024. 8. 1. 15:34",
      "content": "제주ICT협동조합 설치팀과 맘꽃가든 스마트팜 개발자 간담회 실시...\n농민이 원하는 스마트팜을 만들기 위해 맘꽃가든 개발자가 직접 설치팀을 만나서 현장 설치의 어려움, 관수 제어, 데이터 모니터링의 개선 요구 사항을 청취하였다. 또한 소프트웨어 개발자로서 해당 서비스 제공의 어려움 및 알고리즘 구성의 난이도도 전달하였다.\n~~ 이 간담회가 얼마나 의미있는 자리가 될지는 기존 사용자의 만족도에 달려 있으리라..\n어느덧 올해 4월부터 진행했던 맘꽃가든 데이터 기반 스마트팜 설치 농가가 50호에 가까워 지고 있다. 폭염에도 비닐하우스 파이프에 매달려 전기, 통신, 관수 설비 작업을 진행해 준 제주ICT협동조합 설치팀에게 감사의 맘을 전한다.\n그리고 간담회 이후 다양한 요구사항을 어떻게 반영할 지 고민하는 맘꽃가든 개발팀을 응원한다.\n나는 이제 그들이 함께 제주도 스마트팜을 혁신적으로 바꿀 환경을 만들어 줘야된다... 폭염에도 포기는 없다!!!",
      "content_length": 474
    },
    {
      "id": "223531366764",
      "title": "2024.07.31 : KT CCTV 설치기사 만행(전원선 뽑기)",
      "date": "2024. 7. 31. 8:48",
      "content": "KT CCTV 설치 기사의 만행... 스마트팜 설치를 위해서는 인터넷 망 구성이 필수다. 오늘 오전에 신규로 설치한 농가에서 양수기 구동을 예약해 놓고 작업중인데, 종료가 되지 않고 점검 알람이 온다고 연락이 왔다. 그래서 전화상으로 수동으로 종료하는 법을 알려드렸다. 현장 작업 마치고 사무실 복귀하는 길에 해당 농가에 가보니 KT CCTV 설치 기사가 기존 와이파이 모뎀 전원선을 빼놓고 CCTV 어뎁터 전원선을 꽂아둔 것이다. 양수기 예약 작동 중에 전원선 바꾸고 작업 완료했다고 간 버린 것이다. 심지어 어뎁터는 외부에 노출시킨 채로....\nTV 설치 기사가 와서 기존 냉장고 전원선을 빼서 그 자리에 TV전원을 꼽고 물 떨어지는 밖에다 둔 것과 같다!!!!!\n최근에도 고온 시기에 하우스 개폐기가 고장나는 바람에 평생 키워 온 나무를 죽이는 사고가 발생했다. 전기 화재도 발생한 것 같은데, 이런 사고가 발생하면 농가는 전 재산을 날리게 된다.\n스마트팜 사용은 곧 전기와 통신을 함께 사용하는 것인데, 노후화된 시설하우스에서는 이런 문제가 발생할 가능성이 높기에 항상 전기, 통신 설치 및 안전에 대해서 농민들에게 말씀드리는데,,,\n어처구니 없게도 KT CCTV 설치 기사가 이렇게 무책임하게 기존 전원선을 뽑아버리고 자기 선을 꼽다니, 만에 하나 개폐기 제어에 연결된 채로 요즈음 날씨에 작동을 안했다면 어찌되었을지???\n생각만해도 아찔하다.. 다들 맘 편하게 사용할 수 있는 스마트팜은 갈길이 멀다..",
      "content_length": 735
    },
    {
      "id": "223530279835",
      "title": "2024.07.30 : 새벽 5시 관수 서비스 시작 알람",
      "date": "2024. 7. 30. 10:45",
      "content": "새벽5시에 울리는 반가운 카톡소리.. 슬라워 설치 농장이 늘어나면서 반가운 관수 서비스 시작 알람이 들리고 있다. 관수 주기 데이터 확보 및 운영 모니터링 때문에 시범사용 기간 동안 공동 관리자로 등록해 놓고 있는데 아침마다 이렇게 알람을 받으면서 스마트팜 기술이 이제 농민에게 도움이 될 수 있다는 확신이 생긴다. 특히 날씨가 더워지고 본격적인 비대기 관수가 시작되면서 해당 서비스 사용 횟수도 늘어나고 있어서 데이터 분석을 잘하면 감귤 재배 주기별 자동 관수 스케쥴 세팅 기술 구축이 가능할 듯!!!!",
      "content_length": 282
    },
    {
      "id": "223524816096",
      "title": "2024.07.24 : 현장 농업인 교육 및 요구사항 반영 과정",
      "date": "2024. 7. 25. 10:14",
      "content": "현장에서 직접 농업인을 만나고 개별 감귤 농장에 맞는 관수 시스템을 구축해 가는 과정이 이제 자리를 잡아가고 있다. 더운 날씨에도 자식같은 농산물을 생산하기 위해 노력하는 농민들을 만나서 관수 스케줄러를 어떻게 사용하고 재배력 데이터를 확인하는 방법을 전달하면서 시스템 개발자가 고객의 요구사항을 반영하는 과정이 얼마나 중요함을 느낀다.\n맘꽃가든 스마트팜은 이제 매년 새로운 버전 출시에 포함될 고객의 요구사항이 넘쳐난다!!!",
      "content_length": 238
    },
    {
      "id": "223498943493",
      "title": "2024년 6월 31일 : 맘꽃가든 후계자 육성 첫발 내딛다...",
      "date": "2024. 7. 2. 17:53",
      "content": "세대간 지속 가능한 농업 모델 구축을 목표로 밑바닥부터 다져온 스마트팜 기술 개발 과정을 최종적으로 완성하기 위해 후계자 육성이 진행되고 있다. 나의 길을 따라가겠다고 올초에 한국농수산대학교 원예시스템학과에 입학한 조카가 방학기간 동안 맘꽃가든에서 연수를 시작한다. 운전도 가르치고, 센서 설치하는 법, 전선 연결하는 법도 함께 얘기하고 있다. 딸바보 동생은 자기 딸이 형님의 길로 간다고 하니 맘이 더 애틋한 듯하다. 이제 맘꽃가든도 청년농업인 육성에 한걸음 더 나아가고 있다.\n후계자 운전 연수\n재생\n41\n좋아요\n0\n00:18\n\n후계자 운전 연수",
      "content_length": 307
    },
    {
      "id": "223517442343",
      "title": "2024.07.17 : ICT융합품질 인증 시험 장비 구축",
      "date": "2024. 7. 18. 20:17",
      "content": "제품 신뢰성 확보 및 조달청 우수제품 지정 신청 위해서 ICT 융합품질 인증 시험용 장비를 구축하다. 오전에 장비 세팅이랑 자료 준비하고, 오후에는 농가 방문해서 프로그램 설치 및 업그레이드 하면서 하루를 보낸다. 이제 국가에서 품질 인증 받은 제품으로 한발자국 또 전진한다.",
      "content_length": 154
    },
    {
      "id": "223511976073",
      "title": "2024.07.11 : 상반기 관수 시설 개선 및 스마트팜 설치",
      "date": "2024. 7. 14. 9:11",
      "content": "7월 장마가 시작되어도 관수 시설 개선 및 스마트팜 설치는 계속 되고 있다. 어려운 조건에도 최선을 다하는 설치팀에 감사를 드린다. 오늘 하루 바람 불고 비오는 날씨에 조용히 2024년 상반기를 되돌아 본다..",
      "content_length": 117
    },
    {
      "id": "223469504598",
      "title": "2024.06.04 : 본격적인 청년 농업인 스마트팜 설치 작업",
      "date": "2024. 6. 5. 7:37",
      "content": "청년 농업인으로 이루어진 제주 ICT 협동조합 스마트팜 설치팀... 농가들 환경이 달라서 설치하는 과정에서 많은 좌충우돌이 생기겠지만 우리는 즐기면서 한걸음씩 성장해 갈 것이다. 그들도 나도 평생 농업인으로 있어야 하니깐!!!",
      "content_length": 126
    },
    {
      "id": "223468360915",
      "title": "2024.06.02 : 국립산림과학원 관계자/인도네시아 국립 스리위자야 농과 대학 교수님 방문",
      "date": "2024. 6. 4. 8:59",
      "content": "국립산림과학원 연구자 및 인도네시아 국립 스리위자야 농과대학 교수님들이 맘꽃가든 재배 시설 방문을 해주셨다. 슬라워 시스템 시연 및 입식 베드 시스템을 영어로 설명하는 즐거운 시간이었다. 이제 일도 즐겁고 사람 만나는 것도 즐겁다. 내가 꿈꾸는 세상은 쉽게 오지 않아도 나는 Keeeeep Gooooing!!!",
      "content_length": 173
    },
    {
      "id": "223495019196",
      "title": "2024년 6월 28일 : 스마트팜 현장 설치 전용 앱 개발 완료",
      "date": "2024. 6. 29. 6:30",
      "content": "개별 농가마다 다른 설치 환경 때문에 스마트팜 제품 설정하는데 어려움이 많았는데, 이번에 현장 설치 요원 또는 농민이 바로 현장에서 수정 / 업데이트 할 수 있는 모바일 앱을 개발 완료하였다.\n현장에서 바로 WIFI 연결 설정 및 장치 연결 내용을 업데이트할 수 있다. 이제 점점 더 현장에 맞는 스마트팜 시스템으로 거듭나고 있다.",
      "content_length": 185
    },
    {
      "id": "223486844807",
      "title": "2024.06.21 : 농정원 스마트농업기획실 청수리 설치 현장 방문",
      "date": "2024. 6. 21. 15:44",
      "content": "한경면 청수리 꼬맹이농장 사모님, 대정면 신도리 하우스 설치 사장님이랑 감귤 재배 위한 데이터 기반 스마트 농업 기술 개발 방향에 대해서 현장 토론을 진행하다. 그리고 이어진 농정원 스마트농업기획실 관계자들과 현장 견학 및 토론이 이어졌다.. 특히 토양센서 설치에 대해서 다양한 질문과 답변이 이었다. 이렇게 현장에서 만나는 사람이 많아질수록 제주 스마트팜이 성숙되어지지 않을까???",
      "content_length": 214
    },
    {
      "id": "223478507594",
      "title": "2024. 06. 12 : 제주농업기술원 시험 포장 토양수분장력 센서 재설치",
      "date": "2024. 6. 13. 19:26",
      "content": "제주농업기술원 시험포장에 설치된 토양수분장력 센서 측정값이 불안정해서 센서를 재설치하다. 기존 20cm 내외 깊이로 심었는데, 토양의 수분 흡수율이 높은지 계속 과습 상태에 있어서, 재설치하였다.\n작은 자갈을 걸러내기 위한 채망을 사용해서 흙을 걸러내는 작업을 진행하다.\nTEROS21 토양수분장력센서 설치\n재생\n17\n좋아요\n0\n00:43\n\n접기/펴기\nTEROS 21 토양수분장력센서 설치",
      "content_length": 217
    },
    {
      "id": "223474420531",
      "title": "2024.06.09 : 관수 제어 시스템 및 환경 센서 현장 설치",
      "date": "2024. 6. 10. 10:44",
      "content": "현장에서 답을 찾아야 한다.. 노트북 들고 설치 농가 가서 데이터 확인하고 농민에게 작동 방법 설명하는 과정을 끊임없이 반복하고 있다. 제주도 농업 현실에 맞는 스마트팜을 만들고자 하는 믿음에 흔들림 없이 쭉~~~~~~~~",
      "content_length": 124
    },
    {
      "id": "223461556658",
      "title": "2024.05.24 : 농림축산식품부, 한국농업기술진흥원, 한국농기계협동조합 관계자 현장 방문",
      "date": "2024. 5. 28. 21:22",
      "content": "스마트팜 관련 3개 공공 기관 \"농림축산식품부, 한국농업기술진흥원, 한국농기계협동조합\" 관계자 분들이 맘꽃가든에서 관수시설 설치한 서귀포 한남리 천혜향 농가 현장 방문을 하였다. 오길원 ICT 협동조합장도 참석해서 만감류 생육 모델 개발 필요성을 함께 공유하는 자리를 가졌다. 대한민국 기후변화 최전선 제주도에서 하루하루 변화되는 농업 환경을 어떻게 하면 모두에게 이로울 수 있는 시스템으로 구축하는 방안을 찾아낼수 있을까???",
      "content_length": 239
    },
    {
      "id": "223459000101",
      "title": "2024.05.25 : 양수기 원격 제어 안전 경고판 제작",
      "date": "2024. 5. 26. 18:15",
      "content": "농업 현장에서 양수기를 원격제어 하면서 안전 사고 발생 위험이 있어서 이에 대한 안전경고판 제작!! 전기 시설이 많아지면서 전기 구동기 사고 등이 발생할 수 있는데 안전한 농업 현장이 되기 위해 항상 주의를 구한다.\n교반기 작동\n재생\n13\n좋아요\n0\n00:09\n\n교반기 작동",
      "content_length": 153
    },
    {
      "id": "223454493828",
      "title": "2024.05.21 : 관수 시설 재정비",
      "date": "2024. 5. 22. 9:51",
      "content": "기존 관수 수동 밸브에 전자밸브, 유량계를 설치하기 위해서 맞춤형 관수 라인 제작.... 공간이 좁아서 기존 부품 다 풀어서 일일이 맞춤 제작으로 조립 진행 중.. 역쉬 경험 많은 농업인 설치팀이 제작해야 제대로 된 스마트팜이 나온다.",
      "content_length": 131
    },
    {
      "id": "223451199536",
      "title": "2024.05.19 : 50개 농가 스마트팜 세트 제작",
      "date": "2024. 5. 19. 8:36",
      "content": "이제 구동기 제어함, 환경측정 센서함 50세트를 제작해서 농가에 설치해야 한다. 제작과정도 규격화 되어가고 있고, 본격적인 스마트팜 제조업체로 전환해야 할듯... 주말도 없다..",
      "content_length": 99
    },
    {
      "id": "223408910438",
      "title": "2024.04.08 : 슬라워 2.0 스마트팜 농장 설치",
      "date": "2024. 4. 8. 8:21",
      "content": "제주시 봉개동에 위치한 농장에서 슬라워 2.0 기반의 스마트팜 및 CCTV 설치 주문을 받아서 제주ICT 협동조합 조합원들과 함께 스마트팜을 설치하였다. 해당 농장은 4,000평 규모의 노지 농장이라 관수 위주의 서비스를 제공할 예정인데, CCTV를 노지 중간에 설치해서 모니터링 하기를 원하셔서 별도의 IP주 설치 작업을 진행하였다.\n제주도에서는 바람이 많이 불어서 IP를 그냥 세울수가 없다. 하부에 별도의 구조물을 만들고 Wire를 이용해서 단단히 고정하는 작업을 진행해야 하기 때문에 설치 과정이 대단히 복잡하다.\n이러한 작업끝에 CCTV 설치를 완료하였다. 상당히 먼거리에 UTP 케이블을 설치하는 작업도 진행하였는데, 외부에 케이블 노출시 문제가 될 수 있기에 보호관에 UTP 케이블을 끼우는 작업도 진행했다.\n메인 밸브 기준으로 관수관 4개 채널로 나눠서 제어하고자 한곳에 모으는 배관 작업도 실시하였다. 다들 경험많은 베테랑이라 설치에 큰 어려움은 없었다.\n기존의 메인 전원함에서 별도의 제어함을 분리하고 새로운 제어함을 꾸미는 작업을 실시하였다.\n추가 배선 작업 및 스위치 작업들을 진행할 예정이다. 이틀 정도에 끝내려고 했는데, 현장 상황은 항상 변수가 있고 세세한 부분까지 다시 설정해야 하기에 작업 상의 과정은 좀 더 지연될 것 같다. 그래도 하나씩 마무리되어 가는 과정이 중요할 것이다.",
      "content_length": 677
    },
    {
      "id": "223428059250",
      "title": "2024.04.26 : 1농가 + 1농가 설치 작업 진행 중",
      "date": "2024. 4. 26. 15:40",
      "content": "2024년부터 스마트팜 설치 농가가 늘어나면서 1농가 + 1농가, 이렇게 설치 농가가 늘어가고 있다. 이번에 설치할 스마트팜 자재를 일괄로 차에 실어서 가려고 사무실 카트에 다 실어놓았다.\n결국 현장에 도착해서는 센서함이랑 제어함,, 케이블 들이 어지롭게 놓여져 있다. 시설하우스 규모가 크다보니깐, CCTV 카메라 설치 범위가 상당히 멀어지게 된다. 옥외용 PoE케이블 설치가 가장 힘든일이 되고 있다.\n기존 배수 라인에 유량계와 전자밸브를 설치하였다. 베테랑 농업인들이 설치하는 것이라 기존 관수라인에 최소한의 변경으로 설치가 진행되는 것 같다.\n제주ICT협동조합 조합원들이 직접 제어함과 센서함을 설치하고 있다. 이러한 과정을 통해 농업인들이 직접 설치 운영할 수 있는 스마트팜 시스템 개발이 점점 더 현실화 될 것 이다.",
      "content_length": 407
    },
    {
      "id": "223377838232",
      "title": "2024.03.08 : 제주농업기술원 스마트팜 2차 시연회",
      "date": "2024. 3. 9. 8:20",
      "content": "봄 기운이 완연하게 다가오면서 본격적인 스마트팜 시스템 운영을 준비하고 있다. 작년에 제주농업기술원과 공동 개발했던 스마트팜 시스템의 본격적인 운영을 위해서 제주농업기술원 관계자 분을 모시고 2차 시연회를 실시했다. 이번에 개발한 시스템은 2020년 부터 기술 개발을 했던 연구사분들의 의견과 연구 노하우를 최대한 반영한 시스템이라 문제점 지적보다는 기대감이 높았던 시연회였다.\n다중 사용자, 다중 농장, 다중 센서, 다중 구동기 관리가 원할하게 이루어지고, 동시계열 데이터 모니터링, 사용자 알람 등의 모니터링 기능을 대폭 강화하였다.\n특히 시설 과수에 적합한 다중 스케쥴링 기능을 개발 적용하였기에 농업기술원 시험포장을 대상으로 본격적인 관수 서비스가 운영될 수 있을 것 같다.\n작물에 최적화된 스마트팜 시스템을 개발하는 것은 쉽지 않은 길이다. 여기에 계신 모든 분들이 대한민국 스마트팜의 현실과 나아가야 할 방향, 기대치를 이제 공감하고 있다. 그렇기에 이제 기획하고 연구하고, 개발하고 다시 연구하는 작업을 계속하고자 한다. 3년 간의 연구, 개발하면서 나름 한발자국 또 나아간 것 같다.\n많은 분들의 도움과 노력이 있었음을 느끼며, 감사드리고자 한다.",
      "content_length": 594
    },
    {
      "id": "223374060702",
      "title": "2024.03.05 : 경기농협 조합장 단체 방문",
      "date": "2024. 3. 5. 18:21",
      "content": "농협중앙회 제주지부의 소개로 경기농협 조합장분들이 맘꽃가든을 방문해 주셨다. 계속되는 폭우에 시설하우스 내부에서 대화하기도 쉽지 않았는데, 다들 열정이 대단하셔서 많은 얘기를 나눌 수 있었다.\n1시간 이상의 스마트팜 보급 확산 방안을 토론하면서, 대한민국 미래 농업의 성공 요인은 \"승계농\" 이라는 공감대를 형성한 것이 인상깊었다. ^^;\n그만큼 현재 농업에 진입하기 위해서는 초기 투자 비용이 많이 들어가는 것을 반증하는 것이다. 조합장님들도 청년 농업인 육성에 대한 고민이 많다고 하신다. 이를 해결하기 위한 방안으로 스마트팜이 잘 적용되어야 하는데, 아직 부족한 부분이 많다.\n최근에 개발한 슬라워 2.0 모델을 시연해 보는 시간을 가졌다.\n계속된 토양 수분 장력 센서 테스트 과정들에 대해서 설명해 드렸다.\n이번에 방문을 연계해 주신 농협중앙회 제주시 지부 김태범 단장님과 조합장님 기념사진을 찍었다.",
      "content_length": 452
    },
    {
      "id": "223396594625",
      "title": "2024.03.26 : 제주 시설 만감류 농가 실증 설치",
      "date": "2024. 3. 27. 8:00",
      "content": "제주 시설 만감류 농가를 대상으로 한 스마트팜 설치 작업이 본격적으로 진행될 예정이다. 농업인 단체에서 개별 농가의 재배 현장을 파악하고 분석한 뒤 이를 기반으로 농가에 맞는 스마트팜 설치 Layout 및 사양을 결정하고 설치 작업을 진행하는 프로세스를 구축하고자 한다.\n이를 위해서 제주ICT협동조합 조합원들과 맘꽃가든 직원들이 모여서 실증 설치를 위한 사전미팅을 가졌고 이에 본격적인 작업을 진행하기로 하였다.\n남원읍 한남리에 위치한 농가에 모여서 우리가 진행하고자 하는 방향에 대해서 서로 의견을 나누고 본격적인 실증 작업을 위해서 스마트팜 시스템에 사용자, 농장, 작물, 구동기, 센서 등록 작업을 직접 수행보는 과정을 거쳤다.\n또한 개별 농가 설치 시, WIFI 설정 등록, 구동기, 센서 정보와 장비 Serial 번호를 맞추는 방법 등에 대해서 의견을 나누는 시간을 가졌다.\n이러한 실증 작업을 통해서 개별 농가에 맞는 스마트팜 시스템을 최적화 설치하고 농가는 편하게 스마트팜 장비를 사용할 수 있는 토대가 마련되지 않을까 한다.",
      "content_length": 526
    },
    {
      "id": "223394218317",
      "title": "2024.03.24 : 제주농업기술원 제주 토양 분석 작업 실시",
      "date": "2024. 3. 25. 8:16",
      "content": "시설 만감류 관수 알고리즘 개선을 위해서 제주농업기술원에서는 다양한 토양 환경에서의 관수 관리 방안을 연구 중이다. 토양 센서 중에 수분장력센서가 가장 신뢰성이 높은데, 이는 Meter Group에서 개발하는 TEROS 21, TEROS32가 가장 신뢰성이 높다. 하지만 가격이 높아서 농가 보급용으로 적용하기에는 어려움이 있다.\n이번에 제주농업기술원 시험포장에 12개 지점을 선정하여 각각의 토양 상태 및 관수 스케쥴을 조정해서 작물의 성장을 비교 분석하는 연구를 진행하기로 하였다.\n이를 위해서 맘꽃가든에서 개발한 데이터 수집기와 제빛나 시스템을 연동하는 작업을 수행했다.\n토양의 깊이는 약 20cm 내외 깊이로 파서 센서를 심어 두었다. 물론 젖은 흙으로 센서를 감아서 설치해야 한다고 했는데, 이전 테스트에서 그렇게 했는데, 결과값에 차이가 거의 없었다.\n토양 수분 장력은 주변 토양의 수분 상태가 안착될 때까지 측정값을 잘 모니터링해야 하는 것 같다.\n이렇게 12개 지점에 센서를 배치하고 각각의 물빠짐이나 토양 수분 장력 변화를 모니터링 할 예정이다.\n그리고 별도로 12개 농가를 대상으로 토양 수분 함량 변화를 확인하기 위해서 데이터 수집 장치를 설치하기로 하였다. 이 또한 잘 설치해서 데이터를 수집하고 비교 분석해 보고자 한다. 개별 농가에 데이터 수집 장치를 설치하는 과정도 쉽지 않지만 제주도 농업 기술 향상을 위해서 또 열심히 하루하루 최선을 다하고자 한다.",
      "content_length": 716
    },
    {
      "id": "223392079935",
      "title": "2024.03.21 : 시설만감류 40개 농가 슬라워 2.0 관수 서비스 설명회",
      "date": "2024. 3. 22. 17:41",
      "content": "작년부터 함께 협업해 왔던 제주ICT협동조합과 컨소시엄을 구성해서 농진원에서 진행하는 데이터 기반 스마트 농업 확산지원 사업에 선정되었다. 그래서 본격적인 시스템 설치 및 보급 사업 추진을 위해서 기존에 모집했던 농가들이 농사철이 다가오기 전에 빨리 설명회를 개최했으면 하는 요청들이 있어서 시설 만감류 관수 서비스 및 데이터 취득 내용들을 오길원 조합장이 직접 설명하고 있다.\n무엇보다도 스마트팜 기술을 개발하는 업체와 농업인 단체가 서로 필요한 것을 함께 고민하고 이를 직접 조합원들이 테스트할 수 있는 구조를 만들었다는 것에 뿌듯함을 느낀다.\n매번 여러가지 바쁜 일정에도 농민을 독려하고 조합원들에게 농업기술 개선 방법을 전달하고자 노력하는 오길원 조합장의 열정에 파트너로서 든든함을 느낀다.\n남원읍 다목적 센터에서 청장년 농업인이 참여해서 시설 만감류 스마트팜 시스템의 문제점과 개선 방안을 협의할 수 있음에 감사함을 느낀다.\n제주도 스마트팜의 미래가 점점 더 밝아보인다.\n이번에 설치 지원될 기자재도 전시를 해서 설명을 드렸고, 4월부터 본격적인 설치 작업을 진행하고자 한다.",
      "content_length": 551
    },
    {
      "id": "223384512552",
      "title": "2024.03.15 : 슬라워 2.0 업데이트 작업",
      "date": "2024. 3. 15. 17:18",
      "content": "슬라워 2.0 서비스를 시작하게 되었다. 그래서 기존에 현장에 설치했던 하드웨어 시스템 구성을 슬라워 1.0에서 슬라워 2.0으로 이전하는 작업을 시행하고 있다. 물론 테슬라처럼 OTA 기능을 통해서 자동으로 업데이트 되면 좋겠지만 그렇지 못해서 이렇게 농가를 방문해야 하는 문제점이 있지만 올해안에 사용자가 직접 업데이트할 수 있는 기능을 추가 개발할 예정이다.\n그래서 이런 수고는 성장하기 위한 필수 과정으로 받아드리고자 한다.\n이번에 현장 업데이트 작업은 현장 직원과 함께 하기로 해서 사무실에서 개발만 하던 박대리가 현장에 나와서 설치 현황도 확인하고, 설치 프로그램을 업데이트 작업을 수행하고 있다.\n그리고 새로운 슬라워 2.0 시스템에서는 다중 농장, 다중 사용자 등록이 가능해서 콩깍지 농원의 후계자가 직접 노트북에서 사용자, 농장, 구동기, 센서 등록 작업을 수행하고 있다.\n농업인이 시스템에서 직접 사용자, 농장, 구동기, 센서를 등록하고 운영할 수 있는 시스템을 지향한다. 슬라워 1.0에서 슬라워 2.0 버전을 진화했다.. 다시 농민이 편하게 농사 짓는 그날을 위해서 끊임없이 진화하고자 한다.",
      "content_length": 567
    },
    {
      "id": "223379485980",
      "title": "2024.03.11 : 키위 농가 MicroSD 카드 저장 로거 설치",
      "date": "2024. 3. 11. 8:35",
      "content": "빅데이터 수집하는 농가 중에서 인터넷이 되지 않는 농가가 있어서 MicroSD카드에 저장만 가능한 데이터 로거를 설치하였다. 작년에 제주농업기술원 요청에 따라서 클라우드 서버로 데이터 전송도 되면서 MicroSD 카드에 측정값을 저장하는 모듈을 개발하였다. 이를 테스트 하기 위해서 키위 농가에 토양수분장력센서(TEROS32), 온습도계(SHT35), 일사량계(SP-110)를 설치하고 이를 맘꽃가든에서 개발한 데이터 로거에 연결하는 작업을 실시하였다.\n데이터 저장은 10분에 한번씩 저장하고 저장 파일은 한달에 한번씩 생성되며, 값이 저장된다. 과거에 데이터 저장 장치 용량이 작아서 주기적으로 방문해서 데이터를 백업 받아야 하는데, 요즈음 워낙 데이터 저장 용량이 커서 32GB 기준으로 10개 센서 데이터를 10분씩 저장할 경우에 약 50년 이상의 데이터를 저장할 수 있는 것으로 예측되었다.\n농장주 분이 워낙 깔끔하신 분이라, 포장 관리가 잘 되어 있었다. 토양 수분 장력 센서는 TEROS32를 설치했는데, 아무래도 계속 증류수를 주입해야 하는 불편함이 있어서 추후에 TEROS21도 같이 설치해야 될 것 같다.\n각 센서의 설치 위치를 표현하였다. 이렇게 수집된 데이터를 키위 생육 연구에 잘 활용해야 되는데, 스마트팜 연구의 길은 Keep Going!!!!!!",
      "content_length": 655
    },
    {
      "id": "223345597533",
      "title": "2024.02.03 : ICT 시범 포장 관수 밸브 우회로 구성",
      "date": "2024. 2. 6. 10:17",
      "content": "제주농업기술원 ICT 시범 3개 포장에 벨콘 전동식 밸브가 설치되어 있는데, 기존 벨콘 밸브 제어 문제 발생시 우회 관수 밸브 구성을 위해서 기존 관수 라인에 우회로 구성을 하였다. 관수 밸브 설치 시에 당장 작동하게 만드는 것이 제일 중요하다보니, 유지/보수를 고려하지 않아 추가 작업할 때 관수 여유 공간이 없어서 힘든 경우가 많다. 이번에는 아무리 설계해도 PE관으로 우회로를 구성할 수 없어서 수도 부속을 맞춤형으로 다 제작해서 조립을 하였다.\n해당 길이에 맞는 파이프를 절단한 다음에 나사선을 다 가공하고 이를 소켓들과 조립해서 우회로 개념의 버마드 전자 밸브를 추가 설치하였다. 이러한 작업은 사실은 일반 농민이 하기 힘들다. 하지만 본인 농장에서 이런 상황이 된다면 무조건 해야 될것 이다. 그러다 보면 결국 농민은 백공이 된다. ^^; 이번 작업을 마치면서 관수 라인 구성을 체계적으로 잘 해 두는 것이 얼마나 중요한 가를 또 깨닫게 된다.\n아래는 옆으로 공간이 없어서 위로 우회라인 구축한 사례이다. 좁은 공간에 테스트를 위해서 다양한 관수 라인을 설치하다보면 정말 쉽지 않은 경우가 많다. 그래도 이런 경험을 통해서 좀 더 발전된 스마트팜 시스템을 만들 수 있을 것 같다.",
      "content_length": 610
    },
    {
      "id": "223361443536",
      "title": "2024.02.21 : 토양 센서 테스트용 베드 제작 (TEROS, FDR 동시)",
      "date": "2024. 2. 22. 9:01",
      "content": "제주 지역 특성상 토양 종류 및 시설하우스 지층 구조도 달라서 물빠짐이 상이한 경우가 허다하다. 그럼에도 불구하고 시설 만감류 재배 기술의 가장 중요한 것이 관수이기에 토양 센서 테스트 및 신뢰성 확보 요구가 점점 더 많아지고 있다. 그래서 TEROS 시리즈랑 FDR 센서 등을 동시에 데이터 취득하고 바로 조회할 수 있는 기능을 개발하고 있다.\n그런데 센서 개수도 많아지고 개별적으로 상토에 담아서 관리하기가 쉽지 않아서 6개 토양 센서를 한번에 담아서 테스트할 수 있는 베드를 자체 제작했다. 기존 기자재를 최대한 활용해서 쉽게 선 연결하고 물넣고 빼고 할 수 있는 구조를 뚝딱 만들었다.\n사무실에서 보유하고 있던 TEROS 32, TEROS 21, FDR 센서 등을 꽂아보니 나름 공간도 적게 차지하고 작업도 쉽게 이루어 질 수 있을 것 같다.\n센서 중에 일부 데이터만 바로 조회해 보니깐 토양 수분 함량이 그래프로 잘 나오고 있다. 스마트팜 기술 개발에 있어서 가장 까다롭다는 토양 관련된 연구를 이제 시작하고 있다. 올해 좋은 소식이 나올 수 있을지????",
      "content_length": 540
    },
    {
      "id": "223358474220",
      "title": "2024.02.18 : 제주시 농협 상추 생산자 출하협의회 정기 총회 참석",
      "date": "2024. 2. 19. 16:37",
      "content": "작년에 가입한 제주시 농협 상추 생산자 출하협의회 정기총회에 참석하였다. 제주시 지역에 총 28 상추 농가가 가입되어 있는데, 나는 신입회원으로서 참석하고 여러 선배님들한테 인사를 드리는 시간을 가졌다.\n총회를 시작하기 전에 미리 도착하신 분들은 총회 자료를 보시는데, 다들 상추 농사 경험이 10년 이상 이신 베테랑 분들이라 조용히 자리에 앉아서 선배님들이 진행하시는 것을 지켜보는 시간을 가졌다.\n신입 회원 농가가 3농가였고, 회원 분들중에서 50대는 나밖에 없었다. 여기에서는 나는 아직 10년 정도는 막내역할을 해야 한다. ^^; 선배님들한테 많이 배워서 제주도 농업 발전에 도움이 될 수 있도록 노력해야 할듯하다..",
      "content_length": 349
    },
    {
      "id": "223354692260",
      "title": "2024.02.15 : 슬라워 현장 설치 지원용 앱 개발",
      "date": "2024. 2. 15. 18:06",
      "content": "2024년 3월 초 슬라워 2.0을 운영하기 위한 작업을 진행하고 있다. 특히 현장에서 설치자 또는 농민이 하드웨어 대한 직접적인 연결 및 프로그램 관리 작업을 최소화 하기위한 현장 설치 지원용 앱을 개발하고 있다. 하드웨어를 구매해서 농장에 설치할 때 해당 농장의 WIFI SSID 및 비밀번호를 확인하고 이를 시스템에 입력해 줘야 한다. 또한 해당 농장에 필요한 구동기, 센서 설정을 해야한다. 이러한 설정을 모바일 앱을 통해서 바로 설정하고 펌웨어에 업데이트 할 수 있는 프로그램을 개발하고 있다.\n프로그램 개발 작업을 하면서 크게 WIFI 설정과 구동기, 센서 설치 개수 및 TYPE 등을 지정할 수 있도록 할 예정이다.\n설정된 정보를 바탕으로 슬라워 서버와 접속할 수 있도록 하는 작업이 이루어 질 것 같다.",
      "content_length": 401
    },
    {
      "id": "223684310567",
      "title": "2024.12.05 : 24년 마지막 스마트팜 농가 설치",
      "date": "2024. 12. 6. 9:26",
      "content": "지난 달에 갑자기 주문 전화가 와서 마지막 스마트팜 설치 작업 시작하다.\n올 한해도 열심히 다니고 서비스 개발하고 설치 작업을 진행했다.\n사고없이 무탈하게 설치 작업이 진행되었지만, 부족하고 아쉬운 부분이 많이 있다.\n하지만 꼭 제주도에서 개발한 기술과 서비스를 전국 단위로 수출하는 최초의 스마트팜 업체가 되기 위한 나의 목표 달성 위해 최선을 다하고자 한다.\n이번 농가는 관수 밸브가 21개다... 양수기 포함해서 22개 채널 제어를 진행할 예정이다.\n날씨가 따뜻해서 다행이다.",
      "content_length": 269
    },
    {
      "id": "223704843336",
      "title": "2024. 12.21: 제주지방조달청장 관계자 방문",
      "date": "2024. 12. 25. 10:45",
      "content": "맘꽃가든 슬라워 제품이 조달청 혁신제품으로 인증받고 시범사용 성공 판정이후에 현장의 목소리도 들으시고 및 내년 우수제품 인증 절차도 알려주시고자 방혜성 제주지방조달청장님과 관계자분들이 맘꽃가든 사무실을 방문해 주셨다.\n스타트업 기업으로 공공 기관의 지원과 관심은 기업 생명을 이어가는데 필수 영양소이다.\n제주도에서 \"저비용 스마트팜\"이라는 무에서 유를 창조하는 과정은 너무 어렵고 힘들다. 가격도 싸야하고 품질도 좋고, 농민도 안전하게 쓸 수 있는 스마트팜... 제주도에서 꼭 성공시키고자 한다. 다행히 농민도 살고 기업도 살 수 있는 제품을 만들고자 하는 가치를 인정해 주시는 분들이 많아지고 있으니, 힘이난다. 스마트팜 제품을 혁신하리라!!!!",
      "content_length": 362
    },
    {
      "id": "223700912564",
      "title": "2024.12.20 : 2024 제주 웹 컨퍼런스 강의",
      "date": "2024. 12. 21. 8:44",
      "content": "올해 마지막을 2024년 제주 웹 컨퍼런스 강연으로 마무리하다. 위니브 이호준 대표님이 좋은 기회를 주셔서 내년 개발자 채용 위한 회사 소개도 할겸,, 맘꽃가든 스마트팜 기술 개발 현황을 홍보할겸해서 행사에 참여했다..\n1시간에 걸친 맘꽃가든 스마트팜 구축 및 솔루션 개발 과정을 소개했는데, 스마트팜은 SW/HW 융복합 제품이라는 특징과 농업 기후 변화 따른 비지니스 기회가 점점 더 커진다고 설명드렸다...\n열정적인 강의에 감사하고, 연수끝나면 방문하겠다는 말에... 항상 기회는 만들어 가는 것임을 배운다..\n젊은 청년들과 소통에 부족함을 많이 느끼는 세대이지만 이러한 소통의 과정이 좀 더 많은 청년들이 농업에 참여하는 기회를 만들지 않을까???",
      "content_length": 365
    },
    {
      "id": "223679423608",
      "title": "2024.11.29 : 농협 관계자 시설만감류 스마트팜 농가 방문",
      "date": "2024. 12. 2. 6:53",
      "content": "맘꽃가든과 제주ICT협동조합이 2024년 동안 함께 설치한 제주 시설 만감류 관수 스마트팜 시스템에 대한 운영 현황 및 결과를 농협관계자 분들이 현장 방문해서 확인했다.\n이제 육지에서 다양한 분들이 제주도 스마트팜 운영 현황에 대한 관심을 가져 주셔서 뿌듯하다.\n농업인이 원하는 스마트팜은 기후변화가 가속화 되는 시점에 끊임없이 알고리즘을 업데이트 하지 않으면 안된다..\n성과위주 결과를 바라는 것은 초격차 다투는 스마트 팩토리에 적용될지 모르나, 스마트팜은 지속가능성이 더 우선이다. 이런 관념을 이제 스마트팜 관계자들이 많이 공감하는 것이 느껴진다..\n그래서 스마트팜은 연구소와 농업현장의 긴밀한 협업이 더 중요하다. 그들이 함께 문제 정의하고 알고리즘 개선이 진행되어야 할 것이다.\n우리는 이제 기후변화에 대응해야 한다.",
      "content_length": 406
    },
    {
      "id": "223697370047",
      "title": "2024.12.17 : 제주남원농협 청장년 농업인 협업 설명회",
      "date": "2024. 12. 18. 9:38",
      "content": "제주 남원 농협 / 제주ICT협동조합 / 맘꽃가든 3개 기관이 한국농업기술진흥원에서 추진하는 데이터기반 스마트농업 확산지원 사업으로 남원 농협 청장년 농업인에게 스마트팜을 보급하는 사업에 공동으로 응모하기로 하였다.\n이를 위해 청장년 농업인 대상으로 설명회를 개최하였는데, 감귤 수확으로 바쁜 시기임에도 고일학 조합장님, 오길원 이사장님을 비롯한 많은 분들이 참석해 주시고 스마트팜 보급사업에 많은 관심을 가져주셨다.\n새해가 아직 시작되지 않았지만 맘꽃가든은 이미 2025년 사업을 시작하고 있다. 그만큼 농업의 기후변화 및 세대 교체가 빠르게 진행되고 있음을 현장에서 느끼고 있다. 이를 위해서라도 현장에서 요구하는 스마트팜을 지속적으로 개발해서 제공하는 것이 필요하다.\n한 농가에서 \"왜 스마트팜이 아직도 보급이 잘 안되는냐??\"는 질문에 \"품종, 토양, 시설현황이 다 달라서 맞추기가 쉽지 않다. 그래서 농업인과 연대해서 현장 상황에 맞추기 위해 노력하고 있다\"고 답변드렸다. 이제 연대하고 공감하지 않으면 대한민국 농업은 위기가 찾아올 수 있다.\n오늘도 현장에서 농업인을 만나고 그들과 함께 공감하는 것이 맘꽃가든이 가야하는 중요한 길임을 느낀다.",
      "content_length": 590
    },
    {
      "id": "223690280389",
      "title": "2024.12.10 : 김녕리 가변형 고설베드 설치 시작",
      "date": "2024. 12. 11. 21:54",
      "content": "김녕리 이웃 농가에 상추 깻잎 재배를 위한 가변형 고설 베드 설치 작업을 시작하다.\n작물 재배 전문가 이신 전김녕리 이장님의 600평 규모 농장에 3월까지 가변형 고설 베드를 설치하기로 했다.\n베드 설치 설계는 다 마치고 제일 먼저 배수관 설치 위한 관로 작업을 시작하다. 포크레인도 기존 기술센터 임대형 모델보다 출력이 커서인지 작업이 어렵지 않게 마무리 되었다..\n백공이 된 자의 여유인가? 이제 원하는 바를 실시하는데 두려움이 없다. ^^;",
      "content_length": 249
    },
    {
      "id": "223670636549",
      "title": "2024.11.23 : 가변형 입식 재배 베드 - 쑥갓 재배",
      "date": "2024. 11. 23. 19:25",
      "content": "상추, 깻잎에 이어 쑥갓도 잘 자란다. 이제 어지간한 엽채류 재배는 다 될 듯... 역쉬 땀흘리는 자는 속이지 않는다.",
      "content_length": 66
    },
    {
      "id": "223665382571",
      "title": "2024.11.18 : 데이터 기반 스마트농업 확산 사업 제주 사례 발표",
      "date": "2024. 11. 18. 21:19",
      "content": "2024년 한해동안 제주 지역 시설과수 농가를 대상으로 보급 사업 진행한 결과를 발표한 자리.. 제주만 바라보다가 전국 업체들과 경쟁하면서 사례발표를 하다보니 긴장이 많이 되었다.\n그래도 나에게 이런 기회가 있음에 감사드리고 좀 더 분발해서 부족한 부분을 매꿔가야 할 듯하다. 역쉬 내가 배워야 할 고수가 많다. ^^;",
      "content_length": 178
    },
    {
      "id": "223661800007",
      "title": "2024.11.15 : 제주시 농정과 청창농 교육생 강의",
      "date": "2024. 11. 15. 15:56",
      "content": "제주시 농정과에서 청창농 교육생을 위한 강의를 요청하셔서 교육을 진행했다.\n교육의 핵심 요지는 대한민국 농업은 이제 농업 고유의 생태 문화적인 의미 \"agriculture\"보다 경영적인 \"business\" 즉 자영업에 가깝다는 얘기였다.\n특히 은퇴세대가 아닌 청창농은 마음 단단히 먹고 접근해야할 창업 스토리와 똑같다.\n거기에 스마트팜 초호화 융복합 기술이 총망라되어 있어야 함을 강조했다. ㅋㅋㅋㅋ\n그래도 박수받고 끝난 강의라 맘이 뿌듯하다. 청년들이여.. 도전하여라!!!!",
      "content_length": 266
    },
    {
      "id": "223656817449",
      "title": "2024.11.12 : 스마트팜 교체 희망 농가 사전 방문",
      "date": "2024. 11. 12. 7:59",
      "content": "스마트팜 교체 설치를 희망하는 농가를 방문했다. 기존 ooo 제품을 사용하고 있는데, 이를 슬라워 제품으로 변경하고자 하셔서 사전 방문을 했다.\n방문했을 때 비가 오고 있었는데, 천창이 닫히지 않고 있었다. TT; 센서가 불량인 것 같은데, 교체 주기를 맞추지 못한 것 같다.\n기존 관수 밸브도 부분 누수가 있어서 이번에 다 교체하자고 하시는데, 이런 교체 작업은 그렇게 어렵지 않다.\n다만 기존 제어 시스템을 다 교체하는 과정은 어떻게 될지 검토가 좀 더 필요한 상황이다.\n신규 설치보다 기존 시스템 교체가 힘들다는 것은 스마트팜을 해 본 사람은 다 안다.. ^^;\n그래도 이것도 새로운 도전이기에 한번 시도해 볼것이다.",
      "content_length": 348
    },
    {
      "id": "223655431719",
      "title": "2024.11.10 : 맘꽃가든 상추 재배 현황",
      "date": "2024. 11. 11. 10:12",
      "content": "다행히 날씨가 아직 추워지지 않아서 이중 및 난방을 하지 않아도 재배가 잘 되고 있다. 작물 재배 전문가와 스마트팜 기술 전문가가 만났을 때 어떠한 결과가 나올 수 있을지를 맘꽃가든 실증 농장을 통해서 확인할 수 있다.\n농업은 원래부터 협업이다. 협업하지 않는 농업은 성장할 수 없다.\n다행히 농산물 가격도 높게 유지되고 있어서 좋은 결과가 나올 것 같다. 이번주도 홧팅!!!\n맘꽃가든 가변형 입식 재배 현황\n재생\n16\n좋아요\n0\n00:08\n\n접기/펴기\n가변형 입식 재배 현황",
      "content_length": 266
    },
    {
      "id": "223654653364",
      "title": "2024.11.07 : 스마트팜 전문위원과 시설 농장 현장 점검",
      "date": "2024. 11. 10. 18:06",
      "content": "관수 스마트팜 설치 농가 8개소에 대한 스마트팜 전문위원 현장 점검 실시,,, 하루 하루 열심히 살고 있는 농장주 분들 홧팅입니다.",
      "content_length": 73
    },
    {
      "id": "223654650584",
      "title": "2024.10.25 : 제주시농업기술센터 신규농업인 기초과정 농업인",
      "date": "2024. 11. 10. 18:03",
      "content": "제주시농업기술센터 스마트농산업 신규농업인 기초과정 농업인 방문..\n그런데 신규농업인이 아닌 베테랑 농업인 분들이었다.. 다만 내가 왜 이렇게 농사지을려고 노력하는지를 공감해 주셔서 많은 힘을 얻었다..\n이제 농사는 관행으로 갈 수는 없다. 바꿔야 한다. 그렇기에 농업인들의 목소리가 전달되어야 한다.\n오늘도 정신없었지만 나를 응원해 주는 분들이 있기에 내일도 일해야겠다. TT;;;\n존재하지 않는 이미지입니다.",
      "content_length": 229
    },
    {
      "id": "223654649470",
      "title": "2024.11.01 : 제주시 상추 작목반 농가 방",
      "date": "2024. 11. 10. 18:02",
      "content": "제주시 상추 작목반 회원분들과 육지 상추 재배 농가 현장 방문 진행 중.. 이번 방문으로 제주 상추 농가의 토경 재배 환경에 많은 변화가 생길 것으로 기대된다.\n참여 하신 모든 회원 분들이 기후온난화/고령화에 따른 재배 작물 변화 속도가 빠르게 진행되고 있다는 사실에 크게 공감했다..\n이번 현장 방문으로 고설 재배 베드를 개선할 중요한 단서를 찾았다. ^^;;;\n무엇보다도 농업 현장에서 농민들과 함께 답을 찾고자 하는 것이 스마트팜 기술 개발의 기본 자세이다.\n존재하지 않는 이미지입니다.",
      "content_length": 275
    },
    {
      "id": "223654647671",
      "title": "2024.11.05 : 전북농업마이스터대학 시설원예분과 방",
      "date": "2024. 11. 10. 18:00",
      "content": "한국농수산대학교 채소학과 안율균 교수님과 전북농업마이스터대학 시설원예분과 학생분들이 맘꽃가든을 방문하셨다. 마이스터 과정 학생분들은 해당 작물 베테랑이시라 작물 재배 관련 강의보다는 현 제주 시설 스마트팜 현황 및 가변형 고설 재배 베드 노하우를 공유하는 자리였다\n특히, 고설 양액 재배를 하면서 관수주기가 3일 내외라는 사실에 깜짝 놀라셨고, 기존 분무수경이나 펄라이트 배지 기반 재배보다 훨씬 양액관수 관리가 쉽다는 것에 크게 응원해 주시고 기술 교류를 지속적으로 진행하기로 하였다.\n나는 반대로 너무나도 귀한 하절기 상추 재배용 차광막 트랜드랑 로메인 신품종 정보를 제공받아서 농업의 품앗이 정신을 느낄 수 있는 소중한 시간이었다..\n새로운 기술에 도전하는 사람은 상대방이 진심일 때 바로 동지가 될 수 있다.. 그래서 농업 최전선에서 기후변화 어려움를 해결해 가는 여러 농민들과 협업하는 것이 대한민국 스마트팜 발전에 가장 중요한 부분이 아닐까 한다. 계속 방문하는 기관이 늘어나서 힘들기는해도 응원해주는 전국 농민을 위해 오늘 하루도 알차게 보내자..\n존재하지 않는 이미지입니다.",
      "content_length": 553
    },
    {
      "id": "223612237184",
      "title": "2024.10.08 : 스마트팜 융복합 사업",
      "date": "2024. 10. 9. 6:35",
      "content": "요즘 농업 현장에는... 아니 스마트팜을 설치하는 현장은 항상 두가지가 존재한다.\n1번째 : 오랫동안 농장주가 자식처럼 아끼면서 사용했던 전기 구동기들.. 당장 바꿔야 되는데 버리기도 힘들고 새로 구입하자니, 가격도 비싸고 설치하기도 쉽지 않다. 그래서 그 구동기를 꼭 살려야 한다. ^^;\n2번째 : 이런 전기 구동기를 ON/OFF하는 스위치나 타이머가 내장되어 있는 구동제어기들... 대부분 지역 내 전기제어업체 들이 제작해서 공급하는 것들이다.\n이러한 전기 구동기나 제어장치가 없으면 농사를 지을 수가 없다.\n물주는 것도 수압이 약해서 펌프로 돌려야 하고, 이제 비오는 날 / 더운 날 시설 내부 온습도 관리 위해서 환풍기, 순환팬 돌리는 것은 필수이다..\n그렇기에 이제 농업인은 꼭 전기를 배워야 한다. 작물, 시설, 전기를 배워야 운영이 가능한 융복합 사업이다.\n아름농장 방문했을 때 \"스마트팜 사업할 때 사업멤버들이 농과계열이 대부분이었는데, 공과대 출신이 있었으면 현재 많이 달라졌을거라\" 는 말을 현장에 갈 때마다 되뇌어 본다..\n스마트팜은 절대 농업도 아니고 ICT 단독 사업도 아니라.. 융복합사업이다.. 그래서 많은 전문가들이 협업해야 된다.\n여하튼 오래가고 볼일이다. 그래야 협업하지!! ^^;",
      "content_length": 624
    },
    {
      "id": "223609752565",
      "title": "2024.10.05 : 차세대 스마트팜 플랫폼 테스트 장비 세팅",
      "date": "2024. 10. 7. 9:56",
      "content": "스마트팜 코드 표준화 및 재사용률을 높이고자 국립원예특작과학원 시설원예연구소에서 개발중인 차세대 스마트팜 플랫폼 \"아라\" 시스템의 현장 테스트 위한 장비 세팅 중!!\n배포버전 1.0의 베타테스트용 장비이지만 여러 구동기와 센서 연동을 통해서 기술적 개선 작업이 진행될 것이다..\n버전 1.0이 \"성장 가능성 무한대\"를 의미한다고 믿기에....",
      "content_length": 191
    },
    {
      "id": "223607911125",
      "title": "2024.10.03 : 신규농가 센서 보드 설정",
      "date": "2024. 10. 5. 16:26",
      "content": "10월 3일 개천절.. 오전에는 농가 현장 방문해서 센서 등록 프로그램 테스트하고 센서값 취득 모니터링 실시..\n현장 설치팀에서 센서랑 LTE라우터 설치하고 나면 마지막 WIFI SSID랑 센서별 ID 입력하는 앱으로 바로 등록할 수 있도록 개발했다..\n등록 완료 메세지 뜨고 앱에서 바로 센서값 확인될 때 약간의 성취감이 느껴진다.\n이 맛에 R&D 사업한다.",
      "content_length": 201
    },
    {
      "id": "223606589784",
      "title": "2024.10.01 : 신규 관수 제어 서비스 설치",
      "date": "2024. 10. 4. 13:18",
      "content": "신규로 관수 제어 스마트팜 설치하고 농장주랑 시간 맞춰서 방문해서 사용법 설명드리고 설치 점검을 완료하다.\n제주도에서 감귤 농장 운영하면서 주중에는 직장에서 공휴일에는 농장 관리하는 분들이 많은데, 조금씩 입소문을 타면서 관수 제어쪽으로 스마트팜 설치해 달라는 분들이 늘어나고 있다..\n물한번 주기 위해 점심 때 짬내서 왕복했던 일이 사라진다고 좋아하셔서 설치하고 같이 테스트 한 나도 뿌듯하다.",
      "content_length": 221
    },
    {
      "id": "223603870577",
      "title": "2024.09.30 : 청소년 체험 구역 정비 완료",
      "date": "2024. 10. 2. 7:52",
      "content": "2박 3일 동안 스마트팜 실증 농장 맞은편 정비하다.\n나만의 정원으로 꾸밀려고 농장 지으면서 나온 돌이나 자재들을 놔뒀었는데, 이번에 싹 다시 정리했다..\n깨끗해진 캔버스가 된 노지 포장.. 이번에 청소년들 상추 재배 체험하고 나면 노지스마트팜 실증 공간으로 재탄생 시켜야 할듯!!\n청년농업인들한테 잘 되는 것만 보여주면서 허상 심어주는 거 말고,, 100평 관리도 얼마나 어려운지를 현실적으로 보여주는 농장으로 거듭날 듯 하다.. ㅋㅋㅋ\n그게 진정한 대한민국 농업이 발전하는 길이다!!",
      "content_length": 272
    },
    {
      "id": "223311128279",
      "title": "2024.01.02 : 제주농업기술원 23개 시험 포장 슬라워 제품 설치",
      "date": "2024. 1. 3. 13:35",
      "content": "제주농업기술원 강정, 상귀 지역 23개 포장에 슬라워 제품 설치를 진행 중이다. 인터넷 망 설치 및 전기 배선 설치를 마무리하고 시설 환경 측정 장치, 구동기 제어 장치함 설치를 완료하였다. 이제 시스템에 해당 포장을 등록하고 구동기, 센서를 설치하는 과정을 수행해야 한다. 이를 통해 제품의 성능 및 문제점을 평가하고자 한다. 2024년 1월 부터 또 열심히 활동을 진행해야 겠다.",
      "content_length": 214
    },
    {
      "id": "223336766911",
      "title": "2024.01.27 : 제주농업기술원 상귀 포장 옥외용 WIFI 공유기 설치",
      "date": "2024. 1. 29. 6:37",
      "content": "시설하우스 주위로 센서나 제어기를 설치하고자 할 경우에는 WIFI 확장기 설치가 필수적인데, 대부분 제품들이 옥내용이라 설치에 제한이 많았다. 좀 더 넓은 곳까지 WIFI 서비스를 제공하려고 옥외용 공유기 제품을 찾고 있었는데 다행히 최근에 TPlink에서 해당 제품을 출시하게되어 설치를 하게 되었다.\n제품은 흰색으로 방수 처리가 잘 되어 있어서 브라켓을 하우스 물받이 난간 파이프에 고정하고 걸어두면 된다. 낙뢰 피해에 대비해서 난간 높이보다 낮게 설치했다.\n통신 모뎀 장비랑 확장기 사이는 옥외용 유선 케이블로 연결하고 케이블이 처지지 않도록 케이블 타이로 고정하는 작업을 진행했다.",
      "content_length": 329
    },
    {
      "id": "223334142538",
      "title": "2024.01.25 : 시설하우스 내 스마트팜 설치 면허 취득 중..",
      "date": "2024. 1. 26. 7:19",
      "content": "본격적인 하우스 내 스마트팜 시설 공사를 위해서 전문건설면허를 취득 중에 있다. 항상 계획적으로 살려고 하는데 건설업 면허까지 취득할 줄이야... ^^; 이게 사업의 재미인 것 같다. 2024년 부터 앞으로 20년 멋진 그림 다시 만들어 보자...",
      "content_length": 138
    },
    {
      "id": "223323257768",
      "title": "2024.01.14 : 관수 밸브 추가 설치 및 로메인 재배",
      "date": "2024. 1. 15. 17:55",
      "content": "겨울임에도 낮 기온이 10도 이상을 유지하다보니 로메인 상추가 잘 자라고 있다. 정식 작업도 진행하는 중이다.\n그리고 별도로 버마드 관수 밸브 50A를 설치해야 되는 일이 있어서 별도로 소켓이랑 유니언을 조립해서 준비했다.\n그런데 기존 밸브가 고착화되어서 분리가 안된다. --; 아... 농업 현장은 항상 변수가 너무 많다. 그래서 어쩔수 없이 PE관을 짜르고 새로 준비한 교체 모듈을 재조립했다.\n일부 길이 조절이 안되어서 추가로 PE관을 짜르고 조립을 끝내고 누수 여부를 확인해 본다. 30분 정도에 끝내려고 교체 모듈을 준비해 갔는데, 결국은 2시간 가까운 시간이 걸린다.",
      "content_length": 323
    },
    {
      "id": "223318113889",
      "title": "2024.01.09 : 점적테이프 마구리 밸브 및 스프링 설치",
      "date": "2024. 1. 10. 13:42",
      "content": "점젝테이프 설치 시 마구리 밸브 및 베드에 고정하기 위한 방법을 계속 고민하다가 최근에 스프링과 연동될 수 있는 마구리 밸브 제품이 있다는 것을 확인하고 20개 제품을 샘플을 받아서 설치 테스트를 하였다. 이제 점적 관수 시설에 대한 세팅은 완료가 된 것 같다.",
      "content_length": 146
    }
  ]
}