{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 08월",
  "year": "2023",
  "month": "08",
  "total_cases": 5,
  "cases": [
    {
      "id": "223178338663",
      "title": "2023.08.07 : 청상추 정식 재작업",
      "date": "2023. 8. 8. 18:06",
      "content": "태풍이 오기전에 또 다시 청상추 정식 작업을 진행했다. 더운 날씨에 시설하우스 안에서 작업 한다는 게 쉽지가 않다. 그래도 다시 또 도전하고 내일부터 태풍대비다..",
      "content_length": 91
    },
    {
      "id": "223190084677",
      "title": "2023.08.22 : 베드별 상추 재배 순환 프로세스 구축",
      "date": "2023. 8. 22. 10:05",
      "content": "이제 총 21개 재배 구역에서 38,000주 상추가 베드별로 순환 재배되는 프로세스가 구축되어가고 있다. 오늘 아침 상추 수확을 위해 3명의 인력이 투입되어서 수확 작업을 진행하고 계신다.\n동시에 다른 베드에서는 정식한 상추가 잘 자라고 있다. 365일 500평 규모에서 하루에 15박스 이상 수확할 수 있는 프로세스 구축 실증이 거의 마무리되어 가는 것 같다.\n로메인은 잘 재배되고 있어서 추후에 다품종 재배 프로세스도 구축이 가능할 것 같다.\n품질도 많이 개선되었고, 최근에 제주지역 상추 작목반 관계자 분도 농장 견학을 하셔서 추후에 제주도 상추 재배 작목반에 가입도 할 예정이다.",
      "content_length": 328
    },
    {
      "id": "223172555162",
      "title": "2023.08.01 : 제주도 감귤 과수원 토양 분석 모니터링 (C&H 협조)",
      "date": "2023. 8. 2. 9:44",
      "content": "제주농업기술원과 제주ICT 협동조합 2개 기관과 협업으로 제주도 감귤 과수원 토양 분석 모니터링을 진행하고 있다. 전체 농가 중에서 일부 농가의 센서 데이터 값이 정상적으로 취득되지 않고 있어서 현장에 직접 가서 측정값을 모니터링하고 센서를 추가 설치했다. TEROS21 모델은 농가당 하나씩 설치했는데, 이번에 C&H 에서 추가 분석 위해 토양 센서를 실험용으로 추가 제공해 주셔서 설치 모니터링 진행 중이다.\n기존에 설치한 수동 토양 수분 장력 센서는 석영 부분이 파손되어 일단 제거하고 추후 석영만 추가 구매해서 설치해야 할 것 같다.\n제주농업기술원 연구사와 함께 다른 감귤 농장에 방문해서 미래센서 데이터 신뢰성 검토를 위해서 고정형으로 설치한 2개 모델 이외에 휴대용 센서를 설치해서 해당값을 확인하고 있다.\n휴대용 데이터 로거에 토양 옵션을 변경하니깐 측정값 차이가 많이 발생해서 제주도 토양중에 대표적인 화산회토 기준으로 값을 확인할 예정이다.",
      "content_length": 479
    },
    {
      "id": "223186707700",
      "title": "2023.08.18 : 제주농업기술원 청년 농업인 교육 프로그램",
      "date": "2023. 8. 18. 8:36",
      "content": "제주농업기술원에서 추진하고 있는 청년 농업인 교육 프로그램의 일환으로 교육생들이 맘꽃가든 농장을 방문하였다. 김지우 지도사 인솔로 약 10여명의 청년 농업인들이 방문해서 입식 재배 시설 및 클라우드형 스마트팜 운영에 대해 소개를 해주었다. 무엇보다도 적은 비용으로 이런 시설과 시스템을 구축할 수 있다는 것에 큰 관심을 가졌다. 그리고 연간 소득 및 매출액을 물어보는데, 이에 대한 대답은 \"상추처럼 천천히 성장 중\"임을 알려주었다. 교육생들이 서귀포 지역에 살고 있어서 감귤 재배를 하고 있고, 노지 재배도 많아서 스마트팜 도입에 대해서 고민이 많다고 한다. 최근에 청년농업인들과 자주 만나고 얘기를 나누다 보니깐, 의외로 경영자적인 마인드로 접근하는 요망진 청년 농업인들이 많다는 것을 느낀다. 농업은 철저한 자기 사업이다. 시골의 정서는 이제 농업 현장에서 찾아보기 힘들다. 그래도 이렇게 농업을 이끌어 가고자 하는 청년이 많고 그들과 소통할 수 있다는 것은 내게 큰 삶의 활력소다.\n농장 내부에 모기가 많아서 밖에서 얘기를 나누는데, 반가운 소나기가 내리기 시작해서 다들 즐거운 맘으로 비를 맞았다.\n상추는 여전히 성장 중이다.....",
      "content_length": 583
    },
    {
      "id": "223179751344",
      "title": "2023.08.10 : 상추 38,000주 연중 생산 체제로",
      "date": "2023. 8. 10. 8:21",
      "content": "태풍 대비한다고 정신이 없었는데, 무탈하게 잘 지나가고 묶어두었던 버팀줄을 다 풀고 나니, 상추가 다시 보이고 있다. 이제 맘꽃가든에서 상추 38,000주 연중 생산 체계로 전환이 될 것 같다. 구역별로 파종, 육묘, 정식, 재배, 수확이 순차적으로 진행될 수 있도록 하는 체계를 만들었다. 이제 품질을 올리고 재배 품목을 다양하게 구성하는 것이 필요하다. 이렇게 세팅하는데 하우스 짓고 딱 3년 걸렸다.",
      "content_length": 226
    }
  ]
}