{
  "title": "맘꽃가든 스마트팜 구축사례 - 2022년 03월",
  "year": "2022",
  "month": "03",
  "total_cases": 5,
  "cases": [
    {
      "id": "222993979210",
      "title": "2022.03.28 : 동부자립형스마트팜 연구회 회원 조천 유인농원 양수기 모터 수리",
      "date": "2023. 1. 25. 18:35",
      "content": "[과거기록] 동부자립형스마트팜연구회 회원이신 조천 유인농원의 양수기가 파손되었다. 작동 시 소음이 너무 심해서 파손된 것으로 의심을 했는데, 내부를 분해해 보니, 베어링을 포함한 프로펠러가 아래처럼 파손되었다.\n참고로 농업에 사용되는 양수기 모터는 대부분 380V 3상 모터인데, 결선 방법은 Y결선과 델타 결선이 있다. 보통의 경우는 Y결선이다. 4,5,6번은 묶어주고 1,2,3번을 R,S,T에 연결하게 되는데 자세한 내용은 농업용 전기 교육을 받아야 한다.\n동일한 제품(을지 7.5마력 일체형)으로 구입했다.\n기존에 과부하로 인해 문제가 되었던 인입호스를 새 제품으로 교환하는 과정을 작업했다. 기본 호스 굵기가 60A 이상이라서 작업하기가 너무 어려웠다. 스마트팜은 이렇게 제어 자체가 문제가 아니라 개별 농장에 맞게 설치/유지/보수하는게 어렵다.",
      "content_length": 422
    },
    {
      "id": "222993947164",
      "title": "2022.03.24 : 황금콩밭 단호박 육묘장 육묘 결과",
      "date": "2023. 1. 25. 18:14",
      "content": "[과거기록] 지난 3월 초에 황금콩밭의 임병준 사장님께서 단호박 육묘장을 세우고 육묘를 마친 뒤 딱 3주 뒤에 다시 방문했다. 아래의 사진은 3월 2일 경에 육묘를 마친 상태다.\n3월 24일 경에 발아 및 육묘가 잘 되었는데, 계속 야간 온도를 맞추기 위해서 대포(? 전기 온풍기)를 가동했다고 하신다. 결론은 3단은 안되고 2단으로 하면 좋을 듯하다. 제일 아래 육묘 베드는 바닥으로 부터 60cm 전후, 그리고 두번째 베드는 140cm 전후에 설치하면 단호박 다단 육묘는 문제 없다는 결론...\n바닥에 너무 붙이면 전기 온풍기의 가온에 의해서 바닥쪽 육묘들이 빨리 성장하거나 상토가 마르는 경향 발생, 그리고 베드 사이 간격은 80cm 전후이면 채광에 상관없이 재배 가능한 것으로 확인되었다.\n끊임없이 연구하시고 시도해 보시는 연구회 회원분들이 정말 대단하시다. 특히 연구회 초대 회장이셨던 임병준 사장님의 열정이 느껴졌다.",
      "content_length": 463
    },
    {
      "id": "222983095828",
      "title": "2022.03.03 : 제주농업기술원 5번 실증 포장 테스트 제품 설치",
      "date": "2023. 1. 13. 10:51",
      "content": "[과거기록]제주농업기술원에는 다양한 작물 재배를 위한 실증 포장을 가지고 있다. 그 중에서 저비용 스마트팜 개발하면서 5번 실증 포장에 간단한 ESP32 제어 모듈과 온습도 환경 측정 모듈을 설치하였다. 점점 단순해 지는 MC 모듈 구성으로 스마트팜 제품 테스트를 완료하였다. 스마트팜의 핵심은 80% 소프트웨어, 20% 하드웨어 이다. 슬라워 시스템에서 장치 등록하고 바로 원격제어가 가능!!!!",
      "content_length": 222
    },
    {
      "id": "222983090282",
      "title": "2022.03.02 : 제주동부자립형스마트팜 연구회 황금콩밭 단호박 육묘장",
      "date": "2023. 1. 13. 10:45",
      "content": "[과거기록]제주동부자립형스마트팜 연구회 회원이신 황금콩밭 임병준 사장님께서 단호박 육묘장을 다단 베드로 만든 현장을 방문했다. 육묘장 지원 사업을 받아서 육묘장을 지으신 뒤에 직접 하우스 기자재를 구매해서 시설을 꾸미셨다고 한다. 약 한달정도 걸려서 진행되었는데 정말 대단하시다.\n원격 관수 제어는 슬라워 시스템을 사용하시는데, 그외 관련 설비는 직접 다 하셨다.\n이제 농사를 짓기 위해서는 농민이 직접 재배 시설을 세팅하거나 신규로 제작하지 않으면 안되는 시기가 도래한 것 같다. 다만 재배 결과로 확인해 보면 3단 보다는 2단 재배가 가장 적당한 다단 베드 구성으로 확인되었다.",
      "content_length": 325
    },
    {
      "id": "222954811139",
      "title": "2022.03.05 : 슬라워 전용 보드 제작 기록",
      "date": "2022. 12. 13. 20:34",
      "content": "[과거기록] ESP32와 아두이노 메가 기반으로 다단육묘베드와 밸브를 제어했는데, 배선 등의 문제가 많아서 슬라워 전용 보드를 제작하였다. 아래의 보드는 2020년 부터 테스트 해 왔던 보드들이다. 아두이노 IDE 기반으로 프로그램을 짜서 이런 저런 센서 측정 및 제어 로직을 파악하는데 많은 도움이 되었다.\n이번에 별도로 온습도센서, 감우센서, 일사량센서, 토양온습도 센서 등 다양한 센서 데이터를 받을 수 있는 환경 측정용 보드를 제작했다. 디지털, 아날로그 둘 다 지원이 가능하게 했다.\n그리고 릴레이와 모터드라이브를 제어할 수 있도록 16채널 제어보드도 제작하였다. 테스트 결과 작동은 잘된다. 그리고 선 연결도 깔끔해졌다.\n스마트팜에 있어서 중요한 것은 이제 하드웨어보다는 소프트웨어...\nWAS 서버의 역할이 제일 중요할 듯....",
      "content_length": 415
    }
  ]
}