{
  "title": "맘꽃가든 스마트팜 구축사례 - 2022년 12월",
  "year": "2022",
  "month": "12",
  "total_cases": 25,
  "cases": [
    {
      "id": "223027357403",
      "title": "2022.12.25 : 농사도 설계가 중요하다 (가변형 입식 베드 배치)",
      "date": "2023. 2. 25. 16:31",
      "content": "[과거기록]시설 원예를 해야겠다는 결정을 하고 본격적으로 농업에 뛰어들면서 제일 먼저 진행한 것은 100평 정도의 시설하우스를 직접 짓는 것이었다. 2018년 겨울 부터 진행했던 시설 하우스 구축 과정은 시설하우스 설계로부터 시작되었다. 제주 지역은 강풍 피해에 대비한 표준 설계 규정이 있다. 단순하게 육지에서 본 단동형 하우스와는 개념이 다른 50mm 파이프를 기둥으로 구성한 연동형 하우스가 기본 구조이다. 그래서 측량을 하고 기초 자리를 파고, 근가를 묻기 위한 포크레인 운전 기술을 배워야 했다. 하우스 자재상을 만나서 하우스 조립 부품 리스트(BOM)을 뽑고 납품받아서 바닥에서 조립, 세우고 하나씩 하나씩 조립해 갔다. 사실 무모한 도전이었으나, 지금은 제주농업기술원 연구사가 되신 운찬일 선배의 지도와 도움이 없었으면 아예 꿈도 꾸지 못할 일이었다. 하루에 사다리를 수백번 오르락 내리락 하면서 진행하다 보니, 작업한지 3달만에 100평 하우스를 혼자서 짓게 되었다. 하우스 파이프에 매달려 작업하다가 떨어진 경우도 여러번 있었지만, 팔다리가 부러지지 않고 무사히 비닐까지 마무리한것만 해도 하늘이 나에게 농사를 업으로 삼으라는 기회를 주신 것처럼 느껴졌다.\n그렇게 하우스 100평 짓고 난 뒤 하우스 내부에 작업실 만들고, 가변형 입식 재배 만들어서 테스트 한지 1년 반만에 특허 3건 등록하고 본격적인 재배 시설 확장에 돌입하게 되었다. 특히 하우스 증설 초기에 하우스 가로장대를 연결하기 위해 측면 비닐에 구멍을 뚫고 며칠 뒤에 태풍이 닥쳐서 작업실이랑 입식 재배 테스트 베드가 다 날라간 날은 내 인생에 잊지 못할 추억으로 남았다. 다행히 하우스 증설 업체랑 얘기가 잘 되어서 일부 보상은 받았지만, 하우스 내부에 설치된 제어 장비랑 센서가 다 문제가 생겨서 교체하는 작업을 진행해야 했다. 이 일을 겪고 난 뒤 하우스 내부에 두었던 WAS 서버를 AWS(클라우스 서버)로 변경하게 되었다.\n이러한 우여곡절을 겪고 난 뒤 하우스에서 진행했던 것은 하우스 바닥에 전기선, 통신선을 매설하는 것이었다. 이것도 입식재배베드 설계를 기반으로 무경운 재배를 할 예정이라서 아예 CD관을 하우스 설비 이전부터 세팅을 진행해서, 하우스 증설 이후에 바로 전기와 인터넷 통신이 가능한 상태로 만들었다.\n2021년 가을 부터 진행되었던 하우스 증설 작업은 그해 겨울 초입이 되어서야 마무리 되었다. 아래의 사진이 현재의 맘꽃가든 실증 농장 외관이다. 그래도 하우스 자재 가격이 오르기 전에 진행되어서 다행이라는 생각을 하고 있다.\n그리고 아래가 현재 맘꽃가든의 입식재배 베드 배치 현황이다. 아직 100% 완성된 것은 아니지만, 최초 설계했던 과정대로 진행되고 있다. 500평 규모에 38,000주 상추가 재배되도록 하겠다는 목표가 현실로 다가오고 있다.\n청장년 농업인 대상 교육을 할 때 항상 얘기하는 것이 있다. 만약에 스마트팜을 하고자 한다면 본인의 농장에 대한 설계 부터 진행해야 한다고..... 즉 \"농사도 설계가 중요하다\".. 스마트팜은 집을 짓는 것 만큼 어렵고 돈이 많이 들어가는 작업이다. 그렇다고 집을 지을 때는 전문가(건축가)와 협업이라도 가능하지만, 스마트팜은 아직 나에게 맞는 스마트팜을 설계해 줄 전문가가 그렇게 많지 않다. 그래서 더욱더 공부하고 경험해 봐야 한다.\n농업에 본격적으로 뛰어든지 5년 정도가 되어서야 내가 원하는 농장이 만들어지고 있다. 그 시간 동안, 좌절과 희망은 항상 내곁에서 나를 시험해 왔다.\n이후에도 그렇게 될 것이지만 오늘도 개선할 부분을 찾아서 새롭게 설계하고 하루하루 또 전진할 것이다.",
      "content_length": 1763
    },
    {
      "id": "222950772568",
      "title": "2022.12.09 : 순환팬 저전력화 5번째 실증 농가 사전 방문",
      "date": "2022. 12. 9. 15:01",
      "content": "서귀포시 남원리에 위치한 농가에 구동기 통신노드 설치하기 전에 사전방문하였다. 그리고 WIFI 신호 확장기 및 외부기상대도 전달하고 왔다. 설치는 직접 하시는 걸로~~~~~~~\n현재 새한테크 제어함이랑 수직형 교반기를 사용하고 계시는데 슬라워 기반의 원격 제어 및 저전력화 순환팬 기능을 사용할 예정이다. 12월 말에 설치 끝내고 내년부터 구동 예정이다. 이제 실증 5개 농장 모집은 다 되었다..",
      "content_length": 222
    },
    {
      "id": "222950770704",
      "title": "2022.12.09 : 연구회 회원들과 제주동부농업기술센터 농촌지도사업 성과보고회 참여",
      "date": "2022. 12. 9. 14:58",
      "content": "제주동부농업기술센터에서 코로나로 인해 중단했던 농촌지도사업 성과보고회를 개최했다. 자립형 스마트팜 임원진 분들과 함께 참여했다. 김경익소장님의 인사말을 시작으로 2022년 추진 실적과 2023년 추진계획에 대해서 보고를 들었다. 밭작물팀의 고보성팀장님이 큰 상을 받으신 것도 다들 축하해 드렸다. 그런데 참가자분들의 평균 연령이 의외로 많이 높았다. 우리 스마트팜 회원분들이 젊은 축에 속했다. 마지막 토론 시간에도 농촌 사회의 고령화와 청년 농업인 유입 방안이 계속 언급되었다. --; 쉽지 않은 문제다. 청년들은 힘든일을 하지 않으려고 하는데, 규모있는 농장에 매칭만 한다고 될 일이 아닌 것을 농민이 스스로 문제제기를 하고 있다.\n우리 자립형스마트팜 연구회 창설이 성과 내용으로 올라왔다. 열심히 활동해야 겠다. 그리고 우리가 청년 농업인이다.",
      "content_length": 419
    },
    {
      "id": "222950207089",
      "title": "2022.12.08 : 스마트팜 ICT기자재 국가표준확산 사업 우수 기업 선정 기념 사진",
      "date": "2022. 12. 8. 22:02",
      "content": "2022년 5월부터 진행했던 스마트팜 ICT 기자재 국가표준 확산 지원 사업을 마무리했다. 스마트팜 국가표준 중에 KS X 3267 구동기 통신 노드, KS X 3268 메타데이터 국가표준을 적용하였다. 천측창 개폐기와 순환팬 제어와 관련된 구동기 통신 노드에 국가 표준 RS 485 레지스트리 맵 적용하였다. 다행히 연초 부터 설계 했던 하드웨어와 소프트웨어를 잘 적용해서 계획대로 잘 마무리 했다.\n그리고 제주 농업기술원과 자립형 스마트팜 연구회 4개 농가에 실증도 잘 완료하였다.\n이렇게 한해를 마치면서 감사하게도 지원 사업 성과보고회에서 우수기업으로 선정되었고 한국농업기술진흥원 안호근 원장님과 기념사진을 찍게 되었다.",
      "content_length": 350
    },
    {
      "id": "222949883797",
      "title": "2022.12.08 : 슬라워 모바일 앱 농장별 센서 알람 기능 개선 회의",
      "date": "2022. 12. 8. 17:38",
      "content": "슬라워 모바일 앱 농장별 센서 알람 기능을 개발한 뒤 개별 센서별 상한값, 하한값 설정에 따른 사용자 알람을 보내고 사후처리방안에 대한 방안 협의를 진행했다. 시설하우스 내부 온도가 높아서 사용자가 앱으로 알람을 받고 난 뒤에 하우스 온도가 바로 내려가지 않는 경우가 많기 때문에 5분 단위로 알람을 계속 받게 되면 사용자에게 스트레스가 될 수 있다. 그렇다고 한번 알람주고 추가 알람을 주지 않으면 문제가 더 커질수 있다. 이를 해결하기 위해 알람에 추가 옵션을 제공하기로 했다.\n추가 옵션은 해당 알람 발생 이후에 1시간, 3시간, 6시간, 12시간, 1일 알람 받지 않는 기능을 제공하기로 했다.\n해당 기능에 대해서 스마트팜 연구회 회원인 오동규 총무, 콩깍지농원 김성훈 대표, 박대리, 심팀장 이랑 같이 협의 했다.\n항상 프로그램 개발은 구현보다는 설계가 더 시간이 많이 걸린다. 제대로 된 설계가 이루어지지 않으면 사후 수정 보안에 시간이 더 많이 걸린다.",
      "content_length": 484
    },
    {
      "id": "222949080696",
      "title": "2022.12.06 : 제주ICT협동조합 회원 농가 관수제어 및 순환팬 저전력화 제어",
      "date": "2022. 12. 7. 19:20",
      "content": "제주ICT협동조합 회원 김영종 농가에 관수제어 모듈을 설치하기로 하였다. 밸브 3개에 펌프 1개를 제어하기로 하고 8채널 SSR 모듈이 내장된 보드를 제공했다. 농장주가 워낙 경력이 많은 실력자라 제어함만 설치하고 프로그램만 업로드 했다. 나머지는 농장주가 알아서 한다.\n이제 자립형 스마트팜이 제대로 된 모습을 보이는 것 같다. 스마트팜 개발 업체는 최소비용의 하드웨어와 소프트웨어만 제공하고\n나머지는 농민이 설치/유지/보수할 수 있는 시스템....\n김영종 농장주가 기존 시스템에서 필요한 제어선들을 직접 분리하고 있다.\n맘꽃가든은 단순하게 제어함만 설치!!!!! 야호 멋지다...\n그리고 순환팬 제어 시스템 설치 농가로 이동해서 원격/수동 전환 모듈을 추가 설치완료 하였다.\n이제 공공기상 데이터와 연동되어 만들어진 10분 단위 스케쥴러에 따라 자동으로 순환팬이 작동될 수 있다.",
      "content_length": 438
    },
    {
      "id": "222948995619",
      "title": "2022.12.07 : 제주고등학교 실습 교육 협의 및 프로그래머 방문",
      "date": "2022. 12. 7. 17:55",
      "content": "내년부터 제주고등학교에서 재학생 대상으로 실습교육을 하기로 하였다. 함께 교육 프로그램에 참여할 김성훈 이사님과 함께 제주고등학교 식물공장 시설을 확인했다. 블루베리 전정작업을 하고 계시던 김범준 사무국장님과 조일환 박사님께서 시설 설명 및 운영 프로그램 관련 설명을 해주셨다. 다단베드로 이루어진 식물공장은 현재 2,000개 정도 엽채류 재배가 가능한데, 운영할 인력이 없어서 고민이라고 하신다.\n국내 최고의 농업기술을 가지신 분들하고 이렇게 좋은 시설들에서 배울 수 있다면 좋을텐데, 학생들의 반응은 아직 그렇게 높지 않다고 하신다. --;\n우리가 풀어야 할 숙제는 학생의 관심 유도!!!!! 제일 어려울 거라고 하신다. ^^;\n식물공장에 사용될 양액시설들.. 원액통과 교반통들이 잘 배열되어 있다.\n그리고 조일환 박사님이 응애천적을 보여주셨다. 현재 제주고등학교 재배실습장은 천적으로만 병해충 관리하고 계시고, 약제는 전혀 쓰지 않고 있다고 하신다. 대단하시다.\n그리고 스마트팜에 관심을 가진 젊은 프로그래머가 방문해서 이런 저런 스마트팜 개발에 대한 얘기를 나누었다.",
      "content_length": 545
    },
    {
      "id": "222946977999",
      "title": "2022.12.05 : KCTV 가변형 입식재배 시설 기술 소개",
      "date": "2022. 12. 5. 19:07",
      "content": "[영농정보] 상추농사도 쉽게…영농 혁신기술 도입\n농가 고령화와 고된 노동으로 요즘 상추농가가 많이 줄어들고 있습니다. 수익은 높은 편이지만 오랜시간 불편하게 앉아서 수확을 해야하기 때문에 기피 작물이 된건데요.제주의 한 스마트팜...\nwww.kctvjeju.com\nKCTV 영농 혁신 기술로 소개",
      "content_length": 165
    },
    {
      "id": "222946677751",
      "title": "2022.12.05 : 순환팬 저전력화 현장 실증 시작",
      "date": "2022. 12. 5. 14:04",
      "content": "순환팬 저전력화 현장 실증 시작... 콩깍지 농원, 리버티필드 농장",
      "content_length": 37
    },
    {
      "id": "222945563956",
      "title": "2022.12.04 : 제주ICT협동조합 농가 관수 제어 및 순환팬 자동/수동 전환 모듈 제작",
      "date": "2022. 12. 4. 13:01",
      "content": "제주ICT협동조합 조합원 농가에 설치할 관수 제어함과 순환팬 자동/수동 전환 모듈을 제작하고 있다.\n3개의 버마드 관수 밸브를 제어할건데, 8채널 릴레이를 온보드(OnBoard)화 해서 그런지 선이 엄청 단순해 졌다.\n이번에 ICT기자재 지원사업을 통해서 테스트하고 개선한 게 많은 도움이 된다.\n기술은 단순화하는게 제일 어렵다. 1.0SQ 파란색 선을 김녕 실증농장에 두고 오는 바람에 전체 연결을 다 마무리 하지 못했다.\n그래서 차주에 바로 설치해서 운영이 가능할 것 같다.\n그리고 또다른 회원 농가에서 실증할 순환팬 자동 제어 시스템의 자동/수동 전환 모듈을 제작하였다. 그 농가의 경우에는 수동, 기존 스마트팜 시스템, 슬라워... 이렇게 3개 시스템으로 전환 스위치를 만들어야 해서 아예 순환팬 작동 전원을 분리하는 3단 스위치랑, MC 제어 모듈을 적용하였다.\n스마트팜 시스템은 단순한데, 현장 적용이 너무 어렵다. 소프트웨어 개발하기도 힘든데, 현장 적용도 다 다르니깐,,,\n핸폰 앱만 개발해서 바로 사용할 수는 없을까? ㅋㅋㅋ\n파란색 1.0SQ 연선이 없어서 마무리는 내일해야 할 듯하다. --; 자재랑 공구를 사무실, 김녕실증농장, 연구회/협동조합 회원농가에 왔다 갔다하면서 설치하다보니 관리가 너무 힘들다.",
      "content_length": 629
    },
    {
      "id": "222970875774",
      "title": "2022.12.31 : 스마트팜 전문가가 백공이 되어야 하는 이유",
      "date": "2022. 12. 31. 11:19",
      "content": "스마트팜 기술을 개발하면서 작물재배, 재배시설, 시설제어를 융합하는 과정이 필요함을 매일 느끼고 있다. 농업용 시설 자재는 워낙 다양하고 품질이 제각각이다 보니깐 어디서 사고가 발생할지 모른다. 그러한 환경을 자동 제어한다는 것이 쉬운 일인가? 연속된 한파 이후에 날씨가 풀리다 보니깐 약한 관수용 자재가 파손되는 일이 발생하고 있다. ㅎㅎ\n접적 관수 T피팅 파손\n재생\n22\n좋아요\n0\n00:08\n\n접기/펴기\n접적 관수 T피팅 파손\n점적 관수 T피팅 파손\n재생\n14\n좋아요\n0\n00:05\n\n접기/펴기\n점적 관수 T피팅 파손\n이런 경우에 농민은 직접 보수를 해야 한다. 하지만 이런 일을 겪어보지 않은 초보 귀농인들은 여유 부품을 준비하지 못하는 경우가 많고 농자재상이 가까이 있지 않으면 낭패를 당하기 쉽다. 그래서 초보 귀농인들은 초기에 과도한 시설 투자하는 것에 신중을 기해야 한다.\n이제 스마트팜 전문가로서 백공의 길을 가고 있는 나에게는 이런 관수자재를 교체하는 것은 쉬운 일지만 누구나 쉽고 편하게 작물을 재배하게 하는 길은 결코 쉽지 않다. 오늘도 하나씩 하나씩 작물 재배하면서 2022년 마무리 한다.",
      "content_length": 567
    },
    {
      "id": "222969570892",
      "title": "2022.12.29 : 온도센서 릴레이 기반 천측창 개폐기 제어 시대가 저물어 간다.",
      "date": "2022. 12. 29. 20:21",
      "content": "제주시에서 거래하는 하우스 자재 업체를 방문했는데, 고장난 천측창 개폐기 제어함을 보게 되었다. 고장난 개폐기 제어함을 보니 이제 전기 릴레이 기반 제어 시대가 저물어 가지 않을까 한다.\n그리고 개페기 작동에 필요한 고용량의 24V트랜스.. ㅎㅎ",
      "content_length": 137
    },
    {
      "id": "222969502283",
      "title": "2022.12.29 : Flutter 로그인 유지, 공공기상데이터 조회 기능 및 공기순환팬 저전력 제어함 제작",
      "date": "2022. 12. 29. 18:31",
      "content": "카카오 OAuth 기능 개발 적용 이후 개별 농장 제어 시 부부가 각자 핸드폰에서 하나의 아이디로 로그인하기가 불편하다고 하셔서 로그인 유지 기능을 새롭게 접목했다. 그리고 사용자 설정에 따라서 공공 기상 데이터를 조회(현재값, 기간 설정 그래프)하고 경우에 따라서는 알람이 발생할 수 있는 기능을 개발 적용하였다.\n그리고 저전력화 모듈을 적용하기 위해 하드웨어를 구성하였다. 원격/기존 제어 전환 스위치를 포함해도 릴레이 1채널만 제어하면 되는 경우라 하드웨어가 단순해 졌다.\n기술이 발전함에 따라 점점 더 단순해 지는 모듈을 개발 적용이 가능할 듯.....",
      "content_length": 313
    },
    {
      "id": "222965182193",
      "title": "2022.12.25 : 크리스마스 고설 베드 증설 작업 실시",
      "date": "2022. 12. 25. 17:02",
      "content": "오늘도 농장와서 고설베드 증설 작업 공정 60% 진행 완료.. 1월 말이면 450평 기준으로 38,000주 재배가 시작된다.. 기대된다..",
      "content_length": 77
    },
    {
      "id": "222965180588",
      "title": "2022.12.23 : 한국생산기술연구원 제주본부 사업 설명회 참석",
      "date": "2022. 12. 25. 16:59",
      "content": "메종글래드 호텔에서 한국생산기술연구원 제주본부 사업 설명회 참석하다. 엽채류 재배 기술이 안정화되면 기능성 작물을 재배할 예정이다. 천천히 하나씩 만들어 가다보면 건강기능식품 가공까지 진출하지 않을까? 10년 뒤의 맘꽃가든을 위해서 하나씩 하나씩 진행한다.",
      "content_length": 143
    },
    {
      "id": "222961227753",
      "title": "2022.12.20 : 슬라워 데이터 EPIS 연계 테스트",
      "date": "2022. 12. 20. 21:25",
      "content": "슬라워 시스템에 대한 국가표준검정을 완료하고 스마트팜코리아 장치 등록을 진행하고 있다. 정부 인증 스마트팜 장치가 되기 위해서는 스마트팜코리아에 업체 및 장비 등록을 완료하여야 한다. 관련 자료 및 시스템 개발을 완료하고 심팀장과 함께 EPIS(농촌진흥청 빅데이터 수집 시스템) 연계 테스트 결과에 대한 회의를 했다. 일단 XML 기반의 SOAP 기술을 사용하여 규격서에 맞는 장치 운영 로그나 센서 측정 데이터를 서버로 전달하면 된다. 사실 최근에는 Restful API 기반으로 구동되는 서비스가 많은데, 일단 SOAP 기능을 적용해야 해서 간단하게 테스트하고 작업을 완료하였다.\nSOAPURL를 이용하여 간단하게 샘플 데이터 전송 방법을 확인했고, Spring Framework 해당 Controller를 개발 적용해서 2분 간격(스마트팜코리아규정)으로 Scheduler 서비스를 통해 데이터를 전달하게 했다.\n데이터 전송 구조는 아래와 같다. 슬라워 시스템에서 SOAP 서비스를 구동하지 않아도 되며, EPIS시스템의 SOAP를 호출해서 데이터 전송 결과를 받기만 하면 된다. 기본적으로 Device에서 슬라워 시스템으로 장치구동명령/상태, 센서측정값을 JSON으로 던지는데, 이를 다시 슬라워에서 EPIS에 데이터를 보내기 위해서는 XML 파일 형식으로 변환해야 해서 별도의 파싱 통해 바인딩 시키는 것이 필요하다. 이 부분만 Controller에서 신경써야 될 부분인 것 같다.\n농정원 EPIS 담당자와 확인한 결과 데이터가 잘 올라온다고 확인하고 이렇게 농정원 ICT 정보서비스연계는 마무리 될 것 같다.",
      "content_length": 793
    },
    {
      "id": "222958907198",
      "title": "2022.12.8 : 동복리 다단재배베드 설치 농가 방문",
      "date": "2022. 12. 18. 13:50",
      "content": "제주 농업 마이스터 대학 출신이신 김보균 사장님께서 동복리에 다단재배베드를 설치하시고 시설 설치 자문을 요청하셔서 직접 농가를 방문하였다. 하우스도 직접 지으시고 3단으로 재배 베드도 직접 설치하셨다고 하신다. 열정이 대단하시다.\n방문하는 현장에서 지금은 퇴직하신 이용철 제주도 보건복지여성 국장님도 함께 만나서 아이디어를 실현하는 방안에 대한 얘기도 나누었다.\n이런 분들을 만나면서 하루 하루를 헛되이 보낼 수 없음을 느낀다. 나에게 너무 젊고 할일이 많다고 하시니.... ^^;\n이번에 제작한 다구형포트를 드렸는데, 이렇게 설치하셔서 재배를 해 보시겠다고 하신다. 추가 주문을 할 때 사장님께 전달할 물량도 주문해야 할 것 같다.\n직접 용접으로 제작 설치하셨다고 하신다. 내가 바라던, 농민 스스로 설치, 유지/보수가 가능한 재배 시스템 구축이 멀지 않음을 느낀다.",
      "content_length": 430
    },
    {
      "id": "222956713419",
      "title": "2022.12.15 : 동계 시즌 청상추 로메인 수확",
      "date": "2022. 12. 15. 20:01",
      "content": "어제의 추운 날씨에도 별탈없이 잘 지나가고 오늘은 하우스 내부 온도가 20도를 넘어갔다. 다행히 청상추, 로메인 수확도 필요해서 김팀장을 포함한 개발자들이 상추 수확에 시간을 보내고 있다. 박대리는 재배에 들어간 뒤 2달이 넘도록 노트북을 켜지도 못한다고 하소연을 했다. ^^;\n그래도 스마트팜 개발자라면 작물 재배가 더 중요하다는 것을 공감하고 있기에 누구보다도 열심히 작물 재배에 나서고 있다.\n박대리가 수확해서 가지런히 놓여진 상추박스.. 이제 수확/포장 전문가가 되었다. 언젠가 본인의 농장을 운영하고 싶다고 하는데, 잘 공부하고 준비해 가기를 바란다.",
      "content_length": 313
    },
    {
      "id": "222956710822",
      "title": "[공지] 2022.12.15 : 동부 디지털 농업 연구회 활동 및 스마트팜 ICT 기자재 국가표준 확산 홍보영상 (Feat. 한국농업기술진흥원, 제주농업기술원)",
      "date": "2022. 12. 15. 19:57",
      "content": "2022년 맘꽃가든과 동부 디지털 농업 연구회 활동 홍보 영상을 찍었는데, 그 결과가 나왔다. 한국농업기술진흥원에서 진행했던 2022년 스마트팜 ICT기자재 국가표준 확산 지원 사업에서 우수기업으로 선정되고 활동에 대한 평가가 좋아서, 동부 디지털 농업 연구회 분들과 함께 홍보 동영상을 찍었다. 내가 스마트팜을 시작하면서 가지게 되었던 목표, 즉 청장년 세대의 지속적인 농업 활동 실현이 가까워 지고 있는 것 같다.\n(1) 스마트팜 개발은 작물 재배, 재배 시설, 시설 제어가 함께 되어야 한다.\n(2) 스마트팜 사용자인 농민이 직접 구매, 설치, 유지/보수가 되어야 한다.\n스마트팜이 냉장고처럼 전원만 꽂으면 작동되는 날이 오기 위해서는 개별 농장이 사전에 준비가 되어 있어야 하는데, 내가 봐온 농장 중에 똑같은 농장은 단 한군데도 없었다. 사용자를 포함해서 장치를 설치/관리해야 하는 경우의 수가 너무 많다. 이래서 세계 최고의 IT 업체를 가진 대한민국이 아직 스마트팜을 확산/보급하지 못하고 있다.\n언젠가 농민이 편하게 구매하고, 설치, 유지/보수하는 날이 오기를 희망하며, 하루 하루 도전한다.\n맘꽃가든_동부자립형스마트팜 연구회 홍보영상\n재생\n48\n좋아요\n0\n02:11\n\n접기/펴기\n맘꽃가든_동부자립형스마트팜 연구회, 2022년 스마트팜 ICT기자재 국가표준 확산 지원사업 자료",
      "content_length": 666
    },
    {
      "id": "222954814471",
      "title": "2022.12.13 : 가변형 입식재배베드 확장 작업 실시",
      "date": "2022. 12. 13. 20:39",
      "content": "외부 활동이 잦아지면서 잠시 중단했던 가변형 입식재배베드 확장 작업을 진행했다. 김팀장이랑 진행하고 있는데, 기존에 가지고 있던 부품을 가지고 고정부 영역은 작업을 다 끝냈고, 이제는 가변부 프레임을 설치하고 있다. 예상 기간은 둘이서 작업하면 1달 이내에 끝날 수 있을 것 같은데, 주문한 부품 도착 시기와 연말 행사로 좀 더 시간이 걸리지 않을까 한다.\n가변부에 15A 파이프를 놓아서 조립을 하나씩 진행하고 있다. 내년 여름, 450평 실증포장에 35,000주 상추를 정식/수확 하는걸 목표로 차근차근 진행하고 있다.",
      "content_length": 292
    },
    {
      "id": "222953595603",
      "title": "2022.12.12 : 청년 연구사/퇴임 연구관 만남 자리 (제주고등학교 재배실습장)",
      "date": "2022. 12. 12. 18:59",
      "content": "2020년 부터 함께 공동연구해 왔던 김현수 연구사와 함께 제주고등학교 재배실습장을 방문했다. 조일환 박사님과 김범준 사무국장님을 소개드릴 겸 해서 만남의 자리를 만들었다. 청년 연구사와 퇴임 연구관의 만남 자리라 나름 걱정은 되었는데, 스마트팜이라는 주제로 심도깊은 얘기를 나눌 수 있어서 어떻게 시간이 지나갔는지도 모르겠다.\n핸드폰으로 원격 제어/환경 측정만을 가지고 스마트팜이라 할수 없고, 빅데이터/인공지능도 작물 재배/생체 분석 없이 의미가 없다는 것에 다들 공감을 하였다. 특히 시설하우스 작물 재배가 보편화 되는 상황에서는 작물 생육에 필요한 최소의 에너지(난방/냉방)를 투입할 수 있는 적정 기술이 제일 필요하지 않겠냐고 조언을 해주셨다. 스마트팜 기술이 적용할 수 있는 영역이 기대도 높고 넓지만, 막상 최적화된 적정 기술은 아직 만들어지지 못하고 있는 것이다.\n입식재배, 원격제어, 환경측정은 완성을 했는데, 이제 작물 생육에 필요한 최적화된 에너지를 투입하는 적정기술연구 과제를 시작해야 한다.\n자연을 다루는 일은 시간이 오래 걸린다. 그래도 한걸음씩 한걸음씩 나아가다보면 오늘 만남의 자리와 같이 청장년 세대가 함께 어우러져 우리나라 농업의 미래를 개척해 나아갈 것이다.",
      "content_length": 611
    },
    {
      "id": "222952330475",
      "title": "2022.12.11 : 입식재배 시설 YTN 전국방송 타다 (Feat. 제주동부농업기술센터)",
      "date": "2022. 12. 11. 13:52",
      "content": "일요일 아침부터 지인들에게 여러 통의 전화가 왔다. 심지어 아내의 지인들이 아내한테 남편이 방송에 나오고 있다고....... 제주동부농업기술센터 김정우 지도사와 함께 KCTV 방송을 찍고 나서 따로 연락을 받지 못했는데, YTN 전국 방송에 나오고 있다는 것이다. 저녁 늦게까지 여러번 나온 것 같아서 많은 분들이 연락을 주셨는데, 감사드린다.\n동영상에 달려 있는 여러 댓글들을 보면서 여러 생각을 한다. 용접했다고 스마트팜이냐? 레일에 바퀴달아서 움직이는 게 무슨 특허냐? 시설비 많이 들어서 상추재배하면 무슨 소용이 있느냐 등등.... ^^; 다 공감하는 얘기다.\n나도 다른 누군가가 레일 위에 바퀴달고 용접만 해서 시설을 만들었다면 특허 낼 일도 없고, 스마트팜이 아니라고 말할 것이다.\n이렇게 짧은 시간에 방송 나와서 모든 걸 다 설명할 수는 없을 것이다. 여하튼 다들 관심을 가져 주시는 것만으로도 너무 감사드린다.\nhttps://youtu.be/qBUpBisZxXU",
      "content_length": 490
    },
    {
      "id": "222951819289",
      "title": "2022.12.10 : 동부 자립형 스마트팜 연구회 회원/소프트웨어 개발자 방문",
      "date": "2022. 12. 10. 19:31",
      "content": "주말인데도 맘꽃가든에 방문하시는 분들이 많이 생겼다. 동부자립형스마트팜 연구회 회원이신 채희용 사장님, 심인보 사장님, 그리고 지인분이 먼저 오셔서 간만에 얼굴도 뵙고 담소도 나누고 있었다. 세분다 스마트팜에 관심이 많으셔서 이런 저런 얘기를 나누고 있는데....\n일전에 약속했던 제주도에 거주하고 있는 임창진 대표를 포함한 개발자분들이 방문을 하셨다. 국제학교 부근에 지인분께서 부지를 제공해서 시설하우스를 짓고 스마트팜을 운영해 보고자 하는데, 자문을 구하고 싶다고 방문하셨다. 이런 저런 개발 얘기를 나누다 보니, 옛날 추억도 많이 난다.\n개발자는 소프트웨어 개발만 해야된다는 게 공감대!!!!... 농사는 다른 세상이다!!!!",
      "content_length": 354
    },
    {
      "id": "222942879848",
      "title": "2022.12.01 : 슬라워 모바일 앱 알람 기능 완성",
      "date": "2022. 12. 1. 7:55",
      "content": "SpringFramework 기반에서 개발된 슬라워 시스템의 모바일 앱 알람 기능이 완성되었다. 앱 자체는 하이브리드 개발 시스템인 플러터(Flutter)를 사용하였다. 다음에 기회가 되면 상세히 내용을 적을 것이다.\n동부자립형스마트팜 회원분들한테는 앱 설치를 해드렸다. 클라우드형 스마트팜 이라서 AWS에서 운영되고 있으며 기본적인 환경 데이터 모니터링 및 장치 제어는 다 가능하다.\n이번에 Firebase 기반의 Token 형태로 개별농장 사용자에게 알람이 전달되는 기능을 완성하고 배포하였다.\n알람이 사용자에게 전달되는 과정은 3가지이다.\n1. 등록하신 장치중 서버에 등록만 되어 있고 사용하지 않거나 실제로 사용 중이신 장치인 경우에 문제가 발생된 장치를 체크하여 장치이름 리스트가 알람으로 전송된다.\n2. 센서 데이터가 30분간 데이터가 갱신되지 않을 경우, 알람이 발송된다.\n3. 알람설정된 센서의 측정치가 상한값 또는 하한값을 넘을 경우, 알람이 발송된다.\n이 세가지 경우만 해도 농장 운영에 크게 문제가 없을 것으로 판단된다. 물론 CCTV와 외부기상대 설치를 권장한다. 가격도 저렴하고 농민들이 스스로 접근이 가능하다.",
      "content_length": 579
    },
    {
      "id": "222943305917",
      "title": "2022.12.01 : KCTV 상추 재배시설 촬영(차주 월요일 정규 뉴스 방송)",
      "date": "2022. 12. 1. 16:44",
      "content": "제주동부농업기술센터 김정우 지도사와 함께 제주 동부 지역 상추 재배 현황 및 입식재배시설 소개 관련 촬영을 진행하였다.\n근래에 들어서 계속 맘꽃가든에서 개발한 가변형 입식재배시설에 대한 관심이 높아지고 있다. 기존 고정형 대비 1.5배 재배 면적이 늘어나는 것을 직접 현장에서 확인하신 분들이 많아지다보니 착실히 기술 개발에 매진해야 함을 느낀다.\n제주동부농업기술센터 밭작물팀의 김정우 지도사가 열심히 제주 동부지역 상추 재배 농가 현황을 얘기하고 있다.\n기존 재배면적이 농촌인구고령화와 연작피해등으로 50% 이상 감소했다는 얘기에 다들 걱정을 한다.\n장모님이 입식재배로 수확, 포장하고 있는 장면을 촬영하고 있다.\n맘꽃가든이 생각하는 농업 방식에 대해서 인터뷰하고 있다. 청장년 세대의 지속적인 농업 활동 환경 구축을 목표로 하고 있기에 입식재배와 저비용 스마트팜 시스템 구축은 꼭 필요하다.",
      "content_length": 444
    }
  ]
}