{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 06월",
  "year": "2023",
  "month": "06",
  "total_cases": 5,
  "cases": [
    {
      "id": "223145727655",
      "title": "2023.06.28 : 영파머스 투자자 대상 맘꽃가든 사업 발표",
      "date": "2023. 7. 3. 18:12",
      "content": "만 50세 이하 영파머스를 대상으로 하는 IR 발표자리가 있어서 상추 재배 및 스마트팜 설치를 앞두고 서울 여의도에 발표를 하러 갔다. 이제 강의랑 사업 소개를 여러번 하다보니깐 그렇게 긴장이 되지도 않는다. 약 20명의 투자 전문가들 앞에서 맘꽃가든이 가고자 하는 농업 환경 변화의 길에 대해서 발표를 하였다.\n무엇보다도 맘꽃가든이 지향하고 있는 입식으로 전환 필요성에 대하여 얘기를 하였다.\n그리고 맘꽃가든이 개발한 다구형 포트와 스마트팜 통신 모듈을 가지고 직접 투자자에게 설명하였다. 무엇보다고 가공 식품 위주의 농식품 업체가 많은데, 이렇게 재배 시설 개선과 스마트팜 개발을 동시에 하는 업체는 처음 본다는 얘기를 많이 듣게 되었다. 특히 농업인들과 함께 직접 네트워크를 구성하는 것이 좋은 장점으로 판단된다고 하셔서 희망의 메세지를 다시 한번 더 써본다.\n정말 바쁘다. 블로그에 사진 올리고 정리할 시간도 없이 하루하루를 보내고 있다.",
      "content_length": 473
    },
    {
      "id": "223122192303",
      "title": "2023.06.05 : 맘꽃가든 청상추 재배 현황",
      "date": "2023. 6. 7. 9:10",
      "content": "여름 감기에 걸려서 1주일 동안 제대로 활동을 못하고 있다. 그래도 상추는 키워야 하고 재배도 해야 한다.\n이번에 특별하게 제작 주문한 흑백 유공 비닐에 상추를 식재하고 있다. 기존에 대비하여 상추 품질을 높일 수 있을 거라 기대한다. 그래서 육묘한 상추를 하나씩 뽑아서 유공비닐 기준으로 식재를 하고 있다.\n식재된 상추가 잘 자라기를 기대한다.\n그리고 설치했던 차광막을 다시 걷었다. 광에 의한 성장 속도 차이가 발생하였다. 제주 지역에 계속된 흐리고 비오는 날씨 때문에 차광막까지 설치했던 상추의 상태가 별로 좋지 못하다. 결국 차광막을 다시 정리해서 한곳으로 모았다.\n잘 자라고 있는 상추의 모습을 보고 있으니 아픈 몸도 낫게 하는 것 같다. 이번 감기는 쉽게 떨어지지 않는 것 같다. 하루 정도는 쉬어야 할 것 같다.",
      "content_length": 405
    },
    {
      "id": "223136039466",
      "title": "2023.06.20 : 서귀포 농업 기술 센터 스마트팜 교육",
      "date": "2023. 6. 22. 17:50",
      "content": "제주도내 스마트팜 교육 요청이 계속 있어서 서귀포 농업 기술 센터에서 스마트팜 교육을 실시하였다. 기존과 동일하게 우리가 제작한 제어 시스템과 환경 측정 장치를 가지고 가서 스마트팜 구성에 어떻게 사용되는지를 시연해 드렸다.\n무엇보다도 농업현장에 사용되는 장치를 직접 가지고 설명하는 것이 교육 효과가 제일 높다. 그리고 농민들의 질문도 제일 많아진다. 특히 현장에서 농업용 장치를 설치/유지/보수를 해 보신 분들은 꼭 명함을 가져가신다. ^^;\n이제 6월 마지막 날 제주시농업기술센터에서 하는 스마트팜 교육을 하고 나면 스마트팜 개발에 집중해야 할 것 같다.",
      "content_length": 313
    },
    {
      "id": "223132541662",
      "title": "2023.06.16 : 동부농업기술센터 스마트 강소농 현장 교육",
      "date": "2023. 6. 19. 8:20",
      "content": "동부농업기술센터에서 진행한 스마트 강소농 교육 프로그램 마지막 회차로 맘꽃가든 실증 농장을 방문해 주셨다. 참가하신 분들 중에 초보 농민분들도 계셔서 귀농 선배로서 이런 저런 얘기를 나눌 수 있는 기회를 가지게 되었다.\n동부농업기술센터의 이석준지도사가 단순한 현장 견학이 아니라, 스마트팜 장치의 직접 구동 및 구성 방법에 대한 강의를 부탁하셔서 맘꽃가든에서 개발한 슬라워 제품을 실습용으로 제작했다. 농업 현장에 직접 사용되는 순환팬, 밸브, 개폐기 등을 연결해서 직접 구동되는 과정을 설명했다.\n그리고 각종 전기 장치들로 직접 실물을 보여드리면서 구동을 해서 보여드렸다.\n이번 교육에는 특별히 박대리가 보조강사로 참여해서, 스마트팜 장치 구동 시연을 농민분들에게 해 드렸다. 앱 및 소프트웨어 개발하면서 이제 하드웨어 구성, 시연도 진행하게 되어서 뿌듯함을 느낀다.",
      "content_length": 430
    },
    {
      "id": "223128851062",
      "title": "2023.06.14 : 본격적인 상추 수확 작업",
      "date": "2023. 6. 14. 17:44",
      "content": "상추 재배가 안정을 찾아가면서 본격적으로 상추를 수확하고 있다. 이전에 육묘를 통해 정식했던 20,000주 정도에서 수확이 진행되고 있고, 다 채우지 못한 곳은 육묘 말고 직파를 통해서 38,000주를 채워가고 있다.\n안정적인 상추 수확 작업을 위해 고정 인력을 채용하기로 하고 장모님이 새로 고용한 분에게 상추 수확 및 잎 정리하는 방법을 가르쳐 주고 계신다.\n다행히 상추 가격은 2주 전부터 오르고 있어서 이번 여름에 높은 수익을 기대하고 있다.\n장모님이 수확한 상추를 4kg 박스에 적재하는 방법을 가르쳐 주신다. 새로 오신 분은 이전에 토경 재배 작업만 하셨는데, 입식 재배로 작업하니깐 너무 좋은 것 같다고 계속 일하고 싶다고 하신다.\n사위 잘못 만나서 농장에서 고생하시는 장모님... 이번 여름에 꼭 수익 창출해서 용돈을 팍팍 드려야 할 것 같다.\n상추의 생육 상태를 확인하고 계시는 실장님... 상추잎 중에서 생육 상태가 좋지 않은 것은 제거하고 잎은 색깔, 두께 등을 수시로 체크하고 계신다.\n그리고 상추 재배 일손이 부족해서 85세 이신 장인 어른까지 상추 정식에 참여하시고 계신다. 500평이라는 공간에 38,000주 재배 실현은 거의 완성을 했는데, 이제 안정적으로 재배하고 수확, 판매하는 것이 남아있다.",
      "content_length": 630
    }
  ]
}