{
  "title": "맘꽃가든 스마트팜 구축사례 - 2025년",
  "year": "2025",
  "total_cases": 6,
  "cases": [
    {
      "id": "223789667277",
      "title": "2025.03.07 : KT인터넷 설치",
      "date": "2025. 3. 9. 16:18",
      "content": "이제 시설하우스에 인터넷 설치가 필수가 되다보니, KT와 협업이 자연스럽게 이루어지고 있다. 다행히 KT 제주지역본부 법인팀에서 많이 도와주셔서 인터넷 설치가 어려운 농가에도 설치 부담없이 인터넷 설치가 될 수 있는 방향으로 지도해 주신다. 이번 키위 6개 농가 데이터 수집하는 사업에도 농가 부담없이 인터넷 설치가 될 것 같다..\n이제 제주도 스마트팜 설치하면 CCTV랑 인터넷 설치가 먼저라는 것이 다 아는 상식이 되어 간다.\nIoT기술이 농업 현장에 확산되는 것은 로봇이 생산현장에 확산되는 것 만큼 큰 흐름이 되어간다.\n멀리서 인터넷선 끌어온다고 고생하시는 KT 직원분들 감사합니다.",
      "content_length": 330
    },
    {
      "id": "223749385443",
      "title": "2025.02.04 : 아라플랫폼 현장 실증 기업 선정",
      "date": "2025. 2. 6. 7:30",
      "content": "농촌진흥청 산하 시설원예연구소에서 개발 실증중인 차세대 스마트 온실 플랫폼 \"아라\"를 현장 실증하기 위한 연구과제에 제주도 대표로서 맘꽃가든이 선정되었다. 농업인에게 편리하고 \"저비용\", \"저개발\", \"신시장 개척\" 위한 국가 연구 활동에 참여할 기회가 생긴 것에 감사하며, 착실히 현장 실증하고 그 결과를 농업인들에게 돌려줄 수 있도록 했으면 한다.\n추운 날씨에 맘이 움츠려 들지만 나에게 주어진 일들을 생각하면 몸이 움직여 진다.. 아자아자!! 추위야 물러가라.",
      "content_length": 260
    },
    {
      "id": "223778625680",
      "title": "2025.02.27 : 농협중앙회 방문",
      "date": "2025. 2. 28. 21:39",
      "content": "데이터 기반 스마트농업 기술 확산 위한 농협경제지주 스마트팜 관계 부서 요청으로 농협 중앙회 방문!!!\n서울에서 15년정도 직장 생활을 했지만 서울오면 촌놈처럼 높은 빌딩 먼저 쳐다보게 된다.\n전국의 멋진 스마트팜 업체들이랑 명함도 주고 받고, 농협경제지주 산지보급팀 관계자분들의 든든한 지원격려도 받으니, 제주도 대표 스마트팜 업체로 성장해 가는 길이 외롭지는 않다.\n이제 봄이 다가온다. 농부들은 자연스럽게 몸과 마음을 가다 듬으면서 하늘이 부르는 따뜻한 기운을 맞이한다.\n농민처럼 행동하는 스마트팜 업체 대표라 나도 슬슬 농가 하나라도 더 챙기고 몸도 부지런히 움직이련다.",
      "content_length": 323
    },
    {
      "id": "223768094494",
      "title": "2025.02.20 : 맘꽃가든 실증농장 방문",
      "date": "2025. 2. 21. 7:37",
      "content": "추운 날씨에도 정신없이 한주가 흘러가고 있다.. 이번 한주 동안에 3개 기관에서 맘꽃가든 실증 농장을 방문해 주셨다..\n기관에서 오면 되도록이면 견학 체험을 진행할려고 하는데, 사무실 확장, 신규 개발자 채용, 제주남원농협 설치 준비까지 하려고 하니,,, 정말 시간내기가 힘들다.\n1) 2/17 (월요일) 동원과학기술대학, 한국폴리텍대학 신사업 스마트팜 분야 교수님 단체 방문 :\n- 교수님 중에 대학 선배님도 계시고, 스마트팜 업체가 이렇게 농업인과 협업하면서 기술 개발하는 건 처음 본다고 추후에 학생들이랑 재방문 하겠다고 하심..\n== 이 분들은 제어알고리즘이나 센서 데이터 취득에 관심이 많으심.. ^^;\n2) 2/19 (수요일) 해남농민회 단체 견학, 박제수 회장님을 비롯한 농업인들이 오셔서 여러가지 재배 기술에 대해서 물어보시고 가심.. 나중에 회장님만 혼자서 방문하겠다고 하심..\n== 이 분들은 작물이랑 입식재배기술에 대해서 관심이 많으심...\n3) 2/20 (목요일) 제일 중요하신 분들이 방문하셨다. 농촌진흥청 시설원예연구소 김기영 소장님, 이재한 연구실장님, 이희주연구관님, 방지웅 박사님 일행이 방문해서 차세대 온실 플랫폼 현장 실증 방안에 대해서 의견을 나눴다.. 제주농업기술원의 김현수 연구사도 참석해서 다양한 농업 현장의 스마트팜 기술 적용 방안에 대해서 토론을 했다..\n== 이분들은 스마트팜 분야의 국내 최고 전문가 분들이라 작물별 생육모델 기반의 재배 기술 적용 방안을 요청하셔서 실무진들은 맘이 무거웠다. ^^;\n그래도 이용안 김녕리 전이장님도 재배 전문가로서 도와주시고 계시고, 제주농업기술원도 현재 농업 기술 발전 방향을 같이 고민해 주고 계셔서 든든한 지원군들이 많이 있으니, 추운 날씨에도 꿋꿋하게 하루하루 최선을 다하고자 한다.",
      "content_length": 880
    },
    {
      "id": "223715221594",
      "title": "2025.01.04 : 구역별 평탄화 작업",
      "date": "2025. 1. 5. 13:24",
      "content": "새해 잘 보내고 다시 슬슬 2025년 농사 준비합니다. 이제 밭 갈면서 농사 준비하는 시대는 끝났습니다. 신규농장에 고설베드 설치하기 위해서 배수로 작업마치고 구역별 평탄화 작업 진행합니다.\n베드 길이는 18m에 높이는 65cm정도로 쪼그리지 않고 깻잎, 상추, 쑥갓 재배할 예정입니다.\n450평 기준으로 35,000주 정도 재배 가능한데, 오늘도 주말이니 스마트팜 설치 농가들 사후 관리차 방문하면 김녕, 서귀포 남원 이렇게 한바퀴 돌면서 보낼 것 같습니다.\n어수선한 시국에 법과 상식이 멀어지는 것 같아서 힘이 빠져도 해야할 일들이 많으니,,, 오늘도 제할일은 묵묵히 실천하겠습니다.\n구역별 평탄화 작업\n재생\n3\n좋아요\n0\n00:04\n\n구역별 평탄화 작업",
      "content_length": 368
    },
    {
      "id": "223733664553",
      "title": "2025.01.21 : 제품 전시/협업",
      "date": "2025. 1. 22. 5:58",
      "content": "2025년 1월부터 제주도 스마트팜 기술을 알리고 발전시키기 위해 점점 더 많은 분들을 만나게 되고 제품 전시 행사로 눈코 뜰새없이 하루 하루를 보내고 있습니다.\n제주남원농협, 제주ICT협동조합과 협업체계도 구축하고, 제주대LINC사업단 행사에 저희 제품도 소개하는 시간도 가지게 되었습니다.\n농협 현장에서 농민들이 직접 검증해 보고, 함께 개선해 가는 것이 스마트팜 보급의 가장 기본임을 항상 가슴에 새기면 나무가 자라듯이 자연스럽게 성장해 가겠습니다.",
      "content_length": 254
    }
  ]
}