{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 04월",
  "year": "2023",
  "month": "04",
  "total_cases": 10,
  "cases": [
    {
      "id": "223091290559",
      "title": "2023.04.30 : 탑그린 상추 6,300주 파종 실시",
      "date": "2023. 5. 2. 15:06",
      "content": "여름 상추 재배 위해서 105구 육묘포트 60개 파종을 실시했다. 총 수량은 6,300주 정도 파종이 되었는데, 이전 파종 물량과 합치면 12,600주 정도 파종을 실시했다. 전체 시설 면적 기준으로 1/3 정도 상추 물량 파종이 완료되었다. 이제 잘 육묘해서 재배하면 된다. 그게 제일 어렵지만..",
      "content_length": 167
    },
    {
      "id": "223067664007",
      "title": "2023.04.07 : 스마트팜 보급 사업 설치 제어함 조립",
      "date": "2023. 4. 7. 13:24",
      "content": "스마트팜 연구회 회원 농가에 설치하기 위한 시설 통합 제어함, 관수 제어함, 시설 환경 측정함, 일사조도 측정함 등을 제작하고 있다.\n시설 하우스 내부를 측정하고, 제어하는 것도 중요하지만 기존에 설치된 아래의 제어함들과 연동하기 위해서는 별도의 스위치 전환이 필요하다. 현재의 스마트팜 기술 보다는 기존에 제어했던 방식을 사용할 경우도 많기 때문이다.\n그래서 시설통합제어함에 기존 시설함 제어와 연동, 전환될 수 있도록 스위치를 설치하고 있다. 그래서 농민이 필요에 따라서 전환, 사용할 수 있게 하기 위해서다.\n그리고 이번에 특별히 제주농업기술원 의뢰로 일사량 측정용 RS 485통신 기반의 Apogee SQ-522 제품을 구입해서 설치할 예정이다. 아래 제품의 그늘이 진 영역까지 일사량 측정이 가능한 제품이라고 한다.\n시설하우스 내부에 그늘이 지거나, 작물 수형 (잎 분포)에 따른 생육 상태를 확인하기 위해서 테스트를 진행할 예정이다. 기존 SP-110 제품 보다는 뛰어난 제품으로 확인되므로 현장 설치해서 검증할 예정이다.",
      "content_length": 522
    },
    {
      "id": "223065196237",
      "title": "2023.04.04 : 토양수분장력센서 애월 키위 농가 3개소 추가 설치",
      "date": "2023. 4. 5. 6:30",
      "content": "제주농업기술원에서 진행하고 있는 토양환경 빅데이터 수집 연구를 위해 애월 키위 농가 3개소에 총 6개의 토양 수분 장력 센서를 설치 진행 중이다. 지난 주에 1개소에 설치를 완료하고 데이터 수집이 정상적으로 이루어 지는 것을 확인한 뒤, 이번에 추가로 애월 키위 농가 2개소에 추가 설치하였다. 센서는 기본적으로 매 개소마다 2개씩 설치해야 하므로 환경 측정 보드에 2개의 센서 데이터 취득이 가능하도록 하였다. 그리고 예비 측정 기간동안 알게 되었던, 대기압 보정 알고리즘을 추가 적용하였다.\n제주농업기술원 연구사 및 직원들과 설치 위치를 정하고 땅을 파는 작업을 진행하고 있다. 토양 수분 장력 센서의 신뢰성을 확보하기 위해서 기존의 수동으로 측정했던 지점과 가까운 곳에 TEROS 32 토양 수분 장력 센서를 설치했다.\n고가의 센서 파손을 위해서 센서 위치에 추가로 노란색 고추 지지대를 추가 설치해야겠다. 추후 재 방문시 표시를 할 필요가 있을 것 같다.",
      "content_length": 482
    },
    {
      "id": "223088734118",
      "title": "2023.04.29 : 여름 상추 38,000주 중에서 1,300주 정식 시작",
      "date": "2023. 4. 29. 18:42",
      "content": "주말 비오는 날씨에 정식을 시작하다.. 정식은 흐린 날이 제일 좋다. 스마트팜 설치하러 다닌다고 정식 시기를 놓쳤다. TT; 일이 너무 많다. 그래도 할일은 해야 되니깐 여름 상추 재배 위해 38,000주 중에서 1,300주 정도를 심었다. 웃자란 묘종을 정리하는 데 시간이 더 많이 걸렸다. TT; 그래도 농사는 꾸준히 하다보면 된다. 포기는 하지 말고... ^^;",
      "content_length": 205
    },
    {
      "id": "223084909083",
      "title": "2023.04.25 : 제주ICT협동조합 농가 토양 수분 장력 센서 설치",
      "date": "2023. 4. 25. 19:25",
      "content": "하루종일 비가 오는데 제주 ICT 협동조합 소속 5개 농가에 대한 토양 수분 장력 센서 설치 작업을 수행하였다. 오전에 먼저 제주ICT 협동조합 교육장에서 회원 농가 대상으로 시설 환경 측정 방법 강의를 수행하였다. 오랜 기간동안 같이 스마트팜 연구를 했던 청년 농업인들이기에 시스템의 구조 및 데이터 취득 방법을 쉽게 설명할 수 있었고 제주 스마트팜의 발전 방향에 대해서 뜻깊은 대화의 시간을 가질 수 있었다. 무엇보다도 현재의 농업 실정에 맞지 않는 스마트팜 기술 개발 및 보급 사업의 문제점을 얘기하고 이에 대한 개선 방향을 얘기하는 시간이 많았다. 같이 농사짓는 사람으로서 스마트팜의 진정한 접근 방법을 찾아갈 수 있는 좋은 동반자들을 만난 기분이다.\n그리고 자문 교수님으로 제주농업마이스터 대학의 김찬우 교수님께서 참여해 주셨는데, 어느 농민 단체의 스마트팜 기술 교육 수준보다 높다는 칭찬도 해주시고 향후 기술 개발 방향도 제시해 주셔서 뜻깊은 대화를 나눌 수 있었다.\n이번에 선정된 회원 농가는 천혜향을 재배하는 농가로서 포장에서 특정 수목을 선정하고 토양 수분 장력 센서를 설치한 뒤 해당 측정값을 확인하였다.",
      "content_length": 573
    },
    {
      "id": "223083309224",
      "title": "2023.04.24 : 동부 디지털 농업 연구회 농가 버마드 50A 관수 제어 밸브 설치",
      "date": "2023. 4. 24. 8:23",
      "content": "동부 디지털농업 연구회 회원 농가에 50A 관수 제어 밸브를 설치하기 위해서 일요일 오후에 방문하였다. 700평 규모의 하우스에 여러 스마트팜 장치와 CCTV 8대를 설치하고 있는 중이다. 우선 WIFI 통신 및 CCTV 설치 위해서 관련 통신선, 전원선 등을 사무실과 연결하는 작업을 농장주와 함께 작업을 실시하였다. 이 농가는 제주도에서 최초로 3중으로 하우스를 지었는데, 사무실과 농장 사이에 통신 및 전원을 위한 CD관 매설 작업을 하지 않아서 여러 케이블을 재설치하는데 시간이 오래 걸렸다.\n그리고 오늘 작업의 핵심은 버마드 50A 전자밸브를 설치하는 것이다. 아래의 수동 밸브 앞쪽에 전자밸브를 설치해서 제어하고자 한다.\n설치하기 전에 기존의 관에 있던 물 빼기 작업을 실시하였다. 농장주가 관수 시설 설치에 경험이 많아서 많은 도움이 되었다. 농사를 짓는데 있어서 작물을 잘 아는 것도 중요하지만, 이제 농민은 백공이 되어야 한다.\n기존 관에 연결하기 위해서 스텐 50A 부싱을 설치하였는데, 플라스틱 나사선과 맞지 않아서 플라스틱 연결 부싱으로 교체를 하고 있다. 그랬는데도 물이 샌다... ^^; 항상 연결 작업이 완료되고 나서, 구동을 하게 되면 1군데 이상은 물이 샌다. 한번에 완벽하게 되는 경우도 드물다. 다행히 농장주도 똑같은 경험을 가지고 있어서, 연결 이후 테스트를 반복하면서 물이 새는 곳을 잡았다.\n연결이 완료되었다. 이제 제어 시스템과 펌프를 연결해서 밸브를 제어하는 작업을 진행할 예정이다. 펌프가 보통 5마력이상이라서, 밸브 제어와 연동시 타이밍을 잡기가 힘든 부분이 있다. 이 또한 하나씩 해결해 나갈 예정이다.",
      "content_length": 812
    },
    {
      "id": "223079510090",
      "title": "2023.04.19 : 동부 디지털 농업 연구회 농가 설치",
      "date": "2023. 4. 19. 19:21",
      "content": "동부 디지털 농업 연구회 소속 농가 회원 중에서 가장 젊은 청년 농업인 하우스에 맘꽃가든에서 개발한 슬라워 시스템을 설치하기로 하였다. 그래서 우선 통합제어함을 비롯한 기초적인 스마트팜 장치들을 오늘 설치하기로 하고 방문하였다.\n기존 제어함을 유지하면서 스마트팜 설치를 하고자해서 기존 설비가 모여있는 곳에 통합 제어함을 설치하고자 C형 거치대를 조립하고 있다.\n시설환경측정 센서 및 CCTV 설치를 위해서 하우스 중간에 WIFI 확장기를 설치했다.\n그리고 메인 전원함에 낙뢰방지기를 설치했다.\n기존 관수 펌프 제어함에 열동형 계전기를 추가 설치하고 추후 관수 제어함과 연동할 예정이다.\n이제 기본적인 함을 설치했고, 하나씩 기존 제어 시스템과 연계 작업을 실시하기로 하고, 농장주와 기술적인 협의를 진행하였다. 스마트팜 설치에 있어서 개발 업체의 능력도 중요하지만, 결국 사용자인 농장주가 어떻게 농장을 운영할 건지, 작물 재배는 어떻게 진행할건지, 기존 장치 운영과 호환은 어떻게 할건지 등.. 긴 시간을 두고 하나씩 하나씩 진행하고자 한다. 농장 10개를 설치하는게 중요한 게 아니라, 하나의 농장이라도 잘 운영되는 것이 가장 중요하다. 스마트팜을 도입한 농장주와 함께 연구하고 성장할 수 있도록 계속 노력해야 할 것이다.",
      "content_length": 631
    },
    {
      "id": "223076763438",
      "title": "2023.04.16 : 관수 제어 밸브 및 점적테이프 새들 설치",
      "date": "2023. 4. 17. 8:34",
      "content": "확장된 입식 재배 시설의 관수 제어를 위해서 전자밸브와 점적 테이프 새들을 설치하였다. 주중에는 스마트팜 관련 업무 때문에 농장에서 작업할 시간이 없어서 주말에 관수 부품을 준비해서 제어 밸브를 설치했다. PE관은 25A 기준으로 설치했다.\n버마드 전자밸브.. 25A 기준이고 12VAC에 의해서 작동되는 릴레이 제어방식 모듈이다. 맘꽃가든은 총 21개 구역이 있기 때문에 구역별 관수 전자밸브만 21개가 배치된다. 이를 순차적으로 제어하는 프로그램을 작물 생육 과정을 지켜보면서 개선해 가고 있다. 가장 힘든 일이 지속적으로 관수 스케쥴 알고리즘을 개선해 가는 과정이다. 많은 사람들이 전문가 인것처럼, 이런 저런 정보 예를 들어, 양액 상태, 배액 상태, 배지 상태, 온습도 상관관계, 공공 기상 데이터를 연계, 작물 재배 특성,,, 모든 정보를 기반으로 최적화된 관수 스케쥴을 만들어야 한다고 하지만, 이를 구현하는 것은 오랜 시간이 걸리는 노력이 필요할 것이다. 그래도 이런 노력을 인정해서 격려해 주시는 분들이 많아서 요즈음 힘이 많이 생긴다.\n전자 밸브를 연결한 모습이다. 차주에 12VAC 선을 연결하면 관수 제어가 완료될 것 같다.\n그리고 25A PE관에서 13 점석 호스로 연결하는 새들을 설치하였다.\n이제 새들에 13A 점적 호스를 연결하였다. 차주에 점적테이프까지 연결하면 여름상추 재배 준비가 어느 정도 마무리 될 수 있을 것 같다.",
      "content_length": 702
    },
    {
      "id": "223074222258",
      "title": "2023.04.13 : 한국생산기술연구원 파트너 기업 선정 및 제주 감귤 연구회 스마트팜 강의 참석",
      "date": "2023. 4. 14. 10:48",
      "content": "가변형 입식 재배 시설 및 클라우드형 스마트팜을 개발하면서 기술 자문을 해 주셨던 한국생산기술연구원에서 성장 가능성이 높은 기업으로서 맘꽃가든을 파트너 기업으로 선정해 주셨다. 스타트업 업체로서 기술 개발을 독자적으로 진행하는데, 어려움이 있을 때마다 공공 기관의 지원을 받을 수 있는 것이 큰 도움이 된다. 올 한해도 포기하지 않고 끊임없이 입식 재배 기술 및 클라우드형 스마트팜을 지속적으로 개발해 나가야 겠다.\n그리고 제주도 최대 연구회 단체인 감귤연구회의 2023년 정기 강의가 서귀포 감귤 연구소에서 개최되었는데, 스마트팜 관련 강사로 참석하게 되었다. 감귤 분야에 베테랑 분들을 대상으로 하는 강의라서 긴장을 했는데, 다들 농사에 진심인 분들이라 좋은 대화를 많이 나눌 수 있었다. 특히 현재의 고령화된 농업 현실을 스마트팜으로 다 해결할 수 있을지,,,, 농장마다의 재배 시설, 작물 현황이 다 다른데, 스마트팜이 다 커버할 수 있을지 등에 대해서 편하게 의논할 수 있는 자리였다. 무엇보다도 스마트팜의 기대치가 맞춰가고 있다는 느낌도 들었다. 이렇게 농업 현장에서 직접 작업하는 농민을 만남으로서 스마트팜 기술 개발의 방향을 결정하는 것이 무엇보다도 필요하다고 생각된다.",
      "content_length": 607
    },
    {
      "id": "223072024462",
      "title": "2023.04.11 : 충남 청양 가변형 입식 베드 설치 현황",
      "date": "2023. 4. 12. 8:04",
      "content": "충남 청양의 한 농가에 가변형 입식 재배 베드를 설치하기로 계약을 하고 설치 진행 현황을 확인하기 위해 방문을 했다. 해당 농가에서는 기존 토경 재배 시설을 입식으로 전환하고자 진행 중에 있으며, 재배 시설이 잘 구축되면 주변 농가에도 보급하는 절차를 밟을 예정이다.\n기존 하우스 시설을 점차 변경할 예정이라고 하시는데, 잘 진행하실 수 있도록 도움을 드려야 할 것 같다.",
      "content_length": 208
    }
  ]
}