{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 05월",
  "year": "2023",
  "month": "05",
  "total_cases": 14,
  "cases": [
    {
      "id": "223124253064",
      "title": "2023.05.27 : 감귤연구회 스마트팜 강연 및 시연",
      "date": "2023. 6. 9. 11:37",
      "content": "대부분의 스마트팜 교육이 이론 교육에 머물러 있다는 문제점을 타파하기 위해서, 김종우 회장님의 부탁으로 스마트팜 제품 시연을 실시하였다. 현재 농업현장에 사용되는 장치 등을 기반으로 직접 장치 구현을 해서 스마트팜 구성이 어떻게 되어야 하는지에 대해서 토론을 하였다.\n감귤연구회_스마트팜 시연\n재생\n13\n좋아요\n0\n00:07\n\n접기/펴기\n감귤연구회_스마트팜 시연\n간단하게 원격 제어를 통해 MC 스위치가 작동되고 이를 확인하기 위해 A접점, B접점용 경광등을 연결해서 구동기 제어 신호에 따라서 어떻게 스마트팜 제어 장치와 MC가 연동되는 지를 설명하였다.\n그리고 농업현장에서 직접 사용되는 버마드 50A, 밸콘 50A 밸브를 각각 제어하는 방식에 대해서 설명드리고, 개폐기 제어도 함께 설명을 드렸다.",
      "content_length": 393
    },
    {
      "id": "223117320322",
      "title": "2023.05.31 : 서부농업기술센터 스마트강소농 강의",
      "date": "2023. 6. 1. 11:01",
      "content": "스마트팜 강의 요청이 연속으로 있어서 이번에는 서부 농업기술센터에서 스마트 농업기술 교육을 실시했다.",
      "content_length": 56
    },
    {
      "id": "223097030643",
      "title": "2023.05.07 : 토양 수분 장력 센서 추가 설치 및 스마트팜 제어 모듈 설치",
      "date": "2023. 5. 9. 9:06",
      "content": "제주 ICT 협동조합 회원 농가 중에 천혜향 재배 농가에 토양 수분 장력 센서 TEROS 21 설치를 하고 센서 데이터 확인하기 위해서 방문을 하였다. 중요한 것은 농민이 직접 센서와 센서 측정함을 설치한 것이다. 다행히 해당 농가는 청년 농업인이라서 IOT 기기 사용 및 전기 설비 설치에 어려움이 없어서 나는 방문해서 측정 프로그램 업로드하고 데이터 이상 유무만 확인하였다. 이렇게 농업은 변화되고 있다. 스마트팜 제품이 Easy to Use 되기 까지는 현장 농업인들의 자발적인 노력이 필요하다.\n그리고 추가로 스마트팜 기자재를 설치하고 있는 농가를 방문했다. 해당 농가에 SHT-35 온습도계 2쌍을 설치했는데, 설치 백엽상을 15m 이상(양쪽 폭 30m) 떨어진 곳에 설치하기를 원하셨는데, 거리가 멀어서 인지 데이터가 올라오지 않는다. 센서 전원이 5V 이하라서 15m 이상 거리까지는 안정적으로 센서 전압이 유지되지 못하는 것 같다. 예상했던 바였지만 막상 이렇게 되고 나니 고민이 많아졌다. 위치를 조정할 것인가? (농장주가 원하지 않음), 케이블을 바꿀것인가? (다시 배선 작업해야 함) 측정 위치 가까운 곳에 센서함을 두개 설치할 것인가?( 보드 제작 비용 증가)...\n다행히 케이블을 교체하고 8m 거리에서는 측정이 되어서 추후 연장 케이블 구매해서 다시 측정해 보기로 하였다.\n그리고 스마트팜 관수 제어를 위한 배선 작업을 실시하였다. 기존 배선함에 EOCR를 추가 설치한 뒤 스마트팜 제어 모듈이랑 자동/수동 전환 스위치를 통해서 스마트팜 관수 제어에 문제가 생겼을 경우에도 수동으로 사용할 수 있도록 하였다. 이렇듯 스마트팜 설치 시 기존 설비를 제거하고 설치하게 되면 간단하게 운영이 가능할 수 있지만, 혹시 발생될 수 있는 비상 상황을 대비해서 기존 설비도 운영될 수 있도록 세팅을 해야 되기 때문에 스마트팜 설치가 쉽지가 않다. 왜냐하면 농장의 설치 상황도 다르고 요구사항도 차이가 나기 때문이다. ^^;",
      "content_length": 971
    },
    {
      "id": "223096365854",
      "title": "2023.05.07 : 서귀포 감귤 농가 스마트팜 강의",
      "date": "2023. 5. 8. 15:08",
      "content": "감귤명인이신 김종우 회장님께서 운영하시는 감귤 농가 스마트팜 강의 프로그램에 강사로 초대를 받아서 연휴에도 열심히 일하는 행운을 가지게 되었다. 청년 농업인을 포함하여 10명의 농업인들에게 \"저비용 스마트팜 및 빅데이터 활용\"이라는 주제로 강의를 하게 되었다. 올해 10기수에 걸쳐서 강의를 하게 되어서 나름대로 농업 현장의 농민들과 많은 스마트팜 적용 애로 사항을 얘기하고 토론할 수 있을 것 같다. 첫 강의라서 그런지 2시간 강의 시간이 지루하지 않을 정도로 뜨거운 열기를 느낄 수 있었다. 이번 강의에서는 뜻하지 않게 중요한 질문이 나왔다. \"스마트팜 설치하면 작물 재배 품질에 효과가 있나요?\"... 이에 대한 나의 대답은 \"가능하지만, 작물 재배 품질까지 기대하시기에는 아직 부족한 부분이 많습니다. 작물 재배 품질 효과보다는 노동력 절감에 중점을 두셔야 합니다\" 였다.\n강의 과정에 열띤 질문과 토론이 이어지면서 김종우 회장님께서 경험한 스마트팜 기술 적용 사례도 말씀해주셔서, 많은 도움이 되었다. 이렇게 현장에서 농사를 짓는 농민과 전문가가 늦은 저녁시간까지 연구하고 고민하고 있지만, 아직 스마트팜 기술 적용이 쉬운 것은 아니다. 인공지능, 빅데이터 기술을 적용하기 전에 농장 시설 개선 및 관리가 중요한 것이 현실이다.",
      "content_length": 636
    },
    {
      "id": "223093194302",
      "title": "2023.05.03 : 청양 상추 농가 2번째 가변형 고설 재배 시설 구축",
      "date": "2023. 5. 4. 11:12",
      "content": "충남 청양 상추 농가에 가변형 고설 재배 베드 및 포트를 설치 하였다. 전국 단위로 가변형 고설 재배 시설을 구축하고자 했는데, 이렇게 빠르게 제2의 맘꽃농장 구축이 진행될 줄은 몰랐다. 직접 가변형 고설 재배 베드를 설치하셨는데, 청양 상추 농가 농장주에게 진심으로 감사의 말씀을 이 자리를 빌어서 드리고자 한다. 아래는 시멘트 바닥 시설이 되어 있어서 쉽게 가변형 고설 베드 및 포트 설치가 가능했다고 하신다.\n가지런히 놓여 있는 청상추가 잘 성장하기를 바란다. 기존의 고정형 설비 대비 30% 이상 식재가 가능해서 농가에서도 수확량이 증대되고 작업도 서서하는 것이라 기존보다 작업 환경도 개선될 것으로 기대하고 계신다.\n여기는 두번째로 설치한 상추 시설하우스 내부 모습이다. 바닥이 기존의 토경 재배 시설이라서 베드 설치에 어려움이 있었다고 하시는데, 다행히 잘 설치도 되고, 정식까지 마쳤다고 하신다. 이번 5월 중순경에 직원들과 현장을 방문할 예정이다. 한껏 기대가 되고, 베드 시설을 운영하시는데 문제가 없도록 많은 지원을 해드려야 할 것 같다.",
      "content_length": 535
    },
    {
      "id": "223115388327",
      "title": "2023.05.29 : 제주농업기술원 스마트팜 정예인력양성 프로그램 강의",
      "date": "2023. 5. 30. 13:00",
      "content": "석가 탄신일 대체공유일 지정으로 휴무일인데도, 미리 약속한 강의 일정이 있어서 제주농업기술원에서 강의를 하게 되었다. 프로그램은 \"스마트팜 정예인력양성 프로그램\"이며 나의 발표 주제는 \"저비용 스마트팜 및 빅데이터 활용\"에 대한 강의였다. 교육 담당자인 김지원 지도사가 비도 오고 공휴일이라 참석자가 많지 않을 거라는 걱정을 했음에도 불구하고 강의실 의자가 다 찰 정도로 많은 분들이 참석하였다.\n그만큼 본인의 농장에 스마트팜을 적용하고자 하는 열의가 높음을 알수 있었다. 특히 나와 같은 기술개발 업무나 IT 프로젝트에 참여했던 귀농인 분들도 계셔서 여러가지 기술적인 현황 등에 대해서 얘기를 나눌 수 있는 자리였다.\n약 4시간에 걸친 교육 시간 동안 단순한 이론 교육에 그치지 않고, 실제 앱 사용, 센서 장치 특징, 장치 구동 등을 보여드리고자 노력했다. 이제 스마트팜에서 이론교육만 하는 것은 무의미하다.",
      "content_length": 454
    },
    {
      "id": "223111630068",
      "title": "2023.05.24 : 청양 수현 농장 가변형 입식 재배 시설 견학",
      "date": "2023. 5. 25. 16:34",
      "content": "맘꽃가든의 파트너 농장으로서 활동하고 계시는 청양 수현 농장 가변형 입식 재배 시설 견학을 다녀왔다. 기존의 버섯 재배사를 약 3개월 정도의 작업 기간 동안에 이렇게 완벽하게 가변형 입식 재배 시설로 변화시키셨다. 현재 몇 가지 개선 사항이 있지만 상추 재배 및 수확에 큰 제약은 없었다고 하신다. 농장주 사모님께서는 기존 토경재배의 기술을 그대로 유지하면서도 \"서서\" 작업하니깐 일을 마치고 나면 이전보다 훨씬 몸이 가볍다고 하신다. ^^; 맘꽃가든이 개발하고자 했던 기술의 장점이 나타나는 것 같아서 진심으로 감사를 드린다.\n추가로 노지 바닥에 가변형 베드를 설치해서 상추 재배 테스트도 진행하고 계신다고 한다. 기존 버섯 재배사에서 사용했던 자재를 최대한 재활용하여 베드 프레임을 만들고 가변형 포트만 구매하셔서 구성을 하셨는데, 그 열정에 항상 배움을 느낀다.\n그리고 수확량 및 재배 현황을 비교하기 위해 기존 노지 재배 포장은 일부 남겨두셨다고 한다. 이를 통해 재배상의 문제점 및 개선 사항을 지속적으로 찾으려고 하신다.\n그리고 이번에 새롭게 구축하신 양액 시스템... 구축 비용은 1,???만원 정도 발생했다고 하시는데, 고품질 상추 재배를 위한 노력을 끊임없이 하고 계신다.\n이날 재배 시설 견학에는 청양군 농업, 농협, 한국생산기술연구원 박사님을 포함한 여러분이 참여를 하셨는데, 수현농장 농장주 님의 노력에 다들 격려를 보내셨다.",
      "content_length": 698
    },
    {
      "id": "223109254712",
      "title": "2023.05.22 : 모바일 앱 반응형 화면 개발",
      "date": "2023. 5. 23. 8:00",
      "content": "Flutter 기반의 스마트팜 모바일 앱을 출시해서 일반 사용자 대상으로 슬라워 설치를 진행하고 있다. 사용자가 늘어나면서 대상 기종 중에 일부 화면이 깨지는 현상이 발생하였다. 반응형 화면을 개발해서 거의 모든 모바일 기기에 잘 적용이 될 거라고 생각했는데, 갤럭시 S21 기종에서 아래와 같이 센서 항목이 제대로 로딩되지 않았다.\n사무실에 돌아와서 직원들과 해당 문제가 왜 발생했는지에 대한 원인을 찾고 있다. android studio에서 S21 emulator (화면폭, 해상도) 설정해서 로딩했는데, 똑같은 형상이 발생되지 않는다. 다행히 반응형 화면 설정에서 문제 원인 및 해결 방안에 대한 실마리를 찾았지만, 테스트 해보고 다시 업데이트 하는 과정을 거쳐야 한다. 이렇게 스마트팜 개발은 농업, IT, 사용자, 센서, 구동기 특성 등 검토해야 할 사항이 많다. 그래도 끈기있게 진행하리라. 왜냐하면 맘꽃가든의 미래를 기다리는 농민들이 있기에....",
      "content_length": 481
    },
    {
      "id": "223107557139",
      "title": "2023.05.20 : 제주 감귤 연구회 스마트팜 실습 교육",
      "date": "2023. 5. 21. 7:50",
      "content": "제주 감귤 연구회 농가를 대상으로 한 스마트팜 실습 교육을 토요일 저녁에 실시하였다. 기존의 스마트팜 교육이 모두 이론 위주의 교육이 대부분이라 농업 현장에서 직접 적용할 수 있는 실습 교육 프로그램을 만들기 위한 노력을 진행하고 있다.\n멀리 대정이나 성산에서 오신 분들도 많이 있고, 열정적으로 농장을 운영하고 계시는 여성 농민분들도 계셨다. 직접 시설하우스 운영에 참여하고 스마트팜을 도입하고 계셔서 대단함을 느끼고 있다.\n좀 더 심화된 내용을 얘기하기 위해 스마트팜 국가 표준에서 정의하고 있는 구동기, 센서의 특징에 대한 설명을 하였다. 특히 구동기는 스위치형, 개폐기형으로 구분되며, 농업용 센서는 아날로그와 디지털로 나뉘는데 요즈음 대부분 RS-485, SDI-12, I2C 통신 등의 디지털 센서가 많음을 설명드렸다. 또한 농장 내의 WIFI 망 구성, CCTV 구성 등에 대한 실질적인 농업현장에서 적용 방안에 대한 교육을 진행하였다.\n그리고 클라우드 스마트팜 시스템 내에서 내 농장의 구동기와 센서가 어떻게 등록되고 관리되어야 하는지에 대한 설명도 진행하였다.\n현장 실습을 위해서 제작한 실습용 제어함과 센서 측정함을 가지고 전자 밸브 구동 시연을 위해서 전자 밸브 선을 분리해서 연결하고 직접 구동을 시연하였다.\n그리고 스위치형 구동기 시연은 별도 펌프 구동이 교육장에서 힘든 관계로 경광등 램프로 대체해서 진행하였다.",
      "content_length": 692
    },
    {
      "id": "223091291986",
      "title": "2023.05.01 : 빅데이터 수집 장치 이전 설치",
      "date": "2023. 5. 2. 15:07",
      "content": "2022년에 제주농업기술원 공동연구를 위해서 설치했던 빅데이터 수집 장치 농가 2곳을 다른 농가로 이전 설치하기로 하였다. 5월 1일 근로자의 날, 직원들은 휴무라서, 대표가 직접 현장에 나가서 김동균 연구사와 함께 하우스 기둥에 매달려서 작업을 하였다. 5월 1일 근로자의 날에 쉴 수 없는 사람은 업체 사장이랑 공무원들 밖에 없다는 위안의 말을 서로 나누면서 작업을 수행하였다.\n시설하우스 면적이 넓어서 IPTIME RING WIFI 확장기를 농업용 창고 시설 상부에 설치하였다.\n토양센서도 이전 설치할 곳에 20cm 정도 깊이로 파서 설치 작업을 수행하였다.\n센서와 데이터 로거에 연결하고 작업을 완료하였다.",
      "content_length": 343
    },
    {
      "id": "223106512326",
      "title": "2023.05.19 : 제주중앙중학교 학생 진로 체험 방문",
      "date": "2023. 5. 19. 16:56",
      "content": "",
      "content_length": 0
    },
    {
      "id": "223103339707",
      "title": "2023.05.10 : 스마트 농업 연구회 소속 농촌지도사 방문",
      "date": "2023. 5. 16. 10:37",
      "content": "제주농업기술원의 추천으로 전국 단위 농업기술센터 소속 농촌지도사 연구 모임 중에서 \"스마트농업 전문 지도 연구회\" 소속 지도사 분들이 맘꽃가든을 방문하셨다. 많은 인원이 한꺼번에 방문하시는 자리라서 어떻게 설명을 드려야 할 지 몰라서 걱정을 했는데, 다들 농업 현장에서 근무하시는 분들이라 스마트팜 기술 개발의 개선 방향이나 농민들에게 보급할 수 있는 방안에 대해서 대화를 나눌 수 있는 자리였다. 무엇보다도 기술과 현장 적용에 있어서 차이가 아직 많음을 같이 공감하는 자리였다고 할 것이다. 그래도 이렇게 많은 전문가들이 스마트 농업 기술 보급에 함께 하고 있음을 희망을 느낀다.\n가변형 입식 재배 구조에 대해서 설명드리고 한번 테스트 해 보면서 무게에 비해서 사람 손으로 쉽게 움직여서 놀랍다고 하셨다.\n그리고 현재 여름 상추 재배를 위해서 준비 중인 재배 시설에 대해서 설명 드리고 의견을 나누는 시간을 가졌다. 이렇게 많은 곳에서 찾아와 주시고 맘꽃가든이 제주도를 대표하는 스마트팜으로 서서히 자리를 잡아가는 것 같아서 희망을 느끼는 하루였다.",
      "content_length": 532
    },
    {
      "id": "223102293754",
      "title": "2023.05.14 : 스마트팜 슬라워 농가 설치 진행 중",
      "date": "2023. 5. 15. 9:26",
      "content": "슬라워 시스템을 통해서 환풍기, 순환팬 원격 제어도 되면서도 기존 수동 제어함도 작동되도록 제어함을 추가 설치하고 프로그램을 수정, 업데이트 진행 중... 기존의 환풍기 제어함이랑 순환팬 제어함이랑 구조가 달라서 기존 전기제어함 전환 스위치를 모듈마다 별도로 구성해서 연결함.\n그리고 제주 ICT 협동조합 농가에 설치한 토양수분장력센서 데이터 취득을 확인하러 방문함.. WIFI 접속이 안된다. 다시 보드 점검을 실시해야 할 듯하다. 센서마다 인터페이스 방법이 달라서 확인해야 할 게 많다.",
      "content_length": 274
    },
    {
      "id": "223102287357",
      "title": "2023.05.13 : 청상추 재배 차광막 설치 55%",
      "date": "2023. 5. 15. 9:16",
      "content": "여름 상추 재배를 위해서 차광막 설치를 진행했다. 작물 재배에 차광막 사용은 35%, 55% 두 가지 종류가 사용된다. 이번에 두 가지 종류를 모두 주문해서 설치할 예정이다. 우선 하우스 두동에 55% 차광막을 설치했다. 하우스 가로장대 위로 걸치는 데 기존에 순환팬 작동을 위해서 VCTF 전선을 케이블 타이로 고정한 게 걸려서 다시 전선을 파이프 하단으로 옮기고 케이블 타이도 다시 고정했다.\n하우스 가로 장대 위로 차광막을 한 줄씩 땡기면서 설치했다. 다행히 차광막 무게가 가벼워서 2m 간격으로 놓여진 가로장대 사이로 처지는 문제는 크게 없었다.\n이제 상추 모종 파종오 거의 20,000주 진행되었고 순서대로 정식하는 작업을 진행하고자 한다.\n관주용 비료도 미리 정량을 1차 희석해 두었다. 색깔이 맘에 든다..",
      "content_length": 402
    }
  ]
}