{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 01월",
  "year": "2023",
  "month": "01",
  "total_cases": 13,
  "cases": [
    {
      "id": "222975934467",
      "title": "2023.01.05 : 공공기상데이터 기반 공기순환팬 저전력화 시스템 실증 농장 설치",
      "date": "2023. 1. 5. 19:45",
      "content": "남원 정시철 농장 설치",
      "content_length": 12
    },
    {
      "id": "222974740744",
      "title": "2023.01.04 : 한국농업기술진흥원 강신호 본부장님 방문",
      "date": "2023. 1. 4. 15:38",
      "content": "2021년 입식재배시설 개발이 본격적으로 진행될 때부터 관심을 가져주시고 격려해 주시던 한국농업기술진흥원 벤처창업본부 관계자 분들이 방문해 주셨다. 특히 강신호 본부장님은 매년마다 사업진행 상황도 체크해 주시고, 문자로 응원해 주시곤 했는데 바쁜 제주 일정에도 연락을 주셔서 이렇게 기념사진을 촬영하게 되었다. 올해는 매출을 많이 올려서 수익 모델이 만들어지기를 바란다고 하시는데 대표로서 큰 책임감을 느낀다.^^; 이경원 팀장님과 윤영욱센터장님도 간만에 오셔서 이전보다 많이 발전했다고 하시니 힘이 난다. 스타트업 업체로서 새로운 길을 개척하는 것이 힘들고 버거워도 격려해 주시고 응원해 주시는 분들이 계셔서 올 한해도 진행형!!!!",
      "content_length": 355
    },
    {
      "id": "223000292007",
      "title": "2023.01.31 : 제주동부농업기술센터 기술보급과 방문",
      "date": "2023. 1. 31. 13:12",
      "content": "제주동부농업기술센터 기술보급과 김승현과장님과 김녕리 이용안 전 이장님께서 갑작스러운 서리피해 농가들이 많이 발생해서 입식재배시설 점검할 겸 방문해 주셨다. 다행히 날씨가 풀려서 상추가 금방 회복을 했는데, 그래도 농사가 쉽지 않음을 또 배운다.",
      "content_length": 136
    },
    {
      "id": "222997457289",
      "title": "2023.01.27 : 애월 키위 시설 농가 환경 정보 수집 장치 점검",
      "date": "2023. 1. 28. 19:18",
      "content": "2022년 제주농업기술원 감귤아열대과 공동 연구과제로 설치했던 키위 시설 농가 환경 정보 수집 장치 점검 차 방문을 하였다. 키위 수확은 대부분 11월 이전에 완료하는데 전정까지 마무리한 뒤라 그런지 농장들이 싸늘하다. 키위하우스는 감귤에 비해서 온습도 관리에 신경을 덜 써도 되고 인력도 적게 투입되는 작물이라 제주도에서 감귤하우스에서 키위로 전환하는 농가가 늘고 있다.",
      "content_length": 208
    },
    {
      "id": "222996307012",
      "title": "2023.01.27 : 연일 계속되는 한파에도 무사히 상추 수확 완료",
      "date": "2023. 1. 27. 19:30",
      "content": "연일에 계속되는 한파에 상추 가격이 많이 올랐다. 열심히 따야 한다. 일손은 없는데 주문은 많다. TT; 어쩔 수 없이 농장에서 반나절 정도 수확을 하였다. 다행히 상추가 동해를 입지 않고 잘 버티고 있어서 수확을 잘 진행하였다. 수확하기 전 상추 모습....\n수확 이후의 상추 모습.... 올해 봄 부터는 양면 비닐을 덮어서 재배할 예정이다.\n상품성은 역쉬 로메인 상추가 좋은 듯하다. 재배도 잘 되고... 점점 더 청상추 보다는 로메인으로 전환해야 겠다는 확신이 든다.\n계속 되는 한파에 내일도 수확 작업을 해야 하는데 날씨가 걱정이다. 농사는 쉬운게 없다!!!!! 입식재배라도 하니깐 그나마 추운 날씨에도 작업이 가능하다.",
      "content_length": 351
    },
    {
      "id": "222989861817",
      "title": "2023.01.20 : 가변형 고설 베드 증설 작업 70% 완료 및 다구형 포트 입고",
      "date": "2023. 1. 20. 17:20",
      "content": "2월말까지 가변형 고설 재배 배드 증설 작업을 마무리 하기 위해서 노력중이다. 현재 70% 정도 작업이 완료되었다. 특히 가변형 프레임은 거의 조립이 완료되어서 다른 부자재들과 조립하는 과정이 남아있다. 2월달에도 부지런히 작업하면 봄부터 500평 규모에서 38,000주 상추 재배가 시작될 수 있을 것 같다.\n증설되는 가변형 고설재배 베드에 놓여질 다구형 포트도 입고 되었다. 물량은 1900세트인데, 이중에 일부는 다른 농가에서 시험하겠다고 해서 전달해 드렸다. 이번에 증설되는 물량으로 20,000주 정도 추가 재배가 가능할 것 같다. 설날이 다가오는것 보다 상추를 다 심을 날이 기다려진다.",
      "content_length": 334
    },
    {
      "id": "222972956648",
      "title": "2023.01.02 : 공공기상데이터, AWS, 온습도 데이터 동일 시계열 조회 방안 협의",
      "date": "2023. 1. 2. 18:53",
      "content": "맘꽃가든 시무식 겸 올 한해 주요한 개발 사항 중에 하나인 센서 데이터 동일 시계열 조회 방안에 대하여 협의하다. 간만에 다들 농장이 아닌 사무실에 모여서 IT 개발자 모드로 일하는 중...",
      "content_length": 106
    },
    {
      "id": "222988124417",
      "title": "2023.01.18 : 농장 현장용 실시간 알람 경광등 제어 모듈 10세트 제작",
      "date": "2023. 1. 18. 19:28",
      "content": "간만에 사무실이 제어모듈 세트 제작한다고 정신이 없다. 농민이 설정한 농장의 환경이 특정한 조건이 되면 서버에서 사용자 알람을 앱이나 웹에서 제공하는 기능과 별도로 경광등 또는 소리로 알려주는 기능을 개발했다. 그래서 샘플로 10세트 제작해서 맘꽃가든을 포함한 6개 농장에 시범 설치할 예정이다. 그래서 아침부터 제어모듈 조립한다고 사무실에 정신이 없다. 이제 센서랑 제어모듈 제작은 우리 맘대로 가능하다.",
      "content_length": 227
    },
    {
      "id": "222987972717",
      "title": "2023.01.17 : 제주 신촌 상추 재배 농가 방문",
      "date": "2023. 1. 18. 16:38",
      "content": "제주 신촌에 위치한 800평 규모의 상추 재배 농가를 방문하였다. 조대현 농장주(정림농장)께서 우리가 개발하고 있는 입식 재배 시설에 대해서 관심이 많으셔서 직접 맘꽃가든을 지인 농민들과 함께 방문한 적이 있었다. 그 때 본인 농장 초대를 해주셔서 전화를 드렸는데, 기꺼이 오라고 해서 직원들과 김녕 실증농장에서 사무실로 돌아가는 길에 방문을 하였다. 정림농장 대표이신 조대현 농장주께서는 20년 이상 상추를 재배하고 계시면서 새농민상도 수상하신 상추 재배 전문가이시다. 같이 상추 재배하고 제주시 농협에 납품하는 입장에서 동병상련의 동지애도 느끼고 20년 이상 농업기술을 개척해오신 농업 선배님으로서 존경심도 생기는 시간이었다. 특히 잎이 두껍고 품질이 좋은 여름용 상추 품종을 겨울에 재배해서 납품하는 기술을 가지고 계시는데, 존경할 뿐이다. 그리고 제주도에서 드문 층고 개폐 방식 하우스를 설치하셔서 여름 시기에도 온도 관리가 훨씬 쉽다고 하신다.\n이렇게 농업현장에서 농민들과 만나고 의견을 나누면서 더욱더 스마트팜은 \"작물재배\", \"재배시설\", \"시설제어\"가 함께 되어야 한다는 사실이다.",
      "content_length": 557
    },
    {
      "id": "222986878756",
      "title": "2023.01.17 : 공기순환팬 저전력화 연구용 하우스 구역 분리",
      "date": "2023. 1. 17. 14:15",
      "content": "시설하우스 내부 공기순환팬 구동 시간 단축을 목표를 제어알고리즘을 개발 중에 있는데, 이에 대한 실증을 위해서 구역 분리가 필요하다. 아침에 직원들과 비닐커튼으로 구역을 분리하였는데, 하우스 온도가 따뜻해 짐을 느낀다. 역시 제주도에서는 이중 보온 커튼만 있어도 난방 필요없이 작물 재배가 가능할 것 같다. 경험피셜....",
      "content_length": 180
    },
    {
      "id": "222986869115",
      "title": "2023.01.16 : 영농후계자 방문 및 입식재배 상담",
      "date": "2023. 1. 17. 14:04",
      "content": "구좌지역내 농민들의 방문이 계속 되고 있다. 오늘은 김녕리 전이장님과 영농후계자께서 방문하셔서 입식 재배에 대해서 상담을 하고 가셨다.... 김녕리 전이장님은 현재 1500평 정도의 깻잎과 상추를 재배하고 계신데, 고령화 및 좌식 농업의 문제로 점점 재배 농가가 줄고 있다고 걱정하시면서 직접 영농후계자를 데리고 오셨다. 노지형 밭작물 이랑 토경 시설 원예 사업은 위기에 있음을 현장에서 직접 느끼게 된다.",
      "content_length": 227
    },
    {
      "id": "222984235970",
      "title": "2023.01.13 : 제주농업기술원 밭작물 연구단지 노지 생육 조사용 무선인터넷 연결 방안 협의",
      "date": "2023. 1. 14. 17:42",
      "content": "제주도내 농업 시설중에 작년에 준공이 완료된 밭작물 연구단지를 방문했다. 스마트팜 연구과제를 지속적으로 함께 했던 김현수 연구사, 김동균 연구사와 실시간 노지 생육 상태를 조사하기 위해서 무선인터넷 연결 방안에 대해서 협의했다. 연구단지가 최근에 구축되어서 시설 중심부에 인터넷 라우터가 있는데, 노지 포장까지는 거리가 멀어서 PoE 모듈을 넣어서 최대한 거리를 뽑아도 될런지 판단이 되지 않았다. LTE 모뎀을 사용하면 위치에 제한을 받지 않지만, 광랜에 비해서 데이터 사용량 제한과 연결 불안정 문제가 있어서 생육 조사 시 문제가 될 가능성이 있을 것 같다. 다만 최근에 데이터 무제한 서비스도 있다고 하니깐 검토해 봐야 할 듯 하다. 노지 스마프팜은 관수제어나 생육 환경 모니터링만 하면 되는데 시설 스마트팜에 비해서 통신, 전기 인프라구축이 힘들다.",
      "content_length": 423
    },
    {
      "id": "222983119830",
      "title": "2023.01.13 : 한국농업기술진흥원 공공 R&D 지원 사업 참여 및 입식 재배 시설 견학 방문",
      "date": "2023. 1. 13. 11:17",
      "content": "2023년 새해 부터 너무 많은 일들이 있어서 블로그 글을 올릴 수 있는 상황이 되지 못했다. 이번 주에는 한국농업기술진흥원에서 진행하는 공공 R&D 지원 사업 참여 위해 전 직원들과 함께 사업 계획서 작성에 많은 시간을 보냈다. 이제 직원들과 함께 사업 계획서 작성도 하고, 이제 어엿한 스마트팜 개발 회사로 자리를 잡아 가는 것 같다. 이번 사업 참여 아이템은 관수 제어 부분이다.\n그리고 맘꽃가든이 개발한 입식 재배 시설에 관심을 가지고 있는 농가에서 방문해서 견학을 하고 싶다고 하셔서 농장 견학 가기 전에 담소를 나누는 시간을 가졌다.",
      "content_length": 304
    }
  ]
}