{
  "title": "맘꽃가든 스마트팜 구축사례 - 2022년 08월",
  "year": "2022",
  "month": "08",
  "total_cases": 4,
  "cases": [
    {
      "id": "223025527904",
      "title": "2022.08.16 : 청상추 파종 후 다단 베드 육묘 과정",
      "date": "2023. 2. 23. 19:40",
      "content": "[과거기록] 2022년 7월 초에 다단육묘베드에서 권농 청상추 파종 이후 육묘 과정을 정리해서 올리고자 한다. 현재 맘꽃가든에서는 총 5세트의 다단육묘베드가 있는데, 102구 육묘판 기준으로 32,000주 정도를 동시에 파종, 육묘할 수 있다. 물론 그런 날이 올건지? 의심하면서 시스템을 만들었지만, 점점 D-DAY는 다가오는 것 같다.\n한꺼번에 파종하기에는 코팅용 씨앗을 기준으로 한 아래의 파종기가 편하고 좋은 것 같다. 맘꽃가든은 스마트팜 연구회 회원분의 기증 및 추가 구매에 의해 총 4 종류의 파종기(105구, 128구, 162구, 200구)를 보유하고 있다. 파종기에 씨앗통, 누름판등... 약 100만원이 들었다. 농사는 다 돈이다...--;\n보광을 위해 LED를 설치했는데, 효과가 없다고는 할 수 없지만, 많이 설치해야 한다. 적어도 8줄 정도인데, 자재비가 없어서 4줄만 설치했다. 올해 추가로 구매해서 8줄을 다 채울 예정이다.\n그리고 육묘가 된 묘종을 옮기기 위한 이동 트레이도 간이로 제작했다. 한번에 6개씩 들고 갈 수 있게 만들었는데, 현재도 요긴하게 사용하고 있다.\n육묘는 수직형 다단베드로 구축하는 게 좋은 것 같다. 다만 LED를 생각보다 많이 설치해야 육묘가 잘 되고 정식 이후에 성장도 잘 된다.\n최근에 수직농업 관련 기사가 있기에 공감하는 차원에서 공유하고자 한다. 우리나라 실정도 잘 확인해 봐야 할 듯.\n‘미래의 대안’ 극찬 받던 수직농업 꺾이나…수직농업 스타트업, 기술 부족에 경영난까지 이중고\n‘미래의 대안’ 극찬 받던 수직농업 꺾이나…수직농업 스타트업, 기술 부족에 경영난까지 이중고\n수직농업은 한 때 시장에서 농업의 미래를 밝히는 등불이라며 기대를 한 몸에 받았다. 토지를 개발하지 않아 기후 변화에 적절히 대응하는 방식이며, 도시민들에게 오염되지 않은 농작물을 도시 인근에서 생산 공...\nnaver.me",
      "content_length": 927
    },
    {
      "id": "222965179477",
      "title": "2022.08.21 : 표선면 가시리 키위 재배 농가 방문",
      "date": "2022. 12. 25. 16:57",
      "content": "[과거기록] 제주농업기술원 의뢰로 표선면 가시리 키위 재배 농가를 방문.. 형제가 3000평 정도의 키위 하우스 운영중. 기존 개폐시스템을 원격제어로 바꾸려고 함. 하우스가 워낙 길어서 천창 개폐기 작동 시에 비닐이 일정하게 올라가지 않는다고 한다. 매번 체크를 한다고.. --; 하우스 설계가 잘못되어서 개폐기함도 두개로 분리 설치되어서 어떻게 통합해야? ㅎㅎ",
      "content_length": 202
    },
    {
      "id": "222962052838",
      "title": "2022.08.28 : 다단육묘베드 LED 시간 제어 방법",
      "date": "2022. 12. 21. 19:40",
      "content": "[과거기록] 총 5기의 다단육묘베드를 만들었다. 한번에 배치될 수 있는 105구 육묘판 기준으로 300개를 설치할 수 있다. 모종 개수로 따지면 31,500개를 별도의 육묘장 없이 파종할 수 있다. 맘꽃가든 입식재배 시설에 총 38,000개의 상추를 정식할 수 있기 때문에 작물을 재배하면서 한번에 육묘할 수 있는 시설로는 충분하다. 저면관수 형태라 작물 생육에도 크게 문제가 되지 않았다. 다만 다단베드의 단점으로서 일사량 부족을 보강하기 위해 식물전용 LED를 설치했다. 기존 식물공장 설치 대수에 비해서는 1/2 정도 밖에 되지 않지만 아직도 LED 가격이 비싸고(더 올라감? --;) 햇빛이 완전히 차단된 공간이 아니기 때문에 베드당 4개씩 설치했다.\n청상추, 로메인, 청경채 대부분의 엽채류 파종 및 육묘에 있어서 크게 지장은 없었다. 다만 온도가 맞지 않을 경우 발아 및 성장에 문제가 있다.\n이는 냉난방 시설 비용만 일부 추가하면 문제가 없을 것 같다.\n여기에서 LED 제어를 원격제어로 할 것인가? Timer 제어로 할것인가를 고민하다가 결국 Timer 제어로 배선을 구성했다. 물론 이전에 원격제어 테스트는 다 완료했지만 아무래도 LED On/Off 제어는 변동사항이 많지 않을 것 같아서 기존 전기 제어 Timer를 이용해서 제어했다.\n다만 베드별로 적용/여부를 결정할 2단 스위치를 달았다. 스마트팜에 있어서 제어영역은 끝이 없다. 인공지능/빅데이터를 이용하고 싶으면 높은 설치 비용을 적용하면 된다. 하지만 다단육묘베드에 냉난방 설치할 비용도 없는데, 육묘용 인공지능/빅데이터 시스템을 구성하는 것은 우리 농업 실정에 맞지 않다. 농업인이 재배하는 작물 및 시스템에 맞는 적절한 하드웨어 구성을 하는 것이 꼭 필요할 것 같다.\n3달 가까지 육묘를 계속 테스트하고 있지만 식물 LED 적용은 크게 문제가 되지 않았고, 파종 이후 암발아를 적용하거나, 육묘 시 최저/최고 온도를 유지하는 장치를 추가 설치 보완해야 할 것 같다. 내년에 상추 팔아서 돈벌며 설치할 시설이 너무 많다. ^^;",
      "content_length": 1011
    },
    {
      "id": "222955829565",
      "title": "2022.08.27 : 하절기 청상추 파종 및 발아",
      "date": "2022. 12. 14. 22:02",
      "content": "[과거기록] 지난 여름 하절기 청상추 파종 및 육묘 베드 발아 기록",
      "content_length": 37
    }
  ]
}