{
  "title": "맘꽃가든 스마트팜 구축사례 - 2023년 12월",
  "year": "2023",
  "month": "12",
  "total_cases": 5,
  "cases": [
    {
      "id": "223308952635",
      "title": "2023.12.31 : 2023년 마지막 가족 여행, 거제 정글짐",
      "date": "2024. 1. 1. 10:25",
      "content": "간만에 가족들과 부산 본가를 방문해서 가족 여행을 다녀왔다. 농사만 한다고 맨날 일할 수 없어서 놀러왔는데, 결국은 거제시농업기술센터를 방문했다. 여기에 요즘 핫한 거제정글짐이 있다. 일본 오사카 여행 때 봤던 식물원 보다 구성이나 운영이 훨씬 더 잘 되고 있다.\n시설하우스 온도 관리 측면에서 내부 온도를 확인해 보니 최저 18, 최대 21도 내에서 관리하는 걸 보고 대단함을 느낀다. 개폐는 상부 천창이랑 하부 측창 개폐 시스템을 갖추고 있었다..\n하부에 있는 귀뚜라미 공조팬... 여기로 따뜻한 바람이 올라온다. ㅎㅎ 나도 이런 시스템 깔고 싶다.\n근래에 방문한 기관 시설 중에 가장 관리도 잘 되는 곳이다. 제주도에서도 공공기관이 이런 시설을 운영하면 좋을 듯..",
      "content_length": 375
    },
    {
      "id": "223282186148",
      "title": "2023.12.03 : 작물 재배와 입식베드 추가 설치",
      "date": "2023. 12. 4. 7:33",
      "content": "주중은 스마트팜 개발 및 설치를 진행하고, 주말에는 농장에서 상추 재배 관련 작업을 진행하고 있다. 확실히 야간온도가 떨어지고 나서는 작물 성장 속도가 더뎌지고 있다. 수확량이 많지 않을 것 같다. 이중커튼과 난방을 해야하는데, 시설 비용이 없어서 올해는 이렇게 지나가야 할 것 같다.\n새로 정식할 베드를 정리하는 작업을 수행했다.\n동부디지털농업연구회 회원이신 임병준 사장님 댁에 테스트로 입식베드를 추가 설치하고 재배 세팅을 준비하고 있다.",
      "content_length": 247
    },
    {
      "id": "223282184228",
      "title": "2023.12.02 : 시범포장 시설 내 전기선 인입 작업",
      "date": "2023. 12. 4. 7:28",
      "content": "제주농업기술원 시범 포장 중에 설치가 오래되고 전기 제어 방식으로 설치된 시설들은 전기선 인입 작업이 쉽지 않다. 특히 외부에 설치된 시설 내부에 환경 측정 장비라도 넣으려면 외부 제어함에서 전기를 공급해야 하는데, 기존 전기 배선 라인을 알면 쉽게 작업이 가능하지만, 최초 설치 도면을 확인하는 것이 쉽지가 않아서 하나씩 하나씩 요비선을 넣어서 시설하우스 내부와 외부의 연결상태를 확인해야 한다.\n또다른 하우스에 우성하이텍 개폐제어 설비가 구축되어 있어서 개폐기 라인과 열풍기 라인, 접지 등이 어떻게 내부랑 연결되는지 확인하는데 어려움을 겪었다.\n그리고 일부 장비는 노지 관수로 추가 설치가 필요해서 외부에 지지대를 세우고 제어 장비를 설치했다. 노지 환경은 시설 하우스보다 훨씬 열악한 환경이기에 설치하는 것이 쉽지 않다.",
      "content_length": 407
    },
    {
      "id": "223307289871",
      "title": "2023.12.29 : 제주농업기술원 스마트팜 협업 시스템 개발 완료",
      "date": "2023. 12. 30. 10:45",
      "content": "3년간의 공동 연구 과정을 통해 드디어 제주형 스마트제어 및 데이터 통합관리시스템 구축 개발을 완료하였다. 제주형 스마트팜 기술 확보를 목표로 함께 해준 제주농업기술원 연구자, 동부디지털농업연구회 회원님들, 제주아이씨티협동조합 조합원들에게 감사드린다. 이제 2024년도 다시 시스템 안정화 및 실증에 최선을 다하고자 한다. 제주도가 스마트팜 기술의 선두지역이 될 수 있도록 홧팅!!!!!",
      "content_length": 216
    },
    {
      "id": "223300714446",
      "title": "2023.12.15 : 최다 인원 60여명 농장 방문",
      "date": "2023. 12. 22. 18:49",
      "content": "제주도로 단체로 견학로 농업인 중에 최대 인원이 맘꽃가든을 방문했다. 60여명이 방문해서 정말 정신이 없었지만, 많은 얘기를 나눌 수 있었다.\n농장 관리를 맡고 있는 백대표가 청년농업인 대표로서 인사를 하고 있다.",
      "content_length": 119
    }
  ]
}