{
  "title": "맘꽃가든 스마트팜 구축사례 - 2022년 11월",
  "year": "2022",
  "month": "11",
  "total_cases": 26,
  "cases": [
    {
      "id": "222923608045",
      "title": "2022.11.08 : 연구회 농가 기상대 설치",
      "date": "2022. 11. 8. 20:55",
      "content": "연구회 회원이신 \"제주로의농부여행\" 농장에 기상대 설치하다. 이제 기상대 설치는 스마트팜 기자재 설치 중에 제일 쉬운 듯 하다. 제품은 Ambient weather WS-2902C 제품이다. 2019년 부터 구매해서 맘꽃가든 농장에 2대 설치해서 검정을 진행했다. 제주도 지역에는 지인들의 부탁으로 15대 이상 설치를 진행했는데, 한대만 외부기상 온도 측정 이상으로 문제가 되었다. 지금 개발자 API도 제공해서 농장별 기상대 데이터 취득하는데 최고인듯 하다. 이 데이터로 10분마다 동기화 프로세스를 개발해서 \"슬라워\"로 데이터를 받고 있다. 빅데이터 수집은 쉬운데 어떻게 쓸지는 고민해야 한다.\n앱도 잘되고, 데이터 취합도 잘되고, 신뢰성도 높고 가격도 저렴하다. 연구 활동에 있어서 기상대 설치가 잘되니깐 맘이 즐겁다.\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #제주로의농부여행 #슬라워 #AWS #WS-2902C #빅데이터",
      "content_length": 495
    },
    {
      "id": "222923600646",
      "title": "2022.11.08 : 원격/수동 전환모듈 설치(스마트팜 표준 검정 이유)",
      "date": "2022. 11. 8. 20:46",
      "content": "콩깍지 농원에 클라우드형 스마트팜 \"슬라워\"와 연동된 순환팬 제어 시스템을 설치하고 무사히 테스트를 마쳤다.\n그런데 기존에 쓰고 있던 제품을 버릴 수는 없을까 같아서 원격제어장치가 작동되지 않을 때 사용할 수 있도록 원격/수동 전환 모듈을\n설치하고자 하는데, 고민이 많다. 기존 제품은 5채널 릴레이가 분리되어 설치되어 있다. 농장주 이신 김성훈 형님은 굳이 5채널을\n따로 돌리지 않고 한꺼번에 구동한다고 하셔서 우리는 1채널로 구성을 했는데 어떻게 해야 되나 싶다.\n1채널 원격과 5채널 수동을 전환 모듈로 설치하고자 하니깐 고민이 많다.\n농업현장에 스마트팜 보급에 있어서 가장 큰 문제점은 농장마다 상황이 다르다는 것!!!!!!\n냉장고 처럼 220V 전원에 연결만 해서 사용할 수 있다면 얼마나 좋을까?\n아마도 불가능하다. 그래서 스마트팜 표준 검정이 필수가 아닐지????\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #콩깍지농원 #슬라워 #순환팬제어",
      "content_length": 507
    },
    {
      "id": "222921115879",
      "title": "2022.11.03 : 서귀포 남원 스마트팜 설치",
      "date": "2022. 11. 6. 9:00",
      "content": "제주 ICT 협동조합 조합장 오길원 대표의 배또롱 농장과 김석재 대표 농장에 수분부족량을 측정할 수 있는 온습도 측정 센서와 순환팬 제어 모듈을 설치함.\n다들 스마트팜에 베테랑 분들이라서 설치도 쉽고, 테스트도 쉽게 마무리 되었다.\n하우스 감귤 재배 농가인 김석재 대표 농장, 추석 전후로 수확이 완료되어서 감귤이 없음 ^^;\n백엽상과 연결된 온습도 환경 측정 센서함\n측정 테스트 및 분전함 설치를 함께 하니, 쉽게 업무가 마무리 된다. 스마트팜 기술의 50%는 전기를 아는 것...\n#제주 #스마트팜 #제주농업 #고설배드 #입식재배 #ICT #원격제어 #클라우드 #자립형스마트팜 #제주ICT협동조합 #수분부족량 #온습도 #온습도센서 #순환팬 #순환팬제어모듈",
      "content_length": 368
    },
    {
      "id": "222942592064",
      "title": "2022.11.18 : 제주ICT협동조합 순환팬 자동제어 전환 스위치 설치(추가작업필요)",
      "date": "2022. 11. 30. 21:23",
      "content": "공공기상데이터를 기반으로 순환팬 운영 스케쥴러를 생성/제어하는 프로그램 개발이 거의 완료되어 제주ICT협동조합 오길원 조합장 농장에 설치하였다. 하지만 기존에 순환팬 제어 시스템과 연동하는 문제로 전환 스위치를 설치해야 하는데, 딱 맘에 드는 연결이 되지 못하고 있다.\n기존 제어함에서 보면 단상 MC에 기존 스마트팜 릴레이 신호와 수동 스위치 조작 신호 전환 스위치가 연결되어 있다. 수동으로 전환되면 온도센서에 의해서 작동된다. 여기에 슬라워 시스템 제어까지 연결하면 3가지 경우가 성립해서 4단 스위치를 달아야 하는데, 어떻게 해야 되나 원점에서 다시 고민하고 있다. 단상MC전원을 제어할건지, 단상MC 제어 전원을 제어할건지...\n항상 기존 시스템 구동은 살리면서 슬라워 시스템을 연동시키는게 제일 문제다. 그렇다고 기존 시스템을 없애고 하기도 그렇고...\n스마트팜도 전환기 시대다.. 전환기 시대에 있는 사람이 제일 어려운듯...",
      "content_length": 469
    },
    {
      "id": "222942589453",
      "title": "2022.11.17 : 위험하게 시설하우스 외부에 노출된채로 설치된 개폐기/순환팬 제어함",
      "date": "2022. 11. 30. 21:20",
      "content": "제주도에서 스마트팜 기술을 개발/설치하면서 여러가지 현장을 봤지만 이렇게 아예 시설하우스 외부에 노출된 채로 개폐기/순환팬 제어함을 설치한 것은 처음 봤다. ^^;\n스마트팜 기술을 개발하면서 전문가들이 매번 나오는 지적사항 중에 하나가 플라스틱 분전함 대신 단단한 철제함을 사용해야 되고, 전용실이 있어야 된다고 했는데, 아마도 이 모습을 보면 다들 한마디 할 듯하다.\n스마트팜 설치에 있어서 전기 안전은 정말 중요하다. 제발 이 농장주 분이 전기에 대해서 잘 아시고 관리를 잘 하시는 분이었으면 좋겠다.\n농사를 짓다보면 자재 관리도 하기 힘들만큼 시간이 없다는 것은 알지만, 이렇게 외부에 설치하는 것은 경계해야 될 것 같다.",
      "content_length": 351
    },
    {
      "id": "222941480691",
      "title": "2022.11.29 : 입식 재배 시설 확장 천막지 설치",
      "date": "2022. 11. 29. 17:35",
      "content": "약 250평 규모의 추가 입식재배시설 확장 공사가 진행되고 있다. 자재가격이 많이 올라서 현재는 기존에 가지고 있었던 파이프 자재를 이용해서 조립 작업을 하고 있다. 내년 2월 확장 완료를 목표로 진행하고 있는데, 만약에 작업이 다 완료되면 아마도 21개 구역에서 로메인과 청상추 재배가 이루어질 것 같다. 그렇게 되면 700평 규모의 고설재배베드 면적의 효과가 나올 것 같다.\n매일 4Kg 상추 최소 20박스, 최대 30박스 출하를 목표로 재배 공간 구축을 진행하고 있다. 현재까지 재배 실증을 통해서 충분히 가능할 것으로 판단된다. 내년 여름을 기대한다.\n오늘은 고정부에 천막지를 설치하였다. 천막지는 시설하우스 설치시 사용되는 천막지다. 기본적으로 베드의 길이가 12m 기준이라서 8개 베드를 구성하는데 사용될 수 있다.\n김팀장과 함께 천막지를 올리고 15A 파이프에 클립을 꽂아서 설치 완료\n하부 천막지 설치는 물이 잘 빠질수 있도록 하나씩 펼치면서 끼운다.\n이렇게 또 하나의 작업을 마친다.",
      "content_length": 503
    },
    {
      "id": "222940648245",
      "title": "2022.11.28 : 한국생활개선강진군연합회 & 강진군농업기술센터 단체 방문",
      "date": "2022. 11. 28. 20:04",
      "content": "강진군농업기술센터 분들과 한국생활개선강진군연합회 여성회원 30여명이 오늘 맘꽃가든을 방문했다. 강진군수 사모님도 직접 오셔서 맘꽃가든이 진행하고 있는 작물재배, 재배시설, 시설제어 연구/개발 활동을 견학하셨다. 특히 다른 단체들보다 입식 재배 시설과 상추 재배에 대해서 관심을 많이 가져주시고 질문도 많이 해주셔서 유익한 시간이었다. 특히 마지막에 다들 꼭 성공하시기를 바란다고 하셨다.\n클라우드형 스마트팜 시험장비를 보여드렸는데, 진진한 눈빛으로 보시고 질문도 많이 하셔서 정말 즐거운 시간이었다.\n이 많은 인원들이 김녕에 와서 맘꽃가든을 견학했다는 것에 뿌듯함을 느낀다.\n강진군 농업기술센터 박민철 인력육성팀장님께서 간단하게 맘꽃가든이 걸어온 길에 대해서 설명을 해주셨다. 다들 서서 상추 재배하는 모습에 신기해 하신다.\n오늘은 맘꽃가든이 여성 농민으로 가득찬 날이다. 점점 더 많은 사람들이 관심을 가져주시는 그날을 위해서...",
      "content_length": 466
    },
    {
      "id": "222939506962",
      "title": "2022.11.27 : 입식재배시설 확장 -> 가변부 조립, 용접부 그라인드, 방청제 살포",
      "date": "2022. 11. 27. 18:54",
      "content": "입식재배시설 작업을 시작해서 하나씩 작업을 완료해 가고 있다. 고정부 파이프와 각관 조립을 완료하고 용접부 그라인드 작업을 김팀장이 진행하고 있다. 청상추 수확, 주문 받고 배달/판매까지 하는 상황이라 쉽지가 않다. 그래서 아예 일요일에 나와서 작업을 하고 있다.\n250평 규모의 확장되는 입식재배시설 부문..각종 자재가 바닥에 널려있다. 하나씩 조립하다 보면 정리가 될 것 같다.\n가변부 조립을 하고 있다. 가변부 조립도 쉽게 할 수 있는 부품을 제작했는데, 아직도 부족하다. 판금 또는 프레스 금형을 제작해야 할 것 같은데, 개발비용이 부족하다. 몇가지 부품만 추가 설계, 제작을 하게 되면 농민들도 쉽게 조립 가능한 입식재배시설이 될 수 있는데, 아직 제작비용이 부족해서 진행을 못하고 있다.\n기존 시설하우스 자재와 맘꽃가든에서 개발한 자재들을 조립해서 가변부 프레임 조립을 완료하고 있다.\n가변부 조립은 용접을 100% 제거하고 조립피스로 제작이 가능하도록 만들었다. 이제 하나씩 진행하면 될 듯.",
      "content_length": 506
    },
    {
      "id": "222938153811",
      "title": "2022.11.25 : 제주농업기술원 김현수 연구사, 김동균 연구사 방문",
      "date": "2022. 11. 25. 18:58",
      "content": "",
      "content_length": 0
    },
    {
      "id": "222936319179",
      "title": "2022.11.23 : 외부기상대 설치 및 자동/수동 전환 모듈 개선 작업",
      "date": "2022. 11. 23. 16:49",
      "content": "제주ICT협동조합 김석재 회원 농가에 전달했던 외부기상대가 무사히 설치되었다는 연락을 받았다. 항상 시설하우스 물홈 지지대 설치를 했는데, 김석재 사장은 직접 안테나 지지대를 구입해서 외부 기상대 설치를 하고 단말기 설정도 완료했다.\n앞서가는 스마트팜 농업인의 모습을 보여줘서 대단하다는 생각이 든다. 현재의 농업인은 백가지 기술을 가진 백공이 되어야 한다. 농사를 잘 짓는 것은 기본이고 각종 스마트팜 기자재를 잘 다루고 설정할 수 있어야 한다. 그런 의미에서 보면 스마트팜 연구회 활성화 및 참여는 꼭 필요하다.\n공기순환팬 제어를 위해서 설치한 구동기 통신 노드 옆에 자동/수동 전환 모듈도 김석재 사장이 직접 구성해서 설치했다.\n나보고 걱정하지 말고 가라고 했는데, 걱정하지 않아도 될 정도로 구성해 줘서 너무 기분이 좋다.\n간단한 스위치 조작으로 구동기 통신 모듈이 작동 되지 않을 때 수동으로 조작이 가능해 졌다.\n다양한 현장에서의 실증 및 적용은 스마트팜 개발의 필수요건이다.",
      "content_length": 496
    },
    {
      "id": "222936317670",
      "title": "2022.11.23 : 농정원 농업인 교육사업 성과 공유 대회",
      "date": "2022. 11. 23. 16:48",
      "content": "2022년 농정원에서 진행했던 농업인 교육사업 성과 교육대회에 우수사례로 선정되어서 아침부터 뱅기타고 제주에서 세종시까지 출장을 갔다.\n전국 150여개의 교육활동 중에서 13개 우수 사례로 선정되어 농정원상을 확보하였는데, 농림수산식품부 장관상을 주는 3개팀 선정 대회에\n참여를 하게 되었다. 10분 정도의 발표이지만 2022년 한해 동안 열심히 활동했던 동부자립형스마트팜연구회 회원을 대표해서 발표하는 자리라서 긴장된 마음으로 참여를 했다.\n그런데 도착해서 경쟁 교육 단체들을 보니, 쟁쟁한 곳이 한 두군데가 아니다. 정말 다들 열심히 활동을 하고 있다. 특히 청년 농업인들의 활동이 눈에 뛴다. 잘 발표를 하고 왔는데, 최종 결과가 궁금해 진다.",
      "content_length": 363
    },
    {
      "id": "222936316611",
      "title": "2022.11.23 : 청상추, 로메인 9박스 수확 및 납품",
      "date": "2022. 11. 23. 16:47",
      "content": "세종시에 발표를 위해 출장을 가 있는 동안에, 직원들이 청상추, 로메인 9박스를 수확/포장하였다. 납품은 농협공판장과 음식점 등에 납품될 예정이다. 요즈음 계속 날씨가 좋아서 상추, 로메인 가격이 좋지 않다. 수확한 기쁨도 잠시,,, 실망이 더 크다.\n어제 방문하셨던 분의 말씀이 아직 가슴에 남아있다. 꾸준하게 재배, 수확, 판매해야 한다고....\n일희일비하지 말아야 한다고...\n농협공판장에도 출하했다. 가격은 ???? ^^;\n박대리가 지속적으로 구매해 주시는 음식점에 한박스를 두고 왔다. 항상 감사한 마음으로 전달해 드리고 있다.",
      "content_length": 300
    },
    {
      "id": "222935336193",
      "title": "2022.11.22 : 한국방송통신대학교 농학과 농장 견학",
      "date": "2022. 11. 22. 15:32",
      "content": "금일 오후에 한국방송통신대학교 농학과 학우분들이 농장 견학을 오셨다. 재학중인 학생분들과 이를 인솔하는 대학원 박사, 석사, 소장님이 같이 방문하셔서 농업에 관한 얘기를 나눴다. 농학과를 졸업한 선배로서 후배분들한테 좋은 모습을 보이고 싶은데 아직도 고군분투 중인 모습만을 보여서 죄송한 맘이 든다. 그래도 스마트팜에 있어서 작물재배, 재배시설, 시설제어가 함께 되어야 함을 느끼게 해 준 시간인 것 같아서 좋았다.\n맘꽃가든에서 개발한 슬라워 시스템의 구조 및 특징을 설명드렸다. 아두이노와 같은 교육용 수준이 아니라 실제 농업현장에서 사용되는 센서와 농업장치를 보여드리고 제어하는 것을 알려드렸다.\n농업을 단순한 1차산업으로 생각하는 시기는 지났다.\n이제 농업은 6차산업으로 생각하는 시기도 지났다. 농업 생산, 가공, 디지털 제어를 함께 할 수 있어야 한다.",
      "content_length": 426
    },
    {
      "id": "222934002021",
      "title": "2022.11.19 : 로메인 정식, 스마트팜 시스템 개선, 청상추 폐기",
      "date": "2022. 11. 21. 6:44",
      "content": "맘꽃가든이 지향하는 작물재배와 스마트팜 개발을 함께 수행하는 날이다. ㅎㅎ;\n드디어 기존에 있던 청상추를 폐기하고 로메인 정식을 했다. 김팀장이 열심히 정식하고 있다.\n옆밭에서 일하고 계시는 어머니들의 모습을 보면서 농업 질환의 90%가 근골격계 질환이라는 이유를 알 것 같다.\n이 와중에 박대리가 열심히 블로그 수정도 하고 최근에 개발하고 있는 플러터 기반 웹시스템도 같이 확인했다.\n두개를 동시에 할려고 하는데, 쉽지가 같다.\n버려진 청상추들이다. 옆 밭에서 양파 심는 일을 하시는 어머니들이 우리 농장 구경을 하고 싶다고 하신다.\n언제든지 오셔서 보시라고 했는데, 다들 반장 눈치를 보시고 못오신다. 점심 시간 때라도 보셨는지 모르겠다.",
      "content_length": 359
    },
    {
      "id": "222934608714",
      "title": "[공지] 2022.11.21 : 제주ICT협동조합 회원 김석재 농장 순환팬 원격 제어 테스트",
      "date": "2022. 11. 21. 19:19",
      "content": "제주ICT협동조합 전기강사이신 김석재 회원 농장에 순환팬 원격제어 시스템을 설치하다. 공공기상데이터와 연동해서 순환팬 가동 시간을\n사용자 설정 및 기상정보에 따라 작동 스케쥴이 일단위로 갱신되는 로직을 개발 적용하였다.\n단순하게 원격 제어 및 환경 측정은 이미 끝난 상태라 인공지능까지는 아니더라도 무상으로 제공되는 공공기상데이터를 활용해서 순환팬 가동 시간을 조금이라도 줄일 수 있는 방법을 찾아서 현장 실증이 진행중이다.\n제주ICT협동조합 회원농가에서 작업할 때는 항상 맘이 편하다. 기본적인 스마트팜 설치 및 작동 구조에 대한 이해가 깊고, 전기 및 시설 설비에 대해서는 나보다 실력이 좋아서 작업 시간도 빠르고 안심하고 테스트 검정이 가능하다.\n듬직한 김석재 회원의 뒷모습.. 제주도 스마트팜 관련 전기 분야에 있어서는 제주도 최고 베테랑이고, 외부 강의도 자주 나가시는 프로농사꾼이다.\n스마트팜 현장 설치에 있어서 공구 90%가 전기 관련 공구이며, 나머지는 프로그램 업로드 및 테스트를 위한 노트북 등이 있다.\n순환팬 원격 제어 테스트\n재생\n20\n좋아요\n0\n00:23\n\n접기/펴기\n김석재 농장 순환팬 원격 제어 테스트",
      "content_length": 575
    },
    {
      "id": "222932252291",
      "title": "2022.11.18 : 청상추 폐기하고 로메인 상추 정식",
      "date": "2022. 11. 18. 18:36",
      "content": "올해 8월말에 파종하고 재배를 시작했던 권농 청상추를 폐기하고 로메인 상추 정식을 했다.\n로메인 상추는 10월 초경에 파종을 했는데, 아래처럼 건강하게 잘 자라주었다.\n항상 작물은 햇빛을 받아야한다. 햇빛을 받지 못한 육묘는 힘이 없다.\n다구형 포트에서 잘 키웠던 청상추 뿌리 모습, 특히 흰색 비닐을 덮었던 곳은 뿌리의 발육 상태가 굉장히 좋다.\n정리하고 난 이후의 베드 상태, 아쉽다.",
      "content_length": 217
    },
    {
      "id": "222930491965",
      "title": "2022.11.16 : 한국농업기술진흥원 지원 우수사례 연구회 인터뷰 및 촬영",
      "date": "2022. 11. 16. 19:04",
      "content": "한국농업기술진흥원에서 추진하는 스마트팜 표준화 사업을 추진하면서 실증농가로 활동했던 연구회 회원분들과 인터뷰 및 촬영을 했다. 우수사례로 선정되어서 청장상 후보에도 올랐는데, 좋은 기회가 될 것 같다.\n김성훈, 강경옥(콩깍지농원), 우시영, 임병준(황금콩밭), 유도균(제주로의농부여행), 좌석훈(유인농원), 이경환, 오동규(채소점빵) 참석한\n모든 분들께 감사드린다.\n무엇보다도 부족한 맘꽃가든을 믿고 함께 해주시는 연구회 분들에게 감사드린다. 농민은 일이 너무 많고 힘들다.\n청장년 세대의 지속적인 농업활동이 이어지기 위해서는 실제 농민들의 삶이 바뀔 수 있도록 기술이 바뀌어야 한다.\n이전 회장님으로 활동하신 임병준 사장님이 인터뷰를 하고 계신다. 항상 솔선수범해서 공부하시고 노력해 주신다. 오늘도 수확하는 와중에 함께 해주셨다. 그래도 카메라 앞이라 긴장을 많이 하신 듯하다. 나도 인터뷰를 했지만 방송 출연은 옆에서 지켜보는 게 제일 좋다.\n실증 농장을 제공해주신 김성훈 형님... 항상 새로운 시도에 주저함이 없으시다.\n우리의 든든한 젊은 청년 농부, 우시영 사장.. 왜소해 보이는 모습의 반전은 추진력 짱이고 냉철한 자세를 항상 가지고 있다.\n주변에서 기대를 많이 하는 청년 농부이다.",
      "content_length": 613
    },
    {
      "id": "222928983645",
      "title": "2022.11.15 : 맘꽃가든 회사 소개서 제작 (한국농업기술진흥원 지원)",
      "date": "2022. 11. 15. 6:55",
      "content": "한국농업기술진흥원의 지원을 받아서 청장년 세대의 지속적인 농업 활동을 위해서 입식 재배 시설 기반 클라우드형 스마트팜을 개발하고 있는 맘꽃가든의 회사 소개서를 제작하다.\n8페이지에 걸쳐서 약 3년 동안 만들어 왔던 기술들을 소개하는 자료를 만들었다.\n항상 뭔가를 제작하면 누군가에게 평가를 받는다. 이번 회사 소개서에 대해서도 이런 얘기, 저런 얘기를 듣지만 세상에 없는 뭔가를 만든다는 창조의 기쁨은 항상 존재한다.\n끊임없이 도전하다보면 대한민국 농업 발전에 하나의 흔적은 남길 수 있을 듯하다.\nNext image",
      "content_length": 289
    },
    {
      "id": "222929637941",
      "title": "2022.11.15 : 제주도 IoT 개발자 연대 모임(?)",
      "date": "2022. 11. 15. 20:43",
      "content": "제주감귤박람회에서 우연한 만남을 가지게 된 엠솔루션의 김성훈 이사님 사무실을 방문하게 되었다. 3X6미터 컨테이너에서 정말 많은 일들을 하고 계셨다. IoT장치 개발에 필요한 모든 기자재와 솔루션을 다 가지고 계신 것 같다.\n기본적인 하드웨어 및 펌웨어 개발뿐만 아니라 3D CAD 기반의 제품 설계까지 가능하신 분을 제주도에서 만나고 같이 교류할 수 있음에 큰 행복을 느낀다. 항상 제주에 있으면서 인프라와 리소스 부족을 느낄 때 육지로 가고 싶다는 생각을 했는데, 좀 더 일찍 이런 분을 만나지 못했을까 하는 아쉬움을 가지게 된다.\n누군가에게 어지러운 창고일지 모르나, 나처럼 뼈속까지 엔지니어의 피가 흐르는 사람에게는 열정의 장소로 보인다. 기념사진 촬영까지 하게 되었다.\n오늘은 직접 맘꽃가든도 방문해 주셔서 스마트팜 개발 현황도 얘기드리고, 작물 재배 등의 어려움도 설명드렸다.\n가시는 글에 청상추 한묶음도 챙겨드렸는데, 이런 것들이 제주도에 있는 개발자들만이 나눌 수 있는 기쁨이 아닐까 한다.",
      "content_length": 506
    },
    {
      "id": "222928079892",
      "title": "2022.11.13 : 로메인 육묘 광합성 활동 증대",
      "date": "2022. 11. 14. 9:06",
      "content": "작물 재배에 있어서 시작은 파종과 육묘이다. 파종은 파종시기와 발아온도를 맞추면 되지지만 육묘 과정은 생각보다 시간이 길다.\n육묘가 잘 된 개체는 추후 정식이후에도 품질이 상당히 좋다. 그렇기에 육묘에도 신경을 많이 써야 한다.\n그렇지만 육묘를 위해서 넓은 바닥에 두고 관리하게 되면 귀뚜라미의 표적이 되어서 제대로 남아나는 개체가 없다.\n그렇기에 나는 다단육묘베드를 만들어서 물주고 광은 식물 성장 LED를 통해서 보광을 하는데, 아무래도 직접 받은 햇빛의 능력을\n당해낼 수가 없다. 그래서 이번에 다단육묘베드에 있는 로메인 묘종을 밖으로 가지고 나와서 햇빛을 받게 두었다.\n햇빛을 받은 로메인 묘종이 싱그롭다. 파종한 지 2주 정도가 지난 상태이다.\n그리고 다시 날씨가 추워지고 비가 계속 와서 다단육묘베드로 가져왔다. 그래도 햇빛을 받은 개체는 입의 크기나 상태가\n다르다. 힘들겠지만 정식전에는 꼭 햇빛에 노출하는 것이 필요할 듯...\n정식할 자리가 없어서 아직도 다단 육묘 베드에 있는 청상추... 어디에라도 입양을 보내야 할듯.\n파종한 지 10일 정도 지난 로메인 묘종\n파종한지 4일 정도 지난 로메인 묘종... 항상 어린 새끼들을 보는 것은 행복이다. 사진에는 잘 표현되지 않았지만,\n모든 생명을 키우는 재미는 직접 경험해 보는 것에 있다.",
      "content_length": 644
    },
    {
      "id": "222928647285",
      "title": "2022.11.14 : 제주ICT협동조합 스마트 온실 모형 최종 보강 작업",
      "date": "2022. 11. 14. 19:29",
      "content": "제주감귤박람회 전시에 사용되었던 스마트 온실 모형을 제주농업기술원에 납품하기 위해서 제주ICT협동조합 조합원들이 열심히 최종 보강 작업을\n수행하고 있다. 다들 농업인임에도 불구하고 손재주, 열정, 능력이 대단하다. 옆에서 보고 있는데도 잠시도 쉬지 않고 작업하는 모습에서 배울점이\n많다. 특히 핵심 멤버들은 변함이 없다. ^^;\n다들 농사를 직접 짓고, 스마트팜 자재를 다루어 본 경험이 있어서 모형을 만드는데 있어서 표현이 정확하고 구체적이다.\n최종 전시를 위해서 냉각팬까지 직접 수작업으로 설치하고 있다.",
      "content_length": 284
    },
    {
      "id": "222927254598",
      "title": "2022.11.13 : 초보자는 로메인 수확, 숙련자는 청상추 수확",
      "date": "2022. 11. 13. 9:06",
      "content": "일요일 아침부터 로메인, 청상추 수확이 시작되었다. 상추는 매일 매일 잎 수확을 하지 않으면 비상품이 발생한다.\n공판장 판매 가격을 잘못 생각해서 청상추를 많이 심었는데, 현재 청상추 가격이 더 낮다.\n그렇다고 수확을 하지 않으면 안되니깐 간만에 제주도 방문한 처형이 일을 도와주었다.\n처형은 초보자라 로메인 수확하고, 숙련자이신 장모님은 청상추 수확을 진행했다.\n입식재배시설 편하게 일을 하시는데, 손에 흙이 묻어서 작업하기가 쉽지 않다고 하신다.\n숙련자이신 장모님이 초보자인 처형한테 수확한 로메인 담는 방법을 가르쳐 주고 계신다.\n푸른 초원에서 일하는 것 같아서 기분이 좋다고 하시는 처형... 돈 버는 것 보다 이렇게 시설을 만든다고 고생했다고\n격려해 주셔서 기분이 좋다.",
      "content_length": 380
    },
    {
      "id": "222927502110",
      "title": "2022.11.14 : 제주감귤박람회 제품 전시 3일차",
      "date": "2022. 11. 13. 16:51",
      "content": "제주ICT협동조합과 함께 제주감귤박람회 제품 전시 3일차가 되었다. 많은 농민들을 만나서 얘기를 나누지만 스마트팜에 관심을 가지시는 분들은\n주로 청장년층이시다.\n농업에 있어서 지속적인 농업 경영을 위해서는 청장년의 농업 경영 활동 참여가 필수적이다. 그런데 방문객 중에서 고령층 70%이고, 청장년 층은 10%도 안 되는 것 같다.\n그나마 방문하는 가족단위의 체험객이 전부다.\n그래도 농업인과 함께 대화하고 그분들에게 내가 만든 제품을 설명드리고 정보를 나눌 수 있다는 것이 좋다.\n제주ICT협동조합 김영종 조합원이 판매/설치하는 자동관수기 제품이다. 타이머 기반을 작동하는 제품이고 서귀포 지역에\n많이 설치한 신뢰성있는 제품이다. 이런 제품을 잘 사용하는 것도 필요하다. 다만 핸드폰 기반의 원격제어를 원하는 사용자가\n늘다보니 고민이 많다.\n제주도 청장년 농업인의 스마트팜 보급/확산을 위해 노력하고 있는 오길원 조합장이 열심히 스마트팜에 대해서\n설명하고 있다. 이번 제주ICT협동조합은 제주 표준 시설하우스 모형에 스마트팜을 구현해서 전시하였는데,\n반응이 엄청 좋다.\n농민에게 원격으로 시설하우스 구동 기기 제어 방법을 설명하고 있는 오길원 조합장!! 농사를 직접 지으면서\n이러한 연구회를 꾸려가는 모습이 정말 대단하다.",
      "content_length": 629
    },
    {
      "id": "222927398622",
      "title": "2022.11.12 : 입식 재배 시설 확장 및 부품 개선",
      "date": "2022. 11. 13. 14:06",
      "content": "입식 재배 시설 확장 작업을 시작하다. 이를 위해서 부품 개선 작업이 필요해서 부산에 있는 만성코퍼레이션을 방문하였다.\n시설하우스 부품 제작 전문 업체인 만성코퍼레이션의 박정훈 대표님을 만나서 입식 재배 시설 조립 부품 개선 방법에 대해서\n협의했다. 근래 기술적인 협의에 있어서 이렇게 친절하게 응대해 주신 분이 있으시니깐 힘이 난다.\n인간의 창조 및 개선 욕구 열정은 어딜 가나 대단한 것 같다.\n시설 확장 작업을 시작하기 위해서 임팩을 다시 들었다. 두달 내에 완성을 목표로 진행!!!!\n그래도 슬리퍼 신고 작업하니깐 발은 편하다. 발이 갑갑하고 땀 나는게 제일 싫다.. --; 농사 지으면서 느끼는 낙 중에\n하나가 옷이랑 신발을 내 맘대로 입을 수 있다는 거!!!",
      "content_length": 374
    },
    {
      "id": "222926545349",
      "title": "2022.11.12 : 제주ICT협동조합 박람회 공동 전시",
      "date": "2022. 11. 12. 6:24",
      "content": "제주ICT협동조합과 함께 제주감귤박람회 공동 전시 2일차에 참석했다. 오길원조합장이 만들어주신 배너에 작품 전시를 함께 하니깐\n이제 본격적으로 제품을 팔아야 하나 싶기도 하다. 많은 실전 테스트를 하면서 신뢰성을 높였지만 가야될 길이 멀다.\n그리고 드디어 회사 소개서가 나왔따. 200부 제작을 했는데, 생각보다 잘 나온 것 같다.\n입식재배시설 관련 자료도 잘 정리해서 넣었다.",
      "content_length": 211
    },
    {
      "id": "222925420322",
      "title": "2022.11.10 : 저푸른 초원위에 청상추가 끝없이",
      "date": "2022. 11. 10. 20:25",
      "content": "가변형 입식 재배 시설에서 청상추가 끝없이 자라고 있다. 현재 제주도 날씨가 상추 재배하기에 최적의 환경이라 큰 문제가 없이 잘 자라고 있다.\n그런데 너무 잘 자라서 문제다. 상추의 특성상 끊임없이 상추를 따줘야 하는데, 인력 수급이 문제다.\n그래서 아무래도 점점 로메인 상추 비중을 높여야 할 것 같다.\n로메인 상추 80% : 청상추 20% 정도... 청경채도 잘 자라고 있는데, 가격이 너무 낮다.\n먼곳에서 온 김승구 팀장이 농산물 가격이 너무 낮다고 안타까워 한다. 현재의 농산물 유통 체계 등을 봤을 때\n농민의 삶이 나아질 수 있을지 모르겠다.\n박대리가 수확해서 담은 청상추가 너무 가지런하다. 작물 키우는 애정이 높은 친구라 수확해서 정리하는 것도\n잘하고 있다. 이때까지 담은 청상추 세팅중에 제일 좋은 듯..\n청상추 재배는 줄이는 대신에 어떻게 하면 품질을 높일 수 있을지 고민해야 할 듯하다.",
      "content_length": 450
    }
  ]
}